{
    "name": "Cleo",
    "title": "Sorceress of Purgatory",
    "class": "wizard",
    "damageType": "magical",
    "position": "Middle",
    "weapon": {
        "uniqueWeapon": {
            "name": "Primal Flame, Flenos",
            "effect": [
                "Skill hits deal additional M.DMG equal to 3% of ATK per stack of Ember inflicted on enemies.",
                "Skill hits deal additional M.DMG equal to 3.6% of ATK per stack of Ember inflicted on enemies.",
                "Skill hits deal additional M.DMG equal to 4.3% of ATK per stack of Ember inflicted on enemies.",
                "Skill hits deal additional M.DMG equal to 5.2% of ATK per stack of Ember inflicted on enemies.",
                "Skill hits deal additional M.DMG equal to 6.3% of ATK per stack of Ember inflicted on enemies.",
                "Skill hits deal additional M.DMG equal to 7.5% of ATK per stack of Ember inflicted on enemies."
            ]
        },
        "soulWeapon": {
            "advancement0": "Summons the Soul of Primal Flame, Flenos, dealing ??? M.DMG to 5 enemies. Dealing DMG to enemies with this Skill increases DEF Penetration by 25 for 60 sec. This effect stacks up to 20 times.",
            "advancement1": "Increases DMG by 50%.",
            "advancement2": "Increases DMG by 50%. Each stack grants 2.5% ATK Boost effect.",
            "activation": "Charges up upon using Skills 6 times.",
            "cd": 22,
            "charges": 7
        }
    },
    "skills": [
        {
            "id": 1,
            "skillInfo": [
                {
                    "skillNumber": "s1",
                    "name": "Fire Needle",
                    "description": "Attacks a random enemy 5 times to deal a total of ??? M.DMG. Recovers own Mana by 100 upon a Critical Hit.",
                    "cooldown": 5,
                    "cost": 2
                }
            ],
            "light": "The skill's DMG is reduced by 50% when attacking more than 5 enemies, but all enemies will take damage.",
            "dark": "Stuns the target for 1 sec.",
            "books": [
                "DMG is increased by 10%.",
                "DMG is increased by 15%.",
                "DMG is increased by 25%."
            ],
            "uniqueTreasure": {
                "name": "Phoenix Lantern",
                "effect": [
                    "[Fire Needle] Changes target to the enemy with the highest ATK and reduces the target's Mana by 100.",
                    "[Fire Needle] Changes target to the enemy with the highest ATK and reduces the target's Mana by 120.",
                    "[Fire Needle] Changes target to the enemy with the highest ATK and reduces the target's Mana by 140.",
                    "[Fire Needle] Changes target to the enemy with the highest ATK and reduces the target's Mana by 170.",
                    "[Fire Needle] Changes target to the enemy with the highest ATK and reduces the target's Mana by 210.",
                    "[Fire Needle] Changes target to the enemy with the highest ATK and reduces the target's Mana by 250."
                ]
            }
        },
        {
            "id": 2,
            "skillInfo": [
                {
                    "skillNumber": "s2",
                    "name": "Fire Ball",
                    "description": "Attacks the target and the enemies in nearby range, dealing ??? M.DMG and stunning them for 2 sec. Deals ??? additional M.DMG to Bosses.",
                    "cooldown": 10,
                    "cost": 3
                }
            ],
            "light": "Upon hitting an enemy with 10 or more stacks of Ember, increases M.DMG it takes by 40% for 10 seconds.",
            "dark": "Inflicts 10 stacks of Ember on the hit enemy.",
            "books": [
                "DMG is increased by 10%.",
                "DMG is increased by 15%.",
                "DMG is increased by 25%."
            ],
            "uniqueTreasure": {
                "name": "Flamel's Elixir",
                "effect": [
                    "[Fire Ball] Reduces Mana Cost by 1 and increases DMG by 20%.",
                    "[Fire Ball] Reduces Mana Cost by 1 and increases DMG by 24%.",
                    "[Fire Ball] Reduces Mana Cost by 1 and increases DMG by 29%.",
                    "[Fire Ball] Reduces Mana Cost by 1 and increases DMG by 35%.",
                    "[Fire Ball] Reduces Mana Cost by 1 and increases DMG by 42%.",
                    "[Fire Ball] Reduces Mana Cost by 1 and increases DMG by 50%."
                ]
            }
        },
        {
            "id": 3,
            "skillInfo": [
                {
                    "skillNumber": "s3",
                    "name": "Fire Rain",
                    "description": "Attacks all enemies 5 times, dealing a total of ??? M.DMG. This attack deals 150% increased Crit DMG.",
                    "cooldown": 15,
                    "cost": 4
                }
            ],
            "light": "Increases DMG by 40%.",
            "dark": "Reduces Mana Cost by 2 for 10 sec when attacking more than 5 enemies. 10 sec Cooldown is applied.",
            "books": [
                "DMG is increased by 10%.",
                "DMG is increased by 15%.",
                "DMG is increased by 25%."
            ],
            "uniqueTreasure": {
                "name": "Tome of Purgatory",
                "effect": [
                    "[Fire Rain] Increases DMG by 20%. Upon Critical Hit on an enemy with 5 or more stacks of Ember, Cooldown will be reduced by {0}%. Upon killing an enemy with this Skill, Cooldown will be reduced by an additional {1}%.",
                    "[Fire Rain] Increases DMG by 24%. Upon Critical Hit on an enemy with 5 or more stacks of Ember, Cooldown will be reduced by {0}%. Upon killing an enemy with this Skill, Cooldown will be reduced by an additional {1}%.",
                    "[Fire Rain] Increases DMG by 29%. Upon Critical Hit on an enemy with 5 or more stacks of Ember, Cooldown will be reduced by {0}%. Upon killing an enemy with this Skill, Cooldown will be reduced by an additional {1}%.",
                    "[Fire Rain] Increases DMG by 35%. Upon Critical Hit on an enemy with 5 or more stacks of Ember, Cooldown will be reduced by {0}%. Upon killing an enemy with this Skill, Cooldown will be reduced by an additional {1}%.",
                    "[Fire Rain] Increases DMG by 42%. Upon Critical Hit on an enemy with 5 or more stacks of Ember, Cooldown will be reduced by {0}%. Upon killing an enemy with this Skill, Cooldown will be reduced by an additional {1}%.",
                    "[Fire Rain] Increases DMG by 50%. Upon Critical Hit on an enemy with 5 or more stacks of Ember, Cooldown will be reduced by {0}%. Upon killing an enemy with this Skill, Cooldown will be reduced by an additional {1}%."
                ]
            }
        },
        {
            "id": 4,
            "skillInfo": [
                {
                    "skillNumber": "s4",
                    "name": "Flame Diffusion",
                    "description": "Inflicts a stack of Ember upon hitting an enemy. Enemies affected by Ember take ??? M.DMG over 20 seconds. Ember can be stacked up to max 10 times."
                }
            ],
            "light": "The max number of Ember stacks is changed to 12.",
            "dark": "Every 10 sec, enemies affected by Ember are stunned for 2 sec. Enemies with more than 10 stacks of Ember are stunned for 3 sec.",
            "books": [
                "DMG is increased by 10%.",
                "DMG is increased by 15%.",
                "DMG is increased by 25%."
            ],
            "uniqueTreasure": {
                "name": "Introduction to Red Witch Spells",
                "effect": [
                    "[Flame Diffusion] Ember becomes irremovable and causes the target to take 1% increased M.DMG per stack.",
                    "[Flame Diffusion] Ember becomes irremovable and causes the target to take 1.2% increased M.DMG per stack.",
                    "[Flame Diffusion] Ember becomes irremovable and causes the target to take 1.4% increased M.DMG per stack.",
                    "[Flame Diffusion] Ember becomes irremovable and causes the target to take 1.7% increased M.DMG per stack.",
                    "[Flame Diffusion] Ember becomes irremovable and causes the target to take 2.1% increased M.DMG per stack.",
                    "[Flame Diffusion] Ember becomes irremovable and causes the target to take 2.5% increased M.DMG per stack."
                ]
            }
        }
    ],
    "light": "ATK, DEF, HP+15% / Crit Chance +100",
    "dark": "If a target has 10 stacks of Ember, increases the M.DMG the target takes by 30%, and adds 2 stacks of Ember per second to all non-hero enemies.",
    "background": {
        "profile": {
            "gender": "Female",
            "race": "Human",
            "age": "17 Years",
            "height": "156 cm",
            "birthday": "8(Month) 1(day), Month of Vitality",
            "constellation": "Kandala the Conqueror",
            "likes": "Campfire, pillows (?)",
            "dislikes": "Machines"
        },
        "story": "Cleo's earliest memory begins at the Tower of Sage. Raised by Dominiks the Great Sage as an orphan, she is both a genius wizard and a troublemaker. Her inability to control her own power has often led to trouble, including partial destruction of the Red Tower, her own residence. Despite this, her apparent immunity to the wrath of the Great Sage has caused her to be ostracized from her peers. Although this has led her to become selfish and inconsiderate, deep inside, she is still a kindhearted girl who fears abandonment by others.",
        "itemIntroductions": {
            "weapon": "The essence of the First Flame of the world. The Fire Elemental Lord bestowed this beautiful gem to a human who entered into a contract with him. Over the ages, it ended up in the hands of an archmage, who turned it into the core of his staff. Later, the archmage presented this staff to his precious disciple.",
            "soul": "The flame imbued inside Flenos was arrogant. Due to the Flame resistance Cleo had, she was able to endure the flame, but it had a risk of hurting her. Despite knowing this fact, Cleo pretended to ignore it, as she was confident that she will one day manage to make the flame hers, but also somewhat afraid of it.\nHowever, when her arrogance was met with the wall of reality, Cleo humbly peered into the flame of herself. She wanted to accept the wild, fierce flame completely.\n\nIt was then when Flenos' avatar made an advent, with the shape Cleo had yearned, as if it was greatly moved by Cleo's will.",
            "treasures": [
                "A magical lantern from the Tower of Sage. The ever-burning phoenix, the Tower of Sage's first flame, is sealed inside it. Dominics looked after it with great care as phoenixes are now endangered, but Cleo nonchalantly uses it to enhance her Fire Needle spell without taking her teacher's concerns into consideration.",
                "An elixir that fire alchemist Flamel created by condensing flame essence. Flamel's flames continue to burn and burn. Every wizard praises him for his flames, and the flame essence that he made with the salamanders from the Dragia Volcano maximizes the effect of Fire Ball.",
                "A scroll written by a fire sorceress who was known as the Goddess of Fire. A scroll left by the greatest Fire Sorceress of Orvelia, Vesta, when she was in the Tower of Sage. It's very powerful, but it also requires a lot of mana. Cleo took the Scroll of Purgatory from the Tower of Sage, which was considered a forbidden scroll. Now she's using it to enhance her Fire Rain.",
                "A textbook of Fire Magic by the Red Witch. This powerful spellbook is spreading all over the Empire in secret, but most mages consider it as taboo because it casts destructive magic and destroys the caster's mind."
            ]
        }
    },
    "skins": ["Magic Girl", "Beachside", "Witch", "Twinkle Pure", "Maid", "Smile of the Crimson Flames", "Beachside 2"],
    "voice": {
        "actor": {
            "jp": "N/A",
            "kr": "N/A",
            "en": "N/A"
        },
        "lines": {
            "jp": [],
            "kr": [],
            "en": []
        }
    }
}