{
    "name": "Morrah",
    "title": "Devil's Flame",
    "class": "knight",
    "damageType": "magical",
    "position": "Front",
    "weapon": {
        "uniqueWeapon": {
            "name": "Flame of Victory, Carprain",
            "effect": [
                "Normal attacks have a 20% chance to reduce ATK of the target by 10% and cause the target to take 10% increased M.DMG for 10 sec. If the target has more than 100 stacks of Flame, M.DMG boost is doubled.",
                "Normal attacks have a 20% chance to reduce ATK of the target by 12% and cause the target to take 12% increased M.DMG for 10 sec. If the target has more than 100 stacks of Flame, M.DMG boost is doubled.",
                "Normal attacks have a 20% chance to reduce ATK of the target by 14% and cause the target to take 14% increased M.DMG for 10 sec. If the target has more than 100 stacks of Flame, M.DMG boost is doubled.",
                "Normal attacks have a 20% chance to reduce ATK of the target by 17% and cause the target to take 17% increased M.DMG for 10 sec. If the target has more than 100 stacks of Flame, M.DMG boost is doubled.",
                "Normal attacks have a 20% chance to reduce ATK of the target by 21% and cause the target to take 21% increased M.DMG for 10 sec. If the target has more than 100 stacks of Flame, M.DMG boost is doubled.",
                "Normal attacks have a 20% chance to reduce ATK of the target by 25% and cause the target to take 25% increased M.DMG for 10 sec. If the target has more than 100 stacks of Flame, M.DMG boost is doubled."
            ]
        },
        "soulWeapon": {
            "advancement0": "Deals ??? M.DMG to nearby enemies within a circular range of self and knocks them down for 3 sec. Afterwards, summons Flame of Victory, Carprain for 13 sec, increasing self's ATK by 60%.",
            "advancement1": "For the duration of Skill, reduces M.DMG all allies take by 50%.",
            "advancement2": "For the duration of Skill, increases M.DMG all nearby enemies take by 40%. The effect is increased by 80% against Bosses.",
            "activation": "Charges up over 18 sec.",
            "cd": 22,
            "charges": 6
        }
    },
    "skills": [
        {
            "id": 1,
            "skillInfo": [
                {
                    "skillNumber": "s1",
                    "name": "Burning Power",
                    "description": "Deals ??? M.DMG to enemies in range and knocks them down, inflicting 3 stacks of Flame. Then for 15 sec, each auto attack deals ??? M.DMG and inflicts 1 stack of Flame on enemy. Per each stacked Flame, DMG is increased by 2%. Each Flame stack deals separate M.DMG and reduces Heal rate by 1%.",
                    "cooldown": 6,
                    "cost": 2
                }
            ],
            "light": "ATK Spd. is increased by 200 for 15 sec.",
            "dark": "Reduces cooldown by 6% per each enemy hit.",
            "books": [
                "DMG is increased by 10%.",
                "DMG is increased by 15%.",
                "DMG is increased by 25%."
            ],
            "uniqueTreasure": {
                "name": "Hell's Eye",
                "effect": [
                    "[Burning Power] Increases DMG by 20%, and Flame stacked upon enemies become irremovable.",
                    "[Burning Power] Increases DMG by 24%, and Flame stacked upon enemies become irremovable.",
                    "[Burning Power] Increases DMG by 29%, and Flame stacked upon enemies become irremovable.",
                    "[Burning Power] Increases DMG by 35%, and Flame stacked upon enemies become irremovable.",
                    "[Burning Power] Increases DMG by 42%, and Flame stacked upon enemies become irremovable.",
                    "[Burning Power] Increases DMG by 50%, and Flame stacked upon enemies become irremovable."
                ]
            }
        },
        {
            "id": 2,
            "skillInfo": [
                {
                    "skillNumber": "s2",
                    "name": "Hellfire",
                    "description": "For 20 sec, all allies' M.DEF is increased by ??? and M.Block Chance is increased by 250. Additionally, every 1 sec, inflicts 1 stack of Flame on nearby enemies.",
                    "cooldown": 12,
                    "cost": 3
                }
            ],
            "light": "M.Block rate is boosted by 20%.",
            "dark": "While Hellfire is active, deal DMG based on own M.DEF to nearby enemies.",
            "books": [
                "M.DEF boost is increased by 20%.",
                "M.DEF boost is increased by 30%.",
                "M.Block Chance boost is increased by 50%."
            ],
            "uniqueTreasure": {
                "name": "Hatchling Leather Gloves",
                "effect": [
                    "[Hellfire] Upon blocking target's M.ATK during the skill's duration, DMG reduction is increased by 100 and M.Crit resistance is increased by 250.",
                    "[Hellfire] Upon blocking target's M.ATK during the skill's duration, DMG reduction is increased by 120 and M.Crit resistance is increased by 250.",
                    "[Hellfire] Upon blocking target's M.ATK during the skill's duration, DMG reduction is increased by 140 and M.Crit resistance is increased by 250.",
                    "[Hellfire] Upon blocking target's M.ATK during the skill's duration, DMG reduction is increased by 170 and M.Crit resistance is increased by 250.",
                    "[Hellfire] Upon blocking target's M.ATK during the skill's duration, DMG reduction is increased by 210 and M.Crit resistance is increased by 250.",
                    "[Hellfire] Upon blocking target's M.ATK during the skill's duration, DMG reduction is increased by 250 and M.Crit resistance is increased by 250."
                ]
            }
        },
        {
            "id": 3,
            "skillInfo": [
                {
                    "skillNumber": "s3",
                    "name": "Lava Eruption",
                    "description": "Deals ??? M.DMG to enemies in range and inflict knock down. Per every stacked Flame, DMG is increased by 2%.",
                    "cooldown": 20,
                    "cost": 3
                }
            ],
            "light": "DMG is increased by 40%.",
            "dark": "Heals HP equal to 40% of DMG dealt.",
            "books": [
                "DMG is increased by 10%.",
                "DMG is increased by 15%.",
                "DMG is increased by 25%."
            ],
            "uniqueTreasure": {
                "name": "Hellish Sealing Stone",
                "effect": [
                    "[Lava Eruption] DMG is increased by 20% and target's M.DEF is decreased by 25% for 7 sec.",
                    "[Lava Eruption] DMG is increased by 24% and target's M.DEF is decreased by 25% for 7 sec.",
                    "[Lava Eruption] DMG is increased by 29% and target's M.DEF is decreased by 25% for 7 sec.",
                    "[Lava Eruption] DMG is increased by 35% and target's M.DEF is decreased by 25% for 7 sec.",
                    "[Lava Eruption] DMG is increased by 42% and target's M.DEF is decreased by 25% for 7 sec.",
                    "[Lava Eruption] DMG is increased by 50% and target's M.DEF is decreased by 25% for 7 sec."
                ]
            }
        },
        {
            "id": 4,
            "skillInfo": [
                {
                    "skillNumber": "s4",
                    "name": "Fire Smash",
                    "description": "Upon Block, deals ??? M.DMG to enemies in range, and inflicts 3 stack of Flame."
                }
            ],
            "light": "Increases own M.DEF by 5% per each block. Max stack is 10.",
            "dark": "Target with over 100 stacks of Flame takes 40% increased M.DMG.",
            "books": [
                "DMG is increased by 10%.",
                "DMG is increased by 15%.",
                "DMG is increased by 25%."
            ],
            "uniqueTreasure": {
                "name": "Jewel of Inferno",
                "effect": [
                    "[Fire Smash] Increases the number of Flame stacks by 3. Hit targets have their ATK Spd reduced by 140 for 5 sec.",
                    "[Fire Smash] Increases the number of Flame stacks by 3. Hit targets have their ATK Spd reduced by 170 for 5 sec.",
                    "[Fire Smash] Increases the number of Flame stacks by 3. Hit targets have their ATK Spd reduced by 210 for 5 sec.",
                    "[Fire Smash] Increases the number of Flame stacks by 3. Hit targets have their ATK Spd reduced by 250 for 5 sec.",
                    "[Fire Smash] Increases the number of Flame stacks by 3. Hit targets have their ATK Spd reduced by 300 for 5 sec.",
                    "[Fire Smash] Increases the number of Flame stacks by 3. Hit targets have their ATK Spd reduced by 360 for 5 sec."
                ]
            }
        }
    ],
    "light": "ATK, DEF, HP+15% / M. Block +200",
    "dark": "Flame stack DMG is increased by 100%, and max stack number is changed to 120",
    "background": {
        "profile": {
            "gender": "Female",
            "race": "Demon (Dark Dragon)",
            "age": "???",
            "height": "178 cm",
            "birthday": "4(Month) 9(Day), Month of Life",
            "constellation": "Armil the Saint",
            "likes": "Formidable enemies, worthy fights",
            "dislikes": "Dragons"
        },
        "story": "The former commander of the Dark Dragon Knights, she's the most gallant demon knight of the Demon Army. Currently, for some unknown reason, she is following the witch Maria and assisting her work. Many find it strange that the former champion of the Demon Army, who slaughtered countless enemies and even devoured dragons, now works for a mere witch as her servant. Nevertheless, she continues to faithfully serve her master.",
        "itemIntroductions": {
            "weapon": "In the heart of the Dragia Volcano, there exists a smithy. Hundreds of years ago, Temeraire, the ancient fire dragon, created a set of magically enchanted gear. Using lava infused with the power of the volcanic fire, he forged a shield and a sword capable of incinerating anything. During the war against Demons, Temeraire presented these to a human warrior. Unfortunately, the warrior is said to have been defeated by Morrah. No one has seen this legendary gear since then. That is, until Morrah reappeared on the front line.",
            "soul": "Carprain was originally a weapon tailored for the use of a human warrior, but it became distorted after failing into the hands of Morrah, the Draconic Commander.\nThe power of lava and fire of Carprain imbued by Temeraire became tainted by Morrah's destructive willpower, and this sword became more and more corrupted after absorbing countless blood of dragons from battlefields. Ultimately, Carprain, the sword originally crafted to be wielded by the protector of the world, transformed into a sword of destruction.\n\nHowever, Morrah, after absorbing God Dragon Oricana during the final battle of the Demon War, experienced changes in her soul. And this in turn, influenced Carprain as well. The power of darkness within Carprain had evolved anew after being exposed to Oricana's strengh.\nDespite being a weapon of a Draconic, Carprain came to contain the light of protection which guards all life, not the power of death and destruction.\n\nA sword of flame, imbued with light and reborn with the holy soul contained within, had become a guardian of flame that protects precious ones.",
            "treasures": [
                "The last eye of Belzebuna, a beast that feeds on the lava of hell. The eye, the only one left out of 100, blazes with dark lunacy. The beast smelt a sealing stone from Morrah, lost control, emerged from the lava, and dashed directly to her. Morrah, however, did not hesitate to stab its eyes with Carprain, and a completely different type of heat shriveled Belzebuna and absorbed its body. Looking at its entire body being crushed and the last eye wriggling on the ground, Morrah stuck it on her shield to mock the beast.",
                "Gloves made with a dark Hatchling's bones and skin. Morrah made it a hundred years ago by collecting the Hatchlings she killed when she went out to hunt dragons. It's very durable to even withstand Morrah's flames, and even imbues a stronger power to let those flames blaze up even more. Morrah really likes these gloves.",
                "A strange fragment that came from the Dimensional Rift. Inside the fragment, there's a flame that kills anything that is living. The energy from its dimension is condensed within it. It's absolutely needed to complete Maria's plan.",
                "A jewel containing the essence of Temeraire's Fire. When Temeraire was defeated, Morrah forcibly drew the Jewel of Inferno, the essence of Fire Dragon, out of it to enhance her Fire Smash."
            ]
        }
    },
    "skins": [],
    "voice": {
        "actor": {
            "jp": "Honda Mariko",
            "kr": "Kim Ha Young",
            "en": "N/A"
        },
        "lines": {
            "jp": [],
            "kr": [],
            "en": []
        }
    }
}
