{
  "name": "Rephy",
  "title": "Spiritual Guide",
  "class": "priest",
  "damageType": "magical",
  "position": "Back",
  "weapon": {
    "uniqueWeapon": {
      "name": "God's Lamp, Kurulati",
      "effect": [
        "Every 20 sec, an ally with the lowest HP turns invisible for 5 sec. An invisible ally becomes immune to P.DMG, and HP will not drop below 1%. MP Recovery per sec is increased to 120%.",
        "Every 20 sec, an ally with the lowest HP turns invisible for 6 sec. An invisible ally becomes immune to P.DMG, and HP will not drop below 1%. MP Recovery per sec is increased to 144%.",
        "Every 20 sec, an ally with the lowest HP turns invisible for 7 sec. An invisible ally becomes immune to P.DMG, and HP will not drop below 1%. MP Recovery per sec is increased to 172%.",
        "Every 20 sec, an ally with the lowest HP turns invisible for 8 sec. An invisible ally becomes immune to P.DMG, and HP will not drop below 1%. MP Recovery per sec is increased to 207%.",
        "Every 20 sec, an ally with the lowest HP turns invisible for 9 sec. An invisible ally becomes immune to P.DMG, and HP will not drop below 1%. MP Recovery per sec is increased to 248%.",
        "Every 20 sec, an ally with the lowest HP turns invisible for 10 sec. An invisible ally becomes immune to P.DMG, and HP will not drop below 1%. MP Recovery per sec is increased to 300%."
      ]
    },
    "soulWeapon": {
      "advancement0": "Summons the soul of God's Lamp, Kurulati for 10 sec, increases ATK Spd of all allies by 300 and Mana recovery per sec by 100%. Afterward, inflicts hallucination upon one random enemy every 3 sec, reducing their ACC by 350 for 3 sec.",
      "advancement1": "Inflicts hallucination upon 2 enemies and reduces the target's Mana by 500.",
      "advancement2": "Upon activation, immediately activates the invisibility effect of God's Lamp, Kurulati on 2 allies.",
      "activation": "Charges up upon using Skills 5 time.",
      "cd": 23,
      "charges": 6
    }
  },
  "skills": [
    {
      "id": 1,
      "skillInfo": [
        {
          "skillNumber": "s1",
          "name": "Healing Soul",
          "description": "Heals 4 allies with lowest HP 10% of Max HP, and heals extra ??? HP over 8 sec. This effect cannot be dispelled.",
          "cooldown": 10,
          "cost": 2
        }
      ],
      "light": "Mana Cost is increased by 1 and skill effect range changes to all allies.",
      "dark": "Each heal has a 20% chance to remove negative effects.",
      "books": [
        "Heal rate is increased by 10%.",
        "Heal rate is increased by 15%.",
        "MP recovery rate per sec is increased by 50%."
      ],
      "uniqueTreasure": {
        "name": "Melody of Blue Star",
        "effect": [
          "[Healing Soul] Reduces Mana Cost by 1, and increases the target's CC ACC by 100 for the duration of skill.",
          "[Healing Soul] Reduces Mana Cost by 1, and increases the target's CC ACC by 120 for the duration of skill.",
          "[Healing Soul] Reduces Mana Cost by 1, and increases the target's CC ACC by 140 for the duration of skill.",
          "[Healing Soul] Reduces Mana Cost by 1, and increases the target's CC ACC by 170 for the duration of skill.",
          "[Healing Soul] Reduces Mana Cost by 1, and increases the target's CC ACC by 210 for the duration of skill.",
          "[Healing Soul] Reduces Mana Cost by 1, and increases the target's CC ACC by 250 for the duration of skill."
        ]
      }
    },
    {
      "id": 2,
      "skillInfo": [
        {
          "skillNumber": "s2",
          "name": "Salvation",
          "description": "Dispels all negative effects. M.DEF is increased by ??? for 20 sec.",
          "cooldown": 12,
          "cost": 1
        }
      ],
      "light": "Mana cost is reduced by 1.",
      "dark": "Increases M.DEF by additional 10% of the caster's M.DEF.",
      "books": [
        "M.DEF boost is increased by 10%.",
        "M.DEF boost is increased by 15%.",
        "CC Resistance is increased by 250 for 20 sec."
      ],
      "uniqueTreasure": {
        "name": "Seed of Birth",
        "effect": [
          "[Salvation] Increases M.DEF Boost by 50% and reduces Cooldown by 12%.",
          "[Salvation] Increases M.DEF Boost by 50% and reduces Cooldown by 14%.",
          "[Salvation] Increases M.DEF Boost by 50% and reduces Cooldown by 17%.",
          "[Salvation] Increases M.DEF Boost by 50% and reduces Cooldown by 21%.",
          "[Salvation] Increases M.DEF Boost by 50% and reduces Cooldown by 25%.",
          "[Salvation] Increases M.DEF Boost by 50% and reduces Cooldown by 30%."
        ]
      }
    },
    {
      "id": 3,
      "skillInfo": [
        {
          "skillNumber": "s3",
          "name": "Soulrush",
          "description": "Deals a total of ??? M.DMG over 10 attacks to enemies within range. Hit enemies' ATK Spd is reduced by 25%.",
          "cooldown": 20,
          "cost": 3
        }
      ],
      "light": "Each hit removes 250 mana from the target.",
      "dark": "In exchange for 1 additional Mana Cost, Silence enemies in range for 1 sec.",
      "books": [
        "DMG is increased by 10%.",
        "DMG is increased by 15%.",
        "Target takes 25% increased P.DMG and M.DMG."
      ],
      "uniqueTreasure": {
        "name": "Haven of Souls",
        "effect": [
          "[Soulrush] Mana cost is reduced by 1 and heals all allies' HP by 8% of DMG.",
          "[Soulrush] Mana cost is reduced by 1 and heals all allies' HP by 10% of DMG.",
          "[Soulrush] Mana cost is reduced by 1 and heals all allies' HP by 12% of DMG.",
          "[Soulrush] Mana cost is reduced by 1 and heals all allies' HP by14% of DMG.",
          "[Soulrush] Mana cost is reduced by 1 and heals all allies' HP by 17% of DMG.",
          "[Soulrush] Mana cost is reduced by 1 and heals all allies' HP by 20% of DMG."
        ]
      }
    },
    {
      "id": 4,
      "skillInfo": [
        {
          "skillNumber": "s4",
          "name": "Spiritual Tuning",
          "description": "Every 7 sec, an ally with the lowest Hp recovers 1 orb of mana and ??? HP."
        }
      ],
      "light": "Uses the skill every 5 sec.",
      "dark": "Also supplies 1 orb of mana to the ally with the highest ATK.",
      "books": [
        "Heal rate is increased by 10%.",
        "Heal rate is increased by 15%.",
        "MP recovery rate is increased by 50%."
      ],
      "uniqueTreasure": {
        "name": "Blue Star Candy",
        "effect": [
          "[Spiritual Tuning] Increases Heal Rate by 50%. Targets have their ATK increased by 20% for 4 sec.",
          "[Spiritual Tuning] Increases Heal Rate by 50%. Targets have their ATK increased by 24% for 4 sec.",
          "[Spiritual Tuning] Increases Heal Rate by 50%. Targets have their ATK increased by 29% for 4 sec.",
          "[Spiritual Tuning] Increases Heal Rate by 50%. Targets have their ATK increased by 35% for 4 sec.",
          "[Spiritual Tuning] Increases Heal Rate by 50%. Targets have their ATK increased by 42% for 4 sec.",
          "[Spiritual Tuning] Increases Heal Rate by 50%. Targets have their ATK increased by 50% for 4 sec."
        ]
      }
    }
  ],
  "light": "ATK, DEF, HP+15% / M.Dodge +100",
  "dark": "Upon attacking, there is a 10% chance to reduce all DEF of the target by 20% and reduce all the hero's cooldowns by 5%.",
  "background": {
    "profile": {
      "gender": "missing",
      "race": "missing",
      "age": "missing",
      "height": "missing",
      "birthday": "missing",
      "constellation": "missing",
      "likes": "Souls, kind people",
      "dislikes": "Causing harm to others"
    },
    "story": "This pure and kindhearted Tamian soul guide can communicate with the dead. The Tamian race lives in harmony with nature, and they have the ability to read its flow and guide the souls of the dead. Rephy's ability as a soul guide is exceptional, even for a Tamian. He uses it to guide the souls of those who died in the forest and help them pass on, preventing them from turning evil. He is the most capable among the Tamians in discerning the paths of the stars, pacifying the souls of the dead, and properly guiding them to the afterlife.",
    "itemIntroductions": {
      "weapon": "It is the duty of a soul guide to lead the lost souls onto the right path, to help them move on to the next life. This lamp, powered by a mysterious orb created long ago by a dragon from a distant land, is a treasure of the Tamians. The orb at its core allows nearby souls to materialize, making it possible for its wielder to talk to them directly. As such, it is the ultimate medium for a soul guide. Tamian chieftains have used this relic to carry out the sacred duties of a soul guide for generations. Now, in the face a great danger that threatens the world, the lamp has been passed on to Rephy, the most powerful soul guide in existence.",
      "treasures": [
        "A small music box containing the voice of Asiphia, Queen of Blue star. Rephy opens it when guiding souls. The souls heading to the Garden of Rest receive the grace of the Blue Star by listening to the song of Asiphia recorded in the box. When Asiphia's voice flows, twinkling like starlight, nothing dark or corrupt can come near those souls.",
        "A collection of the energy that is created when a life is born. It's very warm and gentle, so souls like it. Rephy uses it to start a fire in a lamp to borrow the power of the souls. When a seed is put in a lamp, it shines brightly, like when the sun was first born.",
        "An ornament that was used for the memorial ceremonies of deceased royalty in ancient times. Inside the green jewel, there's a crystallized tear of the mythical creature that leads people to death. It's used as a resting places to comfort the emptiness within souls.",
        "A specialty of Lamp-keeper Town. This candy that looks like a blue star is Rephy's favorite snack. It is made from 'Jolt out of Sleep,' a blue herb that only grows in Lamp-keeper Town. Every time Rephy leaves town for journey, the village head always puts this candy in his pocket."
      ]
    }
  },
  "skins": [],
  "voice": {
    "actor": {
      "jp": "N/A",
      "kr": "N/A",
      "en": "N/A"
    },
    "lines": {
      "jp": [],
      "kr": [],
      "en": []
    }
  }
}