{
  "name": "Mirianne",
  "title": "Servant of Blue",
  "class": "assassin",
  "damageType": "magical",
  "position": "Middle",
  "weapon": {
    "uniqueWeapon": {
      "name": "Endless Acceleration, Riventina",
      "effect": [
        "Increases ATK Spd by 200, and attacks on Locked On enemies, dealing 200% of ATK as extra M.DMG. Extra damage effect occurs once in 2 sec.",
        "Increases ATK Spd by 240, and attacks on Locked On enemies, dealing 240% of ATK as extra M.DMG. Extra damage effect occurs once in 2 sec.",
        "Increases ATK Spd by 290, and attacks on Locked On enemies, dealing 290% of ATK as extra M.DMG. Extra damage effect occurs once in 2 sec.",
        "Increases ATK Spd by 350, and attacks on Locked On enemies, dealing 350% of ATK as extra M.DMG. Extra damage effect occurs once in 2 sec.",
        "Increases ATK Spd by 420, and attacks on Locked On enemies, dealing 420% of ATK as extra M.DMG. Extra damage effect occurs once in 2 sec.",
        "Increases ATK Spd by 500, and attacks on Locked On enemies, dealing 500% of ATK as extra M.DMG. Extra damage effect occurs once in 2 sec."
      ]
    },
    "soulWeapon": {
      "advancement0": "Places Endless Acceleration, Riventina on the ground for 10 sec. Endless Acceleration, Riventina attacks the enemy with the lowest M.DEF, dealing ??? M.DMG and inflicting 'Target Lock On'. Afterwards, attack the enemy every 3 sec, dealing ??? M.DMG and inflicting stun for 2 sec. All effects prioritize the enemy inflicted with 'Target Lock On'.",
      "advancement1": "Upon activation, increases Mirianne's Crit DMG by 100% and ACC by 300 for 10 sec.",
      "advancement2": "Upon activation, [Assassination] ignores the enemy's DEF, and increases its DMG by 30% for 10 sec.",
      "activation": "Charges up upon using Skills 5 times.",
      "cd": 23,
      "charges": 6
    }
  },
  "skills": [
    {
      "id": 1,
      "skillInfo": [
        {
          "skillNumber": "s1",
          "name": "Target Lock On",
          "description": "Attacks the enemy with the lowest M.DEF 3 times, dealing a total of ??? M.DMG and inflicting stun for 1 sec, and if the target is under 'Target Lock On', target takes additional ??? M.DMG. The last attack inflicts 'Target Lock On' on the enemy for 10 sec. Lock On cannot be dispelled, and the target's M.Block rate has decreased by 500.",
          "cooldown": 6,
          "cost": 1
        }
      ],
      "light": "When there is 1 enemy, DMG is boosted by 100%.",
      "dark": "Stun duration is increased by 1 sec.",
      "books": [
        "DMG is increased by 10%.",
        "DMG is increased by 15%.",
        "DMG is increased by 25%."
      ],
      "uniqueTreasure": {
        "name": "Proof of Endeavor",
        "effect": [
          "[Target Lock On] Increases DMG by 20%, and reduces the target's M.Crit Resistance by 500 for 10 sec.",
          "[Target Lock On] Increases DMG by 24%, and reduces the target's M.Crit Resistance by 500 for 10 sec.",
          "[Target Lock On] Increases DMG by 29%, and reduces the target's M.Crit Resistance by 500 for 10 sec.",
          "[Target Lock On] Increases DMG by 35%, and reduces the target's M.Crit Resistance by 500 for 10 sec.",
          "[Target Lock On] Increases DMG by 42%, and reduces the target's M.Crit Resistance by 500 for 10 sec.",
          "[Target Lock On] Increases DMG by 50%, and reduces the target's M.Crit Resistance by 500 for 10 sec."
        ]
      }
    },
    {
      "id": 2,
      "skillInfo": [
        {
          "skillNumber": "s2",
          "name": "Restrain and Protect",
          "description": "Deals ??? M.DMG to target enemy and other enemies in range, and Stuns them for 2 sec. Then moves to an ally with the lowest P.DEF, excluding self, and creates Shield for two that can block ??? DMG for 10 sec. Shield will be ineffective when there is no ally. Gains immunity to CC while the Shield lasts.",
          "cooldown": 12,
          "cost": 3
        }
      ],
      "light": "Gain CC immunity while using said skill.",
      "dark": "Stun duration is increased by 2 sec.",
      "books": [
        "DMG and Shield are increased by 10%.",
        "DMG and Shield are increased by 15%.",
        "DMG and Shield are increased by 25%."
      ],
      "uniqueTreasure": {
        "name": "Gemini Ring of Instant Teleportation",
        "effect": [
          "[Restrain and Protect] Reduces Mana Cost by 1 and upon Crit hit recovers 160 Mana.",
          "[Restrain and Protect] Reduces Mana Cost by 1 and upon Crit hit recovers 190 Mana.",
          "[Restrain and Protect] Reduces Mana Cost by 1 and upon Crit hit recovers 230 Mana.",
          "[Restrain and Protect] Reduces Mana Cost by 1 and upon Crit hit recovers 270 Mana.",
          "[Restrain and Protect] Reduces Mana Cost by 1 and upon Crit hit recovers 330 Mana.",
          "[Restrain and Protect] Reduces Mana Cost by 1 and upon Crit hit recovers 400 Mana."
        ]
      }
    },
    {
      "id": 3,
      "skillInfo": [
        {
          "skillNumber": "s3",
          "name": "Assassination",
          "description": "Moves to an enemy with the lowest HP, deals ??? M.DMG then returns to the furthest ally. If the enemy is not a hero, deals ??? additional M.DMG that ignores DEF. Defeating a target with this skill instantly triggers 'Restrain and Protect'.",
          "cooldown": 14,
          "cost": 2
        }
      ],
      "light": "Dispels target's positive effects and inflicts Stun for 1 sec.",
      "dark": "DMG is increased by 40%.",
      "books": [
        "DMG is increased by 10%.",
        "DMG is increased by 15%.",
        "DMG is increased by 25%."
      ],
      "uniqueTreasure": {
        "name": "Magic Powder of Lightning",
        "effect": [
          "[Assassination] DMG is increased by 50% and upon Crit Hit increases own ATK by 10% for 10 sec.",
          "[Assassination] DMG is increased by 50% and upon Crit Hit increases own ATK by 12% for 10 sec.",
          "[Assassination] DMG is increased by 50% and upon Crit Hit increases own ATK by 14% for 10 sec.",
          "[Assassination] DMG is increased by 50% and upon Crit Hit increases own ATK by 17% for 10 sec.",
          "[Assassination] DMG is increased by 50% and upon Crit Hit increases own ATK by 21% for 10 sec.",
          "[Assassination] DMG is increased by 50% and upon Crit Hit increases own ATK by 25% for 10 sec."
        ]
      }
    },
    {
      "id": 4,
      "skillInfo": [
        {
          "skillNumber": "s4",
          "name": "Target Eliminated",
          "description": "If an enemy is inflicted by 'Target Lock On', ATK increases by ??? and all attacks skills prioritize Locked On enemies. When the Locked On enemies dies, 'Target Lock On' is inflicted on another enemy for 10 sec."
        }
      ],
      "light": "When there is an enemy inflicted by 'Target Lock On', Crit Chance is increased by 400.",
      "dark": "Receives 30% reduced DMG when enemy is inflicted by 'Target Lock On'.",
      "books": [
        "ATK boost is increased by 10%.",
        "ATK boost is increased by 15%.",
        "ATK boost is increased by 25%."
      ],
      "uniqueTreasure": {
        "name": "Birth of Miracle",
        "effect": [
          "[Target Eliminated] Increases ATK boost by 50%. Every 5 sec, stuns enemies under Target Lock On for 1 sec.",
          "[Target Eliminated] Increases ATK boost by 50%. Every 5 sec, stuns enemies under Target Lock On for 1.2 sec.",
          "[Target Eliminated] Increases ATK boost by 50%. Every 5 sec, stuns enemies under Target Lock On for 1.4 sec.",
          "[Target Eliminated] Increases ATK boost by 50%. Every 5 sec, stuns enemies under Target Lock On for 1.7 sec.",
          "[Target Eliminated] Increases ATK boost by 50%. Every 5 sec, stuns enemies under Target Lock On for 2.1 sec.",
          "[Target Eliminated] Increases ATK boost by 50%. Every 5 sec, stuns enemies under Target Lock On for 2.5 sec."
        ]
      }
    }
  ],
  "light": "ATK, DEF, HP+15% / Crit DMG +20%",
  "dark": "Upon killing an enemy, all skill cooldown is reduced by 50%, and recovers 1 orb of mana.",
  "background": {
    "profile": {
      "gender": "Female",
      "race": "Half-Elf",
      "age": "12 (Physical age: 18)",
      "height": "162 cm",
      "birthday": "10(Month) 5(Day), Month of Friendship",
      "constellation": "Asiphia the Empress",
      "likes": "Sonia, and everyone at the orphanage",
      "dislikes": "Bugs with many legs"
    },
    "story": "She is Sonia's maid and sister-like friend from the orphanage. When her village of Humans and Elves was attacked by the Demons, she was the only survivor. Ricardo found her and took her into his orphanage. For some unknown reason, she experienced explosive growth phase at the age of 6. Her body now resembles that of an 18-year-old, but she still has the mind of a child. She is pure and devotional to a fault. Perhaps these traits are related to the loss of her childhood memories.",
    "itemIntroductions": {
      "weapon": "A magic gear created by Sonia, the Archmage of Blue. It is enchanted with magic that allows it to reach incredible speeds. It is also enchanted with a special spell that always guides it back to its owner after it's thrown. It is the best gift Sonia could give to Mirianne, who is both a family and a friend to her. In other words, it's a unique expression of love reserved only for Mirianne.",
      "soul": "A magical weapon Sonia crafted for Mirianne, Riventina.\nWhen Sonia infused the power of lightning into Riventina, Baikal within Sonia also infused part of itself into the new weapon.\n\nMirianne learned, experienced, and felt many aspects of life as time passed by, and the shard of lightning within Mirianne's dagger grew with her.\nThe shard would shift its shape to project Mirianne's emotion, experience, and her way of life.\n\nThe shard stayed with her, and watched over her whenever she went on an adventure to bring back her lost memory, whenever she suffered from nightmares and spent the night without getting any sleep, and whenever she concealed her tears with laughter.\n\nThe shard of lightning watched her journey unfold, and stayed by her side, waiting for the day it will become a strong power of lightning, powerful enough to protect Mirianne...",
      "treasures": [
        "A throwing dagger made by Ricardo that Mirianne used for practice. Mirianne was the only survivor of a village where elves and humans lived together. When Ricardo took her to the orphanage, he feared that she might close her heart after realizing that she was different from the others in the town. Sonia, who was visiting Orvelia, would be the one to allay his worries. He asked Sonia to look after the little girl and gave her this training dagger to prepare her for the journey.",
        "Ring that Mirianne purchased at the 'Amazing Magic Toy Shop' in Orvel. She engraved Sonia's and her name in the ring. The two make a set, and it allows each other to teleport to the location of the other once a day. Though, Sonia doesn't use it since it's troublesome... It may be a toy, but Mirianne is happy that there's one more way for her to protect Sonia.",
        "A collection of beautiful matter that is sprayed in Sonia's crystal ball like stars. Mirianne collected it to pull a prank, but it's so powerful that it's being used as a tool for assassination.",
        "A leaf necklace Mirianne's mother made to celebrate her birth. Her mother, praying that her beloved daughter would grow up in the town of Ella without harm, stuck an Elven jewel of luck into the wooden pendant. However, destiny had other plans, as Ella was invaded by demonic creatures. She died, leaving all that is left in her into Mirianne's necklace. It protected Mirianne until Ricardo found her, and the necklace crumbled into dust after serving its purpose. Ricardo pitied Mirianne, the lone survivor of Ella. A few years later, he asked Loman to make a similar necklace and gave it to Mirianne."
      ]
    }
  },
  "skins": [],
  "voice": {
    "actor": {
      "jp": "Maeda Kaori",
      "kr": "Park Min Seon",
      "en": "N/A"
    },
    "lines": {
      "jp": [],
      "kr": [],
      "en": []
    }
  }
}
