{
  "name": "Miruru",
  "title": "Cursed Pirate Empress",
  "class": "mechanic",
  "damageType": "physical",
  "position": "Middle",
  "weapon": {
    "uniqueWeapon": {
      "name": "Ultimate Weapon, Leviathan",
      "effect": [
        "Deals P.DMG equal to 100% of ATK to the enemies inflicted by the Boooooom! skill at a 50% chance, and the target takes 20% more P.DMG for 10 seconds.",
        "Deals P.DMG equal to 120% of ATK to the enemies inflicted by the Boooooom! skill at a 50% chance, and the target takes 24% more P.DMG for 10 seconds.",
        "Deals P.DMG equal to 140% of ATK to the enemies inflicted by the Boooooom! skill at a 50% chance, and the target takes 29% more P.DMG for 10 seconds.",
        "Deals P.DMG equal to 170% of ATK to the enemies inflicted by the Boooooom! skill at a 50% chance, and the target takes 35% more P.DMG for 10 seconds.",
        "Deals P.DMG equal to 210% of ATK to the enemies inflicted by the Boooooom! skill at a 50% chance, and the target takes 42% more P.DMG for 10 seconds.",
        "Deals P.DMG equal to 250% of ATK to the enemies inflicted by the Boooooom! skill at a 50% chance, and the target takes 50% more P.DMG for 10 seconds."
      ]
    },
    "soulWeapon": {
      "advancement0": "Summons the soul of Ultimate Weapon, Leviathan, icnreasin own ATK by 30% for 10 sec, and dealing ??? P.DMG to all enemies every 3 sec. Each hit increases P.DMG the enemies take by 20% for 5 sec.",
      "advancement1": "Increases the P.DMG Boost effect by additional 20%.",
      "advancement2": "Reduces Cooldown by 7 sec.",
      "activation": "Charges up over 22 sec.",
      "cd": 18,
      "charges": 8
    }
  },
  "skills": [
    {
      "id": 1,
      "skillInfo": [
        {
          "skillNumber": "s1",
          "name": "Baaaam!",
          "description": "Deals ??? P.DMG to all enemies and pushes them back.",
          "cooldown": 7,
          "cost": 2
        }
      ],
      "light": "Increase P.DMG that the target takes by 25% for 10 sec.",
      "dark": "Upon activation, ATK is increased by 35% for 10 sec.",
      "books": [
        "DMG is increased by 10%.",
        "DMG is increased by 15%.",
        "DMG is increased by 25%."
      ],
      "uniqueTreasure": {
        "name": "Coin of the Deep",
        "effect": [
          "[Baaaam!] Gains Immunity to CC for the skill's duration, and reduces the target's P.Crit Resistance by 200 for 10 sec.",
          "[Baaaam!] Gains Immunity to CC for the skill's duration, and reduces the target's P.Crit Resistance by 240 for 10 sec.",
          "[Baaaam!] Gains Immunity to CC for the skill's duration, and reduces the target's P.Crit Resistance by 290 for 10 sec.",
          "[Baaaam!] Gains Immunity to CC for the skill's duration, and reduces the target's P.Crit Resistance by 350 for 10 sec.",
          "[Baaaam!] Gains Immunity to CC for the skill's duration, and reduces the target's P.Crit Resistance by 420 for 10 sec.",
          "[Baaaam!] Gains Immunity to CC for the skill's duration, and reduces the target's P.Crit Resistance by 500 for 10 sec."
        ]
      }
    },
    {
      "id": 2,
      "skillInfo": [
        {
          "skillNumber": "s2",
          "name": "Roll Over",
          "description": "Deals ??? P.DMG 3 times to frontal enemies, and each attack has a 100% chance of knocking them down for 2 sec.",
          "cooldown": 13,
          "cost": 2
        }
      ],
      "light": "DMG is increased by 40%.",
      "dark": "For each enemy that takes DMG, reduce cooldown by 8%.",
      "books": [
        "DMG is increased by 10%.",
        "DMG is increased by 15%.",
        "DMG is increased by 25%."
      ],
      "uniqueTreasure": {
        "name": "Pirate King's Sextant",
        "effect": [
          "[Roll Over] increases DMG by 4% on every use and recovers 120 MP upon a Crit Hit. This effect stacks up to max 10 times.",
          "[Roll Over] increases DMG by 4.8% on every use and recovers 120 MP upon a Crit Hit. This effect stacks up to max 10 times.",
          "[Roll Over] increases DMG by 5.8% on every use and recovers 120 MP upon a Crit Hit. This effect stacks up to max 10 times.",
          "[Roll Over] increases DMG by 7% on every use and recovers 120 MP upon a Crit Hit. This effect stacks up to max 10 times.",
          "[Roll Over] increases DMG by 8.4% on every use and recovers 120 MP upon a Crit Hit. This effect stacks up to max 10 times.",
          "[Roll Over] increases DMG by 10% on every use and recovers 120 MP upon a Crit Hit. This effect stacks up to max 10 times."
        ]
      }
    },
    {
      "id": 3,
      "skillInfo": [
        {
          "skillNumber": "s3",
          "name": "Miruru Pirates!",
          "description": "Attacks a random target and the enemies near it 5 times, dealing a total of ??? P.DMG and reducing their ATK Spd by 400. If the target is not a Hero, deals ??? additional P.DMG.",
          "cooldown": 20,
          "cost": 4
        }
      ],
      "light": "If there is 1 enemy, DMG is increased by 100%.",
      "dark": "Removes ATK Spd debuff effect and adds a 3 sec Stun.",
      "books": [
        "DMG is increased by 10%.",
        "DMG is increased by 15%.",
        "DMG is increased by 25%."
      ],
      "uniqueTreasure": {
        "name": "Miruru Cannonball",
        "effect": [
          "[Miruru Pirates!] DMG is increased by 50%, and skill cooldown is reduced by 12%.",
          "[Miruru Pirates!] DMG is increased by 50%, and skill cooldown is reduced by 14%.",
          "[Miruru Pirates!] DMG is increased by 50%, and skill cooldown is reduced by 17%.",
          "[Miruru Pirates!] DMG is increased by 50%, and skill cooldown is reduced by 21%.",
          "[Miruru Pirates!] DMG is increased by 50%, and skill cooldown is reduced by 25%.",
          "[Miruru Pirates!] DMG is increased by 50%, and skill cooldown is reduced by 30%."
        ]
      }
    },
    {
      "id": 4,
      "skillInfo": [
        {
          "skillNumber": "s4",
          "name": "Boooooom!",
          "description": "When dealing a normal attack, shoots additional bullet with a 60% chance of dealing ??? P.DMG to all enemies."
        }
      ],
      "light": "Increases ATK by 0.5% for 10 seconds upon a Crit Hit. This effect can be stacked up to max 100 times.",
      "dark": "Activation chance changes to 80%.",
      "books": [
        "DMG is increased by 10%.",
        "DMG is increased by 15%.",
        "DMG is increased by 25%."
      ],
      "uniqueTreasure": {
        "name": "Turtle Gunpowder Keg",
        "effect": [
          "[Boooooom!] Increases DMG by 50%. Upon activation, increases ATK Spd by 200 for 3 sec.",
          "[Boooooom!] Increases DMG by 50%. Upon activation, increases ATK Spd by 240 for 3 sec.",
          "[Boooooom!] Increases DMG by 50%. Upon activation, increases ATK Spd by 290 for 3 sec.",
          "[Boooooom!] Increases DMG by 50%. Upon activation, increases ATK Spd by 350 for 3 sec.",
          "[Boooooom!] Increases DMG by 50%. Upon activation, increases ATK Spd by 420 for 3 sec.",
          "[Boooooom!] Increases DMG by 50%. Upon activation, increases ATK Spd by 500 for 3 sec."
        ]
      }
    }
  ],
  "light": "ATK, DEF, HP+15% / Crit Chance +100",
  "dark": "Miruru stacks Darkness depending on the number of enemies she hits. When she reaches 50 stacks, she goes berserk, boosting her Atk Spd by 800 and her ATK by 20%.",
  "background": {
    "profile": {
      "gender": "Female",
      "race": "Human",
      "age": "27 (Mentally: 12)",
      "height": "130 cm",
      "birthday": "5(Month) 31(Day), Month of Hope",
      "constellation": "Graham the Thief",
      "likes": "Treasures or anything that sparkles",
      "dislikes": "The Navy"
    },
    "story": "She once roamed the seas as the pirate empress, instilling fear in sailors' hearts. However, a cursed item has turned her into a child, and all her loyal allies and crew members soon left her. Not one to give up, she started again from the scratch, and now dreams of returning to her former glory. Unfortunately, the curse of childhood has made her way of thinking immature as well. Even so, she continues to chase her dream. Currently, she commands the second Miruru Pirates consisting of Goblins and Gnolls.",
    "itemIntroductions": {
      "weapon": "Back when Miruru reigned as the pirate empress, she was feared by sailors and a major threat to the naval forces of Orvelia and the empire. The cannons on her ship were especially terrifying to the Navy. The most powerful of them was the Leviathan, the ship's main cannon. After being cursed, she took one thing with her as she fled from her mutinous crew. Its value as a weapon is in fact far more valuable than any gold or loot. She took with her the Leviathan, the most powerful cannon in her arsenal. After numerous modifications, the once-terror of the sea now serves as a mobile artillery.",
      "soul": "Leviathan was the pirate queen's main cannon during her reign in the seas, and even now, it stays by its master's side.\nAlthough the cursed pirate queen no longer has the shadow of her former self as her mental age is that of a kid, Leviathan still remembers the infamous Pirate Queen Miruru who ruled over the seas. After seeing how hard its master is trying to rise again in spite of losing everything. Leviathan appeared in front of Miruru's eyes in the form of a sea dragon, the ruler of the seas. Leviathan's form is a manifestation of its will to commemorate the time when Miruru was at her prime, and it contains Leviathan's deep loyalty toward its master, as well as its resolve to help its master fulfill her wish to retrieve her past glory.",
      "treasures": [
        "Miruru's lucky coin is an ancient treasure of the sunken kingdom. It is a trophy from her first treasure expedition after her form was changed into that of a kid. The coin, crafted via ancient metallurgy, was kept in Miruru's breast pocket, and it's now her precious lucky charm after saving her life several times.",
        "Sextant of Pirate King Olga, who was the first to discover the new continent. Pirate King Olga went past the Orbis Continent to find a new continent, following a revelation from the gods. The sextant can calculate the most accurate location and angle in the world. Miruru uses the sextant to boost the damage from rolling bomb attacks, but she doesn't remember how she ended up with it.",
        "Cannonball engraved with the symbol of the Miruru Pirates. Miruru still vividly remembers her glorious past. Her fluttering flag emblazoned with a shark, and the sounds of explosions that were at her command. Those fond memories of enemy ships sinking in terror still remain within her. Miruru is using special cannonballs to attack enemies, while waiting for the glorious days to come back once again.",
        "A cannonball that Miruru made in collaboration with a new friend who is an explosives expert. Having met last summer, both Miruru and Lakrak developed this special cannonball that is used for igniting the cannon. As the gunpowder has a low ignition point, Miruru has been keeping it safe in a turtle powder keg she found in a treasure ship."
      ]
    }
  },
  "skins": ["Grade School", "Beachside", "Santa", "Viking", "Little Pumpkin Witch", "Heart Stealer"],
  "voice": {
    "actor": {
      "jp": "N/A",
      "kr": "N/A",
      "en": "N/A"
    },
    "lines": {
      "jp": [],
      "kr": [],
      "en": []
    }
  }
}