{
    "name": "Seria",
    "title": "Shadow of the Abyss",
    "class": "warrior",
    "damageType": "magical",
    "position": "Front",
    "weapon": {
        "uniqueWeapon": {
            "name": "Executioner of Domains, Elsion",
            "effect": [
                "Reduces own Heal Rate by 20%. Upon a critical skill hit, deals additional M.DMG of 30% ATK. Reduces Heal Rate of the target by 24% for 5 sec, and increases own Heal Rate by 4% for 20 sec. The Heal Rate increasing effect can be stacked up to max 5 times, and cannot be dispelled.",
                "Reduces own Heal Rate by 20%. Upon a critical skill hit, deals additional M.DMG of 36% ATK. Reduces Heal Rate of the target by 29% for 5 sec, and increases own Heal Rate by 5% for 20 sec. The Heal Rate increasing effect can be stacked up to max 5 times, and cannot be dispelled.",
                "Reduces own Heal Rate by 20%. Upon a critical skill hit, deals additional M.DMG of 42% ATK. Reduces Heal Rate of the target by 35% for 5 sec, and increases own Heal Rate by 6% for 20 sec. The Heal Rate increasing effect can be stacked up to max 5 times, and cannot be dispelled.",
                "Reduces own Heal Rate by 20%. Upon a critical skill hit, deals additional M.DMG of 51% ATK. Reduces Heal Rate of the target by 42% for 5 sec, and increases own Heal Rate by 7% for 20 sec. The Heal Rate increasing effect can be stacked up to max 5 times, and cannot be dispelled.",
                "Reduces own Heal Rate by 20%. Upon a critical skill hit, deals additional M.DMG of 63% ATK. Reduces Heal Rate of the target by 50% for 5 sec, and increases own Heal Rate by 9% for 20 sec. The Heal Rate increasing effect can be stacked up to max 5 times, and cannot be dispelled.",
                "Reduces own Heal Rate by 20%. Upon a critical skill hit, deals additional M.DMG of 75% ATK. Reduces Heal Rate of the target by 60% for 5 sec, and increases own Heal Rate by 10% for 20 sec. The Heal Rate increasing effect can be stacked up to max 5 times, and cannot be dispelled."
            ]
        },
        "soulWeapon": {
            "advancement0": "Summons the soul of Executioner of Domains, ELsion and deals ??? M.DMG to nearby enemies withing a circular range of self and increases M.DMG the enemies take 30% for 5 sec. Afterward, absorbs the soul of Executioner of Domains, Elsion for 10 sec and deals ??? M.DMG t one random enemy every 1 sec. If the target is not a Hero, the DMG increases by 100%.",
            "advancement1": "For the duration of Skill, Seria's ATK is increased by 25%, and Crit DMG is increased by 50%.",
            "advancement2": "DMG dealt every 1 sec now ignores target's DEF.",
            "activation": "Charges up over 20 sec.",
            "cd": 24,
            "charges": 5
        }
    },
    "skills": [
        {
            "id": 1,
            "skillInfo": [
                {
                    "skillNumber": "s1",
                    "name": "Mysterious Sword - Falling Petals",
                    "description": "Performs a horizontal slash to the front and deals ??? M.DMG to the target and enemies in a narrow range. Can activate [Mysterious Sword - Blossom] once within 5 sec after use.",
                    "cooldown": 7,
                    "cost": 1
                },
                {
                    "skillNumber": "s1_2",
                    "name": "Mysterious Sword - Blossom",
                    "description": "Performs a vertical slash to the front and deals ??? M.DMG to the target and enemies in a narrow range.",
                    "cooldown": 0,
                    "cost": 1,
                    "linked": "s1_0"
                }
            ],
            "light": "[Mysterious Sword - Falling Petals] - Mana cost is reduced by 1. [Mysterious Sword - Blossom] - Hit enemies' heal rate is reduced by 50% for 5 sec.",
            "dark": "[Mysterious Sword - Falling Petals] - Target takes 25% increased M.DMG for 10 sec. [Mysterious Sword - Blossom] - Mana cost is increased by 1, and Ignores enemy's DEF.",
            "books": [
                "DMG is increased by 10%.",
                "DMG is increased by 15%.",
                "DMG is increased by 25%."
            ],
            "uniqueTreasure": {
                "name": "Whetstone of Demon",
                "effect": [
                    "[Mysterious Sword - Falling Petals] Increases DMG by 50%, and upon Critical Hit, recovers Mana by 200. [Mysterious Sword - Blossom] Increases DMG by 50%, and upon Critical Hit, reduces Cooldown of [Mysterious Sword - Falling Petals] by 0.8 sec.",
                    "[Mysterious Sword - Falling Petals] Increases DMG by 50%, and upon Critical Hit, recovers Mana by 240. [Mysterious Sword - Blossom] Increases DMG by 50%, and upon Critical Hit, reduces Cooldown of [Mysterious Sword - Falling Petals] by 1 sec.",
                    "[Mysterious Sword - Falling Petals] Increases DMG by 50%, and upon Critical Hit, recovers Mana by 290. [Mysterious Sword - Blossom] Increases DMG by 50%, and upon Critical Hit, reduces Cooldown of [Mysterious Sword - Falling Petals] by 1.2 sec.",
                    "[Mysterious Sword - Falling Petals] Increases DMG by 50%, and upon Critical Hit, recovers Mana by 350. [Mysterious Sword - Blossom] Increases DMG by 50%, and upon Critical Hit, reduces Cooldown of [Mysterious Sword - Falling Petals] by 1.4 sec.",
                    "[Mysterious Sword - Falling Petals] Increases DMG by 50%, and upon Critical Hit, recovers Mana by 420. [Mysterious Sword - Blossom] Increases DMG by 50%, and upon Critical Hit, reduces Cooldown of [Mysterious Sword - Falling Petals] by 1.7 sec.",
                    "[Mysterious Sword - Falling Petals] Increases DMG by 50%, and upon Critical Hit, recovers Mana by 500. [Mysterious Sword - Blossom] Increases DMG by 50%, and upon Critical Hit, reduces Cooldown of [Mysterious Sword - Falling Petals] by 2 sec."
                ]
            }
        },
        {
            "id": 2,
            "skillInfo": [
                {
                    "skillNumber": "s2",
                    "name": "Blood Scattering Blade",
                    "description": "Rapidly charges forward to deal ??? M.DMG and inflicts irremovable Original Sin of Blood on enemies for 3 sec. Enemies under Original Sin of Blood have their ATK Spd reduced by 300. Shortly afterward, attacks enemies under Original Sin of Blood 2 times, and deals additional ??? M.DMG, and if the target is not a hero, deals additional ??? DEF Ignoring M.DMG.",
                    "cooldown": 13,
                    "cost": 3
                }
            ],
            "light": "Reduces Mana Cost by 1.",
            "dark": "Upon each DMG dealt, recovers 200 Mana.",
            "books": [
                "DMG is increased by 10%.",
                "DMG is increased by 15%.",
                "DMG is increased by 25%."
            ],
            "uniqueTreasure": {
                "name": "Ring of Abyss",
                "effect": [
                    "[Blood Scattering Blade] Increases DMG by 50% and reduces M.Block of affected enemies by 200.",
                    "[Blood Scattering Blade] Increases DMG by 50% and reduces M.Block of affected enemies by 240.",
                    "[Blood Scattering Blade] Increases DMG by 50% and reduces M.Block of affected enemies by 290.",
                    "[Blood Scattering Blade] Increases DMG by 50% and reduces M.Block of affected enemies by 350.",
                    "[Blood Scattering Blade] Increases DMG by 50% and reduces M.Block of affected enemies by 420.",
                    "[Blood Scattering Blade] Increases DMG by 50% and reduces M.Block of affected enemies by 500."
                ]
            }
        },
        {
            "id": 3,
            "skillInfo": [
                {
                    "skillNumber": "s3",
                    "name": "Red Moon Blade",
                    "description": "Brandishes a moon-bloodying sword, dealing ??? M.DMG to enemies in a wide range, and additional ??? M.DMG on non-Hero enemies. When the moon is ripe, gains Moonlight for 1 sec, and when cast at this state, deals ??? M.DMG to enemies and reduces their Heal Rate by 100%. If the target is not a hero, deals additional ??? M.DMG.The caster is not affected by ATK Spd related effects while casting.",
                    "cooldown": 24,
                    "cost": 4
                }
            ],
            "light": "Dispels positive effects of all enemies in range.",
            "dark": "Increases Mana Cost by 1 and ignores DEF when attacking Non-Hero enemies.",
            "books": [
                "DMG is increased by 10%.",
                "DMG is increased by 15%.",
                "DMG is increased by 25%."
            ],
            "uniqueTreasure": {
                "name": "Enlightening Candlelight",
                "effect": [
                    "[Red Moon Blade] Gains immunity to CC for the duration of the skill. When the battle starts, increases DMG by 70% for 4 time.",
                    "[Red Moon Blade] Gains immunity to CC for the duration of the skill. When the battle starts, increases DMG by 70% for 5 time.",
                    "[Red Moon Blade] Gains immunity to CC for the duration of the skill. When the battle starts, increases DMG by 70% for 6 time.",
                    "[Red Moon Blade] Gains immunity to CC for the duration of the skill. When the battle starts, increases DMG by 70% for 7 time.",
                    "[Red Moon Blade] Gains immunity to CC for the duration of the skill. When the battle starts, increases DMG by 70% for 9 time.",
                    "[Red Moon Blade] Gains immunity to CC for the duration of the skill. When the battle starts, increases DMG by 70% for 10 time."
                ]
            }
        },
        {
            "id": 4,
            "skillInfo": [
                {
                    "skillNumber": "s4",
                    "name": "Cold-Blooded Witch",
                    "description": "ATK is increased by ???. Upon a critical skill hit, own Crit DMG is increased by 5%. This effect can be stacked up to 30 times."
                }
            ],
            "light": "Takes 0.7% reduced DMG per stack.",
            "dark": "When the battle starts, increases DMG to Non-Hero enemies by 25% for 200 sec.",
            "books": [
                "ATK boost is increased by 10%.",
                "ATK boost is increased by 15%.",
                "ATK boost is increased by 25%."
            ],
            "uniqueTreasure": {
                "name": "Demonic Eight Trigrams",
                "effect": [
                    "[Cold-Blooded Witch] Increases ATK boost by 50% and the max number of stacks for Crit DMG boost by 2.",
                    "[Cold-Blooded Witch] Increases ATK boost by 50% and the max number of stacks for Crit DMG boost by 3.",
                    "[Cold-Blooded Witch] Increases ATK boost by 50% and the max number of stacks for Crit DMG boost by 4.",
                    "[Cold-Blooded Witch] Increases ATK boost by 50% and the max number of stacks for Crit DMG boost by 6.",
                    "[Cold-Blooded Witch] Increases ATK boost by 50% and the max number of stacks for Crit DMG boost by 8.",
                    "[Cold-Blooded Witch] Increases ATK boost by 50% and the max number of stacks for Crit DMG boost by 10."
                ]
            }
        }
    ],
    "light": "ATK, DEF, HP+15% / Crit DMG +20%",
    "dark": "All of caster's attacks will be critical hits, but the caster becomes unable to block while taking 25% increased damage.",
    "background": {
        "profile": {
            "gender": "missing",
            "race": "missing",
            "age": "missing",
            "height": "missing",
            "birthday": "missing",
            "constellation": "missing",
            "likes": "Her sister Erze, strawberry parfait, fine swords, the moon.",
            "dislikes": "Vampire Erze, spiders"
        },
        "story": "The 101st Heir of ShadowHilt and the sister of Erze. People call her cold-blooded for her unfriendly attitude, but she used to be all smiles when she was around her beloved sister, Erze. Seria always felt sorry for her feeble sister and was overprotective of her, without realizing that it was actually putting Erze in greater despair. One day, Erze fell into a trap during a mission. She was saved, but her sickness started to worsen dramatically. Meanwhile, Seria was sent to Windland Snow Mountain to follow the traces of the Vampire Princess. She had a glimpse of what was going on with her sister, but she left for the top-priority mission, praying that she was wrong. However, the tragedy struck the sisters as if it mocking Seria's prayers. - Oh, my beloved sister, Seria! Seria returned to find the corpses of her comrades lying on the ground, cold as ice. Erze welcomed her with two sharp fangs, thirsting for blood. Seria trembled with waves of emotions. Her heart was breaking, yet she spoke in a cold, calm tone. - You... you are not my little sister anymore. You're a filthy bloodsucker.",
        "itemIntroductions": {
            "weapon": "A sword of authority passed down to the masters of ShadowHilts. This sword contains the power of mighty beings that made a pact to serve the ShadowHilts. Some of them were Elementals, some were innocent spirits, and some even demons. It is known that tens of thousands of evil forces fell to this sword. It also has a demonic quality that binds the spirit of the slain evil to the blade. Despite its great power, fewer than 5 people in 600 years that were able to wield this sword. Seria, the 101st Heir of ShadowHilts and the only master in history chosen by the sword, entered the pact with the sword to put her beloved sister to rest.",
            "treasures": [
                "An ominous whetstone known to hold the soul of a demon. Swords that contain a pact of servitude must be sharpened with this whetstone as ordinary ones won't work for them. Used with Enlightening Candlelight, Elsion's resistance against the Demons becomes maximized.",
                "A silver ring that represents the ShadowHilts. Seria touches it whenever she feels her life is meaningless. Doing so would remind her of her dead comrades, filling her heart with the need for vengeance against her sister Erze. Ironically, the ring has a note written by Erze, hidden within the ring's jewel when she was young, but Seria still doesn't know about it.",
                "The candle known to have been on the table of the meeting hall where ancient warriors from different continents gathered to defeat supernatural beings. Blazing on this old candle is a blue exorcising flame. When the flame touches an evil being, it sucks the vitality out of the creature's body. This is the first material Seria uses whenever she refines her sword.",
                "The Eight Trigrams that the first leader of Shadow Hilt Family received from a supernatural being. Only the leaders of Shadow Hilt can handle it and maximize the power of Elsion through the demonic energy stored inside. 8 different beasts that punished evil are sealed in the trigrams, and different forces arise based on whether each trigram is pointing to yin or yang. When all 8 trigrams point toward perfect yin, the full moon raised by the Cold Blooded Witch is redder than the thickest blood."
            ]
        }
    },
    "skins": [],
    "voice": {
        "actor": {
            "jp": "N/A",
            "kr": "N/A",
            "en": "N/A"
        },
        "lines": {
            "jp": [],
            "kr": [],
            "en": []
        }
    }
}