{
  "name": "Shamilla",
  "title": "The Vessel of Curses",
  "class": "archer",
  "damageType": "magical",
  "position": "Middle",
  "weapon": {
    "uniqueWeapon": {
      "name": "Wings of Corruption, Apoliox",
      "effect": [
        "Every 20 seconds, obtains The Vessel of Curses and increases ATK by 20% for 10 seconds.",
        "Every 19 seconds, obtains The Vessel of Curses and increases ATK by 24% for 10 seconds.",
        "Every 18 seconds, obtains The Vessel of Curses and increases ATK by 29% for 10 seconds.",
        "Every 16 seconds, obtains The Vessel of Curses and increases ATK by 35% for 10 seconds.",
        "Every 14 seconds, obtains The Vessel of Curses and increases ATK by 42% for 10 seconds.",
        "Every 12 seconds, obtains The Vessel of Curses and increases ATK by 50% for 10 seconds."
      ]
    },
    "soulWeapon": {
      "advancement0": "Summons the soul of Wings of Corruption, Apoliox, inflicting 'Curse of Apoliox' to all enemies and granting 'The Vessel of Curses.' on self. 'Curse of Apoliox' reduces enemy's M.DEF by 40% and Heal Rate by 40% for 10 sec.",
      "advancement1": "Reduces Skill requirement by 2 sec, and recovers 1000 Mana upon use of Skill.",
      "advancement2": "Skill requirement is reduced by an additional 5 sec. Mana of the enemies inflicted with 'Curse of Apoliox' is reduced by 300 every sec.",
      "activation": "Charges up over 20 sec.",
      "cd": 18,
      "charges": 6
    }
  },
  "skills": [
    {
      "id": 1,
      "skillInfo": [
        {
          "skillNumber": "s1",
          "name": "Curse of Petrification",
          "description": "Attacks an enemy dealing ??? M.DMG and inflicting Curse of Petrification for 3 seconds that can't be dispelled. The enemy under the Curse of Petrification will have ATK Spd reduced by 200 , and this effect gets stronger up to max 600% as time passes. When the curse ends, petrifies the target for 3 seconds.",
          "cooldown": 12,
          "cost": 2
        }
      ],
      "light": "Cooldown is reduced by 3 sec.",
      "dark": "Reduces 500 MP of the enemy that took the DMG.",
      "books": [
        "DMG is increased by 10%.",
        "DMG is increased by 15%.",
        "DMG is increased by 25%."
      ],
      "uniqueTreasure": {
        "name": "Liberation of Curses",
        "effect": [
          "[Curse of Petrification] Increases the number of targets by 1, and for 10 sec, reduces the target's M.Dodge by 120.",
          "[Curse of Petrification] Increases the number of targets by 1, and for 10 sec, reduces the target's M.Dodge by 140.",
          "[Curse of Petrification] Increases the number of targets by 1, and for 10 sec, reduces the target's M.Dodge by 170.",
          "[Curse of Petrification] Increases the number of targets by 1, and for 10 sec, reduces the target's M.Dodge by 210.",
          "[Curse of Petrification] Increases the number of targets by 1, and for 10 sec, reduces the target's M.Dodge by 250.",
          "[Curse of Petrification] Increases the number of targets by 1, and for 10 sec, reduces the target's M.Dodge by 300."
        ]
      }
    },
    {
      "id": 2,
      "skillInfo": [
        {
          "skillNumber": "s2",
          "name": "Curse of Time",
          "description": "Attacks an enemy inflicting ??? M.DMG and also inflicts Curse of Time for 10 seconds, increasing all skill cooldown by 1.5 seconds. All skill cooldowns of the enemy under the Curse of Time increases by 1 seconds every 3 seconds.",
          "cooldown": 18,
          "cost": 2
        }
      ],
      "light": "Mana cost is reduced by 1.",
      "dark": "Dispels positive effects from the target.",
      "books": [
        "DMG is increased by 10%.",
        "DMG is increased by 15%.",
        "DMG is increased by 25%."
      ],
      "uniqueTreasure": {
        "name": "Ancient Demon's Heart",
        "effect": [
          "[Curse of Time] Additionally increases Cooldown by 0.7 sec and reduces M.DEF of the target by 10% for 10 sec.",
          "[Curse of Time] Additionally increases Cooldown by 0.7 sec and reduces M.DEF of the target by 12% for 10 sec.",
          "[Curse of Time] Additionally increases Cooldown by 0.7 sec and reduces M.DEF of the target by 14% for 10 sec.",
          "[Curse of Time] Additionally increases Cooldown by 0.7 sec and reduces M.DEF of the target by 17% for 10 sec.",
          "[Curse of Time] Additionally increases Cooldown by 0.7 sec and reduces M.DEF of the target by 21% for 10 sec.",
          "[Curse of Time] Additionally increases Cooldown by 0.7 sec and reduces M.DEF of the target by 25% for 10 sec."
        ]
      }
    },
    {
      "id": 3,
      "skillInfo": [
        {
          "skillNumber": "s3",
          "name": "Curse of Pain",
          "description": "Attacks en enemy dealing ??? M.DMG and inflicting knockback. Also inflicts Curse of Pain for 8 seconds, dealing a total of ??? M.DMG over time.",
          "cooldown": 9,
          "cost": 3
        }
      ],
      "light": "Target takes 25% increased M.DMG for 10 sec.",
      "dark": "DMG is increased by 40%.",
      "books": [
        "DMG is increased by 10%.",
        "DMG is increased by 15%.",
        "DMG is increased by 25%."
      ],
      "uniqueTreasure": {
        "name": "The Jar of Curses",
        "effect": [
          "[Curse of Pain] DMG is increased by 20%, and gains a stack of 'The Vessel of Curses' upon killing an enemy.",
          "[Curse of Pain] DMG is increased by 24%, and gains a stack of 'The Vessel of Curses' upon killing an enemy.",
          "[Curse of Pain] DMG is increased by 29%, and gains a stack of 'The Vessel of Curses' upon killing an enemy.",
          "[Curse of Pain] DMG is increased by 35%, and gains a stack of 'The Vessel of Curses' upon killing an enemy.",
          "[Curse of Pain] DMG is increased by 42%, and gains a stack of 'The Vessel of Curses' upon killing an enemy.",
          "[Curse of Pain] DMG is increased by 50%, and gains a stack of 'The Vessel of Curses' upon killing an enemy."
        ]
      }
    },
    {
      "id": 4,
      "skillInfo": [
        {
          "skillNumber": "s4",
          "name": "The Vessel of Curses",
          "description": "At the beginning of every battle, for 7 seconds, obtains The Vessel of Curses, creates a shield that cannot be canceled, and absorbs ??? damage. For the duration of the shield, gains Immunity to CC. Upon the activation of the skill, consumes The Vessel of Curses to have 4 enemies as the target."
        }
      ],
      "light": "Shield is increased by 80%.",
      "dark": "The Vessel of Curses duration is increased by 20 sec, and becomes dispellable.",
      "books": [
        "Shield is increased by 10%.",
        "Shield is increased by 15%.",
        "Shield is increased by 25%."
      ],
      "uniqueTreasure": {
        "name": "Primal Curse",
        "effect": [
          "[The Vessel of Curses] Upon gaining the Vessel of Curses, self's Cooldown of all skills is reduced by 12% and All DEF is increased by 50% for 5 sec.",
          "[The Vessel of Curses] Upon gaining the Vessel of Curses, self's Cooldown of all skills is reduced by 14% and All DEF is increased by 50% for 5 sec.",
          "[The Vessel of Curses] Upon gaining the Vessel of Curses, self's Cooldown of all skills is reduced by 17% and All DEF is increased by 50% for 5 sec.",
          "[The Vessel of Curses] Upon gaining the Vessel of Curses, self's Cooldown of all skills is reduced by 21% and All DEF is increased by 50% for 5 sec.",
          "[The Vessel of Curses] Upon gaining the Vessel of Curses, self's Cooldown of all skills is reduced by 25% and All DEF is increased by 50% for 5 sec.",
          "[The Vessel of Curses] Upon gaining the Vessel of Curses, self's Cooldown of all skills is reduced by 30% and All DEF is increased by 50% for 5 sec."
        ]
      }
    }
  ],
  "light": "ATK, DEF, HP+15% / ATK.Spd +100",
  "dark": "All effects of curse are enhanced. [Curse of Petrification] Petrification duration is increased by 2 sec. [Curse of Time] Curse of Time duration is increased by 3 sec. [Curse of Pain] Curse of Pain DOT is increased by 50%.",
  "background": {
    "profile": {
      "gender": "Female",
      "race": "Demon",
      "age": "???",
      "height": "165 cm",
      "birthday": "6(Month) 2(Day), Month of Love",
      "constellation": "Mira the Minstrel",
      "likes": "Unexpected situations, people who fight against the flow of things",
      "dislikes": "Boring scenarios, obvious stories"
    },
    "story": "A powerful Demon who used to be one of the officers serving Dark Lord Angmund. She is capable of holding all of the curses in the world. But her real goal isn't the resurrection of the Dark Lord, nor world domination. Everything that happens in the world is a part of a drama, and she thinks of herself as the audience. Her actions are like that of a scriptwriter who revises the scenario, pulling the strings from the shadows and looking forward to how the scenes she's written play out.",
    "itemIntroductions": {
      "weapon": "Curses are born from negative feelings such as hatred, jealousy, and resentment. These are the best food for Shamilla. The wings that grew powerful during the Demon War by absorbing the curses of countless people are terrifying to normal people. Those who are touched by the feathers are said to be bound by many curses, and they fall into a vortex of emotions. In that abyss, a captivating and seductive laughter echoes. The laughter of a demon that enjoys the different kinds of human feelings.",
      "soul": "Shamilla, after tearing her own wings apart, lived and walked among the humans.\nAt times, she lived as a noble, and at times, she lived as a commener.\nShe manipulated and made humans act as she desired, editing the script of the world as she fits, and feasted upon hatred, resentment, and sadness which were the products of conflicts her manipulation caused.\n\nShamilla however, found herself drowning in tedium.\nShe deeply wished to see and experience unexpected situations from the actors of her script which she had edited thousands of times. Shamilla was hungry for new emotion, one she had never felt before.\nShe wanted to feel the fresh, mystical curse, one that had never existed.\n\nShamilla then came up with a thought: If there is someone who's different from me, but has a similar purpose, perhaps then, I might reach my goal faster, and find a different ending.\n\nAfter closing her thought, she imbued her wings with a part of her soul and...",
      "treasures": [
        "A jewel that releases the curses that Shamilla has inside her. Shamilla sometimes uses this jewel to release curses from her body, just to watch an exciting story unfold according to her plans. The most common curse she releases is petrification, mostly to make sure that the right characters are in play for her scheme.",
        "A strange jewel from which the resentful whispers of ancient demons can be heard. A cursed item filled with the souls of long forgotten ancient demons. They wish to escape every day, but she won't let them out that easily. Her soul has accepted all the curses of the world, so it is as deep and dark as the abyss.",
        "Shamilla has been cursed to hold all the curses in the world inside her, but could also be seen as a savior who binds all those curses. Her death would mean that all the evil she holds within would go back out into the world. This Jar of Curses that Shamilla made is used to retrieve the curses that Shamilla spat out.",
        "The very source of all curses. Its root sprouted when hatred was born, and the evil became known to world at the beginning. It is located in deep within Shamilla, the Vessel of Curses, growing more hideous as more curses are derived from it."
      ]
    }
  },
  "skins": ["Beachside", "Evangelist of Love", "Seduction in the Darkness", "Leisurely Demon"],
  "voice": {
    "actor": {
      "jp": "N/A",
      "kr": "N/A",
      "en": "N/A"
    },
    "lines": {
      "jp": [],
      "kr": [],
      "en": []
    }
  }
}