{
  "name": "Lorraine",
  "title": "Grand Elidoran Scholar",
  "class": "wizard",
  "damageType": "magical",
  "position": "Middle",
  "weapon": {
    "uniqueWeapon": {
      "name": "World Tree's Will, Roburu",
      "effect": [
        "Every 7 sec, deals 40% of ATK as M.DMG to enemies inflicted with Poison, and reduces enemy M.DEF by 10%. Per every stacked Poison, DMG is increased by 20%.",
        "Every 7 sec, deals 48% of ATK as M.DMG to enemies inflicted with Poison, and reduces enemy M.DEF by 12%. Per every stacked Poison, DMG is increased by 20%.",
        "Every 7 sec, deals 57% of ATK as M.DMG to enemies inflicted with Poison, and reduces enemy M.DEF by 14%. Per every stacked Poison, DMG is increased by 20%.",
        "Every 7 sec, deals 69% of ATK as M.DMG to enemies inflicted with Poison, and reduces enemy M.DEF by 17%. Per every stacked Poison, DMG is increased by 20%.",
        "Every 7 sec, deals 83% of ATK as M.DMG to enemies inflicted with Poison, and reduces enemy M.DEF by 20%. Per every stacked Poison, DMG is increased by 20%.",
        "Every 7 sec, deals 100% of ATK as M.DMG to enemies inflicted with Poison, and reduces enemy M.DEF by 25%. Per every stacked Poison, DMG is increased by 20%."
      ]
    },
    "soulWeapon": {
      "advancement0": "Summons the soul of World Tree's Will, Roburu for 10 sec, dealing ??? M.DMG on a random enemy every 2 sec, increasing M.DMG it takes by 30% for 10 sec and inflicting Shackle for 2 sec. Also recovers own mana by 500 and reduces Cooldown of all Skills by 1 sec every 2 sec.",
      "advancement1": "Increases own ATK by 50% for the duration of soul.",
      "advancement2": "Increases the duration of CC effects applied upon all enemies by 30% and reduces their M.DEF by 25% for the duration of soul.",
      "activation": "Charges up over 17 sec.",
      "cd": 21,
      "charges": 7
    }
  },
  "skills": [
    {
      "id": 1,
      "skillInfo": [
        {
          "skillNumber": "s1",
          "name": "Thornbush Forest",
          "description": "Attacks 3 times at random, dealing ??? M.DMG to enemies in range and inflicting 1 stack of Poison with each attack.",
          "cooldown": 7,
          "cost": 2
        }
      ],
      "light": "Hit count is increased by 1.",
      "dark": "Enemies with 5 or more stacks of Poison are shackled for 3 sec upon hit.",
      "books": [
        "DMG is increased by 10%.",
        "DMG is increased by 15%.",
        "Leaves 2 stacks of Poison upon a Critical Hit."
      ],
      "uniqueTreasure": {
        "name": "Book of Life",
        "effect": [
          "[Thornbush Forest] Reduces Mana Cost by 1 and Cooldown by 0.8 sec.",
          "[Thornbush Forest] Reduces Mana Cost by 1 and Cooldown by 1 sec.",
          "[Thornbush Forest] Reduces Mana Cost by 1 and Cooldown by 1.2 sec.",
          "[Thornbush Forest] Reduces Mana Cost by 1 and Cooldown by 1.4 sec.",
          "[Thornbush Forest] Reduces Mana Cost by 1 and Cooldown by 1.7 sec.",
          "[Thornbush Forest] Reduces Mana Cost by 1 and Cooldown by 2 sec."
        ]
      }
    },
    {
      "id": 2,
      "skillInfo": [
        {
          "skillNumber": "s2",
          "name": "Tangled Vine",
          "description": "Deals ??? M.DMG to enemies in a straight line, stacking 2 Poison and shackling them for 4 sec. After some time, deals a large amount of DMG based on the number of Poison stacks.",
          "cooldown": 10,
          "cost": 3
        }
      ],
      "light": "DMG is increased by 40%.",
      "dark": "Enemies hit by the final explosion effect are stunned for 2 sec.",
      "books": [
        "DMG is increased by 10%.",
        "DMG is increased by 15%.",
        "Target takes 25% increased M.DMG for the duration of skill."
      ],
      "uniqueTreasure": {
        "name": "Deadly Belladonna",
        "effect": [
          "[Tangled Vine] Reduces Mana Cost by 1 and drains 200 MP from the affected enemy.",
          "[Tangled Vine] Reduces Mana Cost by 1 and drains 240 MP from the affected enemy.",
          "[Tangled Vine] Reduces Mana Cost by 1 and drains 290 MP from the affected enemy.",
          "[Tangled Vine] Reduces Mana Cost by 1 and drains 350 MP from the affected enemy.",
          "[Tangled Vine] Reduces Mana Cost by 1 and drains 420 MP from the affected enemy.",
          "[Tangled Vine] Reduces Mana Cost by 1 and drains 500 MP from the affected enemy."
        ]
      }
    },
    {
      "id": 3,
      "skillInfo": [
        {
          "skillNumber": "s3",
          "name": "Wrath of the Forest",
          "description": "Deals ??? M.DMG to enemies in range and knocks them down for 3 sec. Enemies inflicted by Poison takes 20% more DMG per every stack.",
          "cooldown": 23,
          "cost": 3
        }
      ],
      "light": "Mana cost is increased by 1 orb but DMG is boosted by 100%.",
      "dark": "Enemies with 5 or more stacks of Poison lose their positive effects.",
      "books": [
        "DMG is increased by 10%.",
        "DMG is increased by 15%.",
        "DMG is increased by 25%."
      ],
      "uniqueTreasure": {
        "name": "Root of the World Tree",
        "effect": [
          "[Wrath of the Forest] DMG is increased by 20%. Upon Crit Hit on enemies with over 5 stacks of Poison, skill cooldown is reduced by 4%.",
          "[Wrath of the Forest] DMG is increased by 24%. Upon Crit Hit on enemies with over 5 stacks of Poison, skill cooldown is reduced by 4%.",
          "[Wrath of the Forest] DMG is increased by 29%. Upon Crit Hit on enemies with over 5 stacks of Poison, skill cooldown is reduced by 4%.",
          "[Wrath of the Forest] DMG is increased by 35%. Upon Crit Hit on enemies with over 5 stacks of Poison, skill cooldown is reduced by 4%.",
          "[Wrath of the Forest] DMG is increased by 42%. Upon Crit Hit on enemies with over 5 stacks of Poison, skill cooldown is reduced by 4%.",
          "[Wrath of the Forest] DMG is increased by 50%. Upon Crit Hit on enemies with over 5 stacks of Poison, skill cooldown is reduced by 4%."
        ]
      }
    },
    {
      "id": 4,
      "skillInfo": [
        {
          "skillNumber": "s4",
          "name": "Blade Leaf",
          "description": "When dealing a normal attack, attacks a random enemy 3 times with a 30% chance of inflicting ??? M.DMG and 1 stack of Poison for 20 seconds. Poison inflicts a total of ??? M.DMG over 20 seconds."
        }
      ],
      "light": "Poison stack maximum is changed to 6.",
      "dark": "There is a 20% chance that hit enemies are shackled for 2 sec.",
      "books": [
        "DMG is increased by 10%.",
        "DMG is increased by 15%.",
        "DMG is increased by 25%."
      ],
      "uniqueTreasure": {
        "name": "Terrarium of Circulation",
        "effect": [
          "[Blade Leaf] Increases activation chance by 20%. Targets take 10% increased M.DMG for 10 sec.",
          "[Blade Leaf] Increases activation chance by 20%. Targets take 12% increased M.DMG for 10 sec.",
          "[Blade Leaf] Increases activation chance by 20%. Targets take 14% increased M.DMG for 10 sec.",
          "[Blade Leaf] Increases activation chance by 20%. Targets take 17% increased M.DMG for 10 sec.",
          "[Blade Leaf] Increases activation chance by 20%. Targets take 21% increased M.DMG for 10 sec.",
          "[Blade Leaf] Increases activation chance by 20%. Targets take 25% increased M.DMG for 10 sec."
        ]
      }
    }
  ],
  "light": "ATK, DEF, HP+15% / Crit Chance +100",
  "dark": "Every 5 sec, targets all enemies and attacks with 'Thornbush Forest' with 30% chance on each enemy.",
  "background": {
    "profile": {
      "gender": "Female",
      "race": "Elf",
      "age": "???",
      "height": "168 cm",
      "birthday": "5(Month) 25(Day), Month of Hope",
      "constellation": "Graham the Thief",
      "likes": "Tranquil forest, beautiful songs",
      "dislikes": "Anything that harms nature"
    },
    "story": "The Great Sage of Elidora is the wisest of the Druids. As one of the heroes who fought against the Demon invaders 100 years ago, she is often considered the wisest person on the entire Orbis Continent. She has taught and trained countless Elves, and possesses keen insight and mystic powers befitting her age. It is said that even the current king of Elidora as well as his children were all once her students. Having recently sensed a strange disturbance from the Elidora Forest, she is preparing the path for the wielder of the Holy Sword.",
    "itemIntroductions": {
      "weapon": "The legend has it that, once every 100 years, the World Tree bestows one of its branches to a chosen one. The branch radiates with eternal life, granting immense power and knowledge to its owner. Fusing the branch with the Stone of the Forest, an Elven treasure, Lorraine created this staff. Now, she can call upon the forces of nature and remain connected to the World Tree wherever she goes.",
      "soul": "A World Tree branch is the core of Roburu, and it has a strong lifeforce which it inherited from the world tree.\n\nThe infinite lifeforce amplifies Lorraine's magic, while also imbuing Roburu with the characteristic of 'growing staff'. The branch stayed inside the weapon, and watched Lorraine silently over time. As a druid, as a mentor of the royal family, as a friend and advisor to the old hero. Lorraine went through many processes of agony, and at the end of everything, when the time to make a choice approached, the branch chose Lorraine as its rightful master.\nThe branch chose to grow as a staff, together with Lorraine instead of growing into a new World Tree.\nRoburu now draws power and potential from the World Tree, and together with Lorraine, they will protect the forest together.",
      "treasures": [
        "The Book containing knowledge about all life in the forest. A magical book passed down among the guardians of the World Tree since ancient times. After being in the hands of Elidoran sages for a long time, Lorraine now has it in safekeeping.",
        "The beautiful but poisonous Belladonna. It's a dangerous plant that only the Great Sage can handle. The little Belladonna that is mixed up with vines poisons enemies and makes them defenseless against magic attacks.",
        "Proof of the unity between the Druids and the World Tree. The great sages of Elidora have always maintained a deep bond with the World Tree. The roots of the World Tree are proof of the deep bond with the Druids. They attack enemies with supernatural DMG whenever Druids shout the Wrath of the Forest to show nature's fury and hostility.",
        "A terrarium made with a broken World Tree twig. As breaking of twigs of the World Tree is considered very bad luck, they are normally purified and discarded. However, Lorraine received a new revelation from it and decided to make a small terrarium out of it."
      ]
    }
  },
  "skins": [],
  "voice": {
    "actor": {
      "jp": "Hirayama Emi",
      "kr": "Jung Hye Ok",
      "en": "N/A"
    },
    "lines": {
      "jp": [],
      "kr": [],
      "en": []
    }
  }
}
