{
  "name": "Lorraine",
  "title": "Grand Elidoran Scholar",
  "class": "wizard",
  "damageType": "magical",
  "position": "Middle",
  "weapon": {
    "uniqueWeapon": {
      "name": "World Tree's Will, Roburu",
      "effect": [
        "Deals M.DMG equal to 100% of ATK to enemies inflicted with Poison every 7 sec, reducing M.DEF by 10% and increasing M.DMG the target takes by 10% for 10 sec.",
        "Deals M.DMG equal to 120% of ATK to enemies inflicted with Poison every 7 sec, reducing M.DEF by 12% and increasing M.DMG the target takes by 12% for 10 sec.",
        "Deals M.DMG equal to 140% of ATK to enemies inflicted with Poison every 7 sec, reducing M.DEF by 14% and increasing M.DMG the target takes by 14% for 10 sec.",
        "Deals M.DMG equal to 170% of ATK to enemies inflicted with Poison every 7 sec, reducing M.DEF by 17% and increasing M.DMG the target takes by 17% for 10 sec.",
        "Deals M.DMG equal to 210% of ATK to enemies inflicted with Poison every 7 sec, reducing M.DEF by 21% and increasing M.DMG the target takes by 21% for 10 sec.",
        "Deals M.DMG equal to 250% of ATK to enemies inflicted with Poison every 7 sec, reducing M.DEF by 25% and increasing M.DMG the target takes by 25% for 10 sec."
      ]
    },
    "soulWeapon": {
      "advancement0": "Summons the soul of World Tree's Will, Roburu for 10 sec, dealing ??? M.DMG on a random enemy every 2 sec, increasing M.DMG it takes by 30% for 10 sec and inflicting Shackle for 2 sec. Also recovers own mana by 500 and reduces Cooldown of all Skills by 1 sec every 2 sec.",
      "advancement1": "Increases own ATK by 50% for the duration of soul.",
      "advancement2": "Increases the duration of CC effects applied upon all enemies by 30% and reduces their M.DEF by 25% for the duration of soul.",
      "activation": "Charges up over 17 sec.",
      "cd": 21,
      "charges": 7
    }
  },
  "skills": [
    {
      "id": 1,
      "skillInfo": [
        {
          "skillNumber": "s1",
          "name": "Thornbush Forest",
          "description": "Attacks a random enemy and its nearby enemies 3 times, dealing a total of ??? M.DMG and inflicting Stun for 3 sec.",
          "cooldown": 7,
          "cost": 2
        }
      ],
      "light": "Reduces Mana of the hit target by 250. If the target is a boss, reduces Mana by 500.",
      "dark": "Recovers 250 Mana upon Critical Hit.",
      "books": [
        "DMG is increased by 10%.",
        "DMG is increased by 15%.",
        "DMG is increased by 25%."
      ],
      "uniqueTreasure": {
        "name": "Book of Life",
        "effect": [
          "[Thornbush Forest] Increases DMG by 50% and reduces Cooldown by 1.2 sec.",
          "[Thornbush Forest] Increases DMG by 50% and reduces Cooldown by 1.4 sec.",
          "[Thornbush Forest] Increases DMG by 50% and reduces Cooldown by 1.7 sec.",
          "[Thornbush Forest] Increases DMG by 50% and reduces Cooldown by 2.1 sec.",
          "[Thornbush Forest] Increases DMG by 50% and reduces Cooldown by 2.5 sec.",
          "[Thornbush Forest] Increases DMG by 50% and reduces Cooldown by 3 sec."
        ]
      }
    },
    {
      "id": 2,
      "skillInfo": [
        {
          "skillNumber": "s2",
          "name": "Seed of Belladonna",
          "description": "Creates a Seed of Belladonna around the target for 10 sec. The seed deals ??? M.DMG to nearby enemies every 2 sec, increasing M.DMG the target takes by 30% and reducing Heal Rate by 30% for 5 sec.",
          "cooldown": 15,
          "cost": 3
        }
      ],
      "light": "Increases DMG by 40%.",
      "dark": "Increases the duration of the CC inflicted upon hit enemies by 30% for 5 sec.",
      "books": [
        "DMG is increased by 10%.",
        "DMG is increased by 15%.",
        "DMG is increased by 25%."
      ],
      "uniqueTreasure": {
        "name": "Deadly Belladonna",
        "effect": [
          "[Seed of Belladonna] Reduces Mana Cost by 1, Mana of hit enemies by 200, and recovers own Mana by 100.",
          "[Seed of Belladonna] Reduces Mana Cost by 1, Mana of hit enemies by 240, and recovers own Mana by 120.",
          "[Seed of Belladonna] Reduces Mana Cost by 1, Mana of hit enemies by 290, and recovers own Mana by 140.",
          "[Seed of Belladonna] Reduces Mana Cost by 1, Mana of hit enemies by 350, and recovers own Mana by 170.",
          "[Seed of Belladonna] Reduces Mana Cost by 1, Mana of hit enemies by 420, and recovers own Mana by 210.",
          "[Seed of Belladonna] Reduces Mana Cost by 1, Mana of hit enemies by 500, and recovers own Mana by 250."
        ]
      }
    },
    {
      "id": 3,
      "skillInfo": [
        {
          "skillNumber": "s3",
          "name": "Wrath of the Forest",
          "description": "Attacks enemies within a wide frontal range of self 6 times, dealign a total of ??? M.DMG and knocking them down for 3 sec.",
          "cooldown": 18,
          "cost": 3
        }
      ],
      "light": "Mana cost is increased by 1 orb but DMG is boosted by 100%.",
      "dark": "Dispels positive effects of enemies within Range.",
      "books": [
        "DMG is increased by 10%.",
        "DMG is increased by 15%.",
        "DMG is increased by 25%."
      ],
      "uniqueTreasure": {
        "name": "Root of the World Tree",
        "effect": [
          "[Wrath of the Forest] DMG is increased by 20%. Upon Crit Hit on enemies with over 5 stacks of Poison, skill cooldown is reduced by 4%.",
          "[Wrath of the Forest] DMG is increased by 24%. Upon Crit Hit on enemies with over 5 stacks of Poison, skill cooldown is reduced by 4%.",
          "[Wrath of the Forest] DMG is increased by 29%. Upon Crit Hit on enemies with over 5 stacks of Poison, skill cooldown is reduced by 4%.",
          "[Wrath of the Forest] DMG is increased by 35%. Upon Crit Hit on enemies with over 5 stacks of Poison, skill cooldown is reduced by 4%.",
          "[Wrath of the Forest] DMG is increased by 42%. Upon Crit Hit on enemies with over 5 stacks of Poison, skill cooldown is reduced by 4%.",
          "[Wrath of the Forest] DMG is increased by 50%. Upon Crit Hit on enemies with over 5 stacks of Poison, skill cooldown is reduced by 4%."
        ]
      }
    },
    {
      "id": 4,
      "skillInfo": [
        {
          "skillNumber": "s4",
          "name": "Poison",
          "description": "Normal and Skill attacks inflict Poison on a target, dealing a total of ??? continuous M.DMG and reducing Heal Rate by 5% over 20 sec. Poison can be stacked up to max 5 times."
        }
      ],
      "light": "Reduces target's ATK by 5% per stack of Poison.",
      "dark": "If the target is a boss, increases DMG of Poison by x3.",
      "books": [
        "DMG is increased by 10%.",
        "DMG is increased by 15%.",
        "DMG is increased by 25%."
      ],
      "uniqueTreasure": {
        "name": "Terrarium of Circulation",
        "effect": [
          "[Poison] Poison effect becomes irremovable and for the duration of the Poison, target takes 10% increased M.DMG.",
          "[Poison] Poison effect becomes irremovable and for the duration of the Poison, target takes 12% increased M.DMG.",
          "[Poison] Poison effect becomes irremovable and for the duration of the Poison, target takes 14% increased M.DMG.",
          "[Poison] Poison effect becomes irremovable and for the duration of the Poison, target takes 17% increased M.DMG.",
          "[Poison] Poison effect becomes irremovable and for the duration of the Poison, target takes 21% increased M.DMG.",
          "[Poison] Poison effect becomes irremovable and for the duration of the Poison, target takes 25% increased M.DMG."
        ]
      }
    }
  ],
  "light": "ATK, DEF, HP+15% / Crit Chance +100",
  "dark": "At the beginning of each battle, immediately reduces self's Cooldown of all Skills by 30% and increases DMG dealt to Non-Hero enemies by 20% for 90 sec. DMG Boost effect can be stacked up to max 5 times and is irremovable.",
  "background": {
    "profile": {
      "gender": "Female",
      "race": "Elf",
      "age": "???",
      "height": "168 cm",
      "birthday": "5(Month) 25(Day), Month of Hope",
      "constellation": "Graham the Thief",
      "likes": "Tranquil forest, beautiful songs",
      "dislikes": "Anything that harms nature"
    },
    "story": "The Great Sage of Elidora is the wisest of the Druids. As one of the heroes who fought against the Demon invaders 100 years ago, she is often considered the wisest person on the entire Orbis Continent. She has taught and trained countless Elves, and possesses keen insight and mystic powers befitting her age. It is said that even the current king of Elidora as well as his children were all once her students. Having recently sensed a strange disturbance from the Elidora Forest, she is preparing the path for the wielder of the Holy Sword.",
    "itemIntroductions": {
      "weapon": "The legend has it that, once every 100 years, the World Tree bestows one of its branches to a chosen one. The branch radiates with eternal life, granting immense power and knowledge to its owner. Fusing the branch with the Stone of the Forest, an Elven treasure, Lorraine created this staff. Now, she can call upon the forces of nature and remain connected to the World Tree wherever she goes.",
      "soul": "A World Tree branch is the core of Roburu, and it has a strong lifeforce which it inherited from the world tree.\n\nThe infinite lifeforce amplifies Lorraine's magic, while also imbuing Roburu with the characteristic of 'growing staff'. The branch stayed inside the weapon, and watched Lorraine silently over time. As a druid, as a mentor of the royal family, as a friend and advisor to the old hero. Lorraine went through many processes of agony, and at the end of everything, when the time to make a choice approached, the branch chose Lorraine as its rightful master.\nThe branch chose to grow as a staff, together with Lorraine instead of growing into a new World Tree.\nRoburu now draws power and potential from the World Tree, and together with Lorraine, they will protect the forest together.",
      "treasures": [
        "The Book containing knowledge about all life in the forest. A magical book passed down among the guardians of the World Tree since ancient times. After being in the hands of Elidoran sages for a long time, Lorraine now has it in safekeeping.",
        "The beautiful but poisonous Belladonna. It's a dangerous plant that only the Great Sage can handle. The little Belladonna that is mixed up with vines poisons enemies and makes them defenseless against magic attacks.",
        "Proof of the unity between the Druids and the World Tree. The great sages of Elidora have always maintained a deep bond with the World Tree. The roots of the World Tree are proof of the deep bond with the Druids. They attack enemies with supernatural DMG whenever Druids shout the Wrath of the Forest to show nature's fury and hostility.",
        "A terrarium made with a broken World Tree twig. As breaking of twigs of the World Tree is considered very bad luck, they are normally purified and discarded. However, Lorraine received a new revelation from it and decided to make a small terrarium out of it."
      ]
    }
  },
  "skins": ["Professor", "Beachside", "Snow Sage", "Santa", "Beachside 2", "Mont Blanc Dreams"],
  "voice": {
    "actor": {
      "jp": "Hirayama Emi",
      "kr": "Jung Hye Ok",
      "en": "N/A"
    },
    "lines": {
      "jp": [],
      "kr": [],
      "en": []
    }
  }
}
