{
  "name": "Pavel",
  "title": "Wizard of Ice Dragon",
  "class": "wizard",
  "damageType": "magical",
  "position": "Middle",
  "weapon": {
    "uniqueWeapon": {
      "name": "Dragon Hearts, Andarta Andraste",
      "effect": [
        "Every 15 sec, deals 160% of ATK as M.DMG to 2 random enemies and inflicts Frost. Enemies already inflicted with Frost will become inflicted with Freeze for 5 sec.",
        "Every 14 sec, deals 192% of ATK as M.DMG to 2 random enemies and inflicts Frost. Enemies already inflicted with Frost will become inflicted with Freeze for 5 sec.",
        "Every 12.5 sec, deals 228% of ATK as M.DMG to 2 random enemies and inflicts Frost. Enemies already inflicted with Frost will become inflicted with Freeze for 5 sec.",
        "Every 11 sec, deals 276% of ATK as M.DMG to 2 random enemies and inflicts Frost. Enemies already inflicted with Frost will become inflicted with Freeze for 5 sec.",
        "Every 9.5 sec, deals 332% of ATK as M.DMG to 2 random enemies and inflicts Frost. Enemies already inflicted with Frost will become inflicted with Freeze for 5 sec.",
        "Every 8 sec, deals 400% of ATK as M.DMG to 2 random enemies and inflicts Frost. Enemies already inflicted with Frost will become inflicted with Freeze for 5 sec."
      ]
    },
    "soulWeapon": {
      "advancement0": "Summons the soul of Dragon Hearts, Andarta Andraste, increasing own Crit DMG by 100% for 10 sec. Upon activation, deals ??? M.DMG to enemies in a straight line, increasing M.DMG the target takes by 30% for 10 sec, and inflicting Freeze for 6 sec. Upon attacking the frozen enemy, deals ??? M.DMG that ignores DEF, self recovers 2 orbs of Mana, and reduces Cooldown of all skills by 30%.",
      "advancement1": "Changes Skill Activation Requirements to 4 times.",
      "advancement2": "Increases DMG 80% and dispels positiv effects from the hit enemy.",
      "activation": "Charges up upon using Skills 5 times.",
      "cd": 21,
      "charges": 5
    }
  },
  "skills": [
    {
      "id": 1,
      "skillInfo": [
        {
          "skillNumber": "s1",
          "name": "Wedge of Cold Snap",
          "description": "Deal ??? M.DMG to the targeted enemy and inflict Freeze for 5 sec. If any enemies are inflicted with Frost, deal DMG and inflict Freeze to them as well.",
          "cooldown": 12,
          "cost": 2
        }
      ],
      "light": "DMG is increased by 40%.",
      "dark": "In exchange for 1 additional Mana Cost, Freeze duration is boosted by 5 sec.",
      "books": [
        "DMG is increased by 10%.",
        "DMG is increased by 15%.",
        "DMG is increased by 25%."
      ],
      "uniqueTreasure": {
        "name": "Source of Snow",
        "effect": [
          "[Wedge of Cold Snap] Increases DMG by 20% and upon casting, increases CC ACC by 400 for 10 sec.",
          "[Wedge of Cold Snap] Increases DMG by 24% and upon casting, increases CC ACC by 400 for 10 sec.",
          "[Wedge of Cold Snap] Increases DMG by 29% and upon casting, increases CC ACC by 400 for 10 sec.",
          "[Wedge of Cold Snap] Increases DMG by 35% and upon casting, increases CC ACC by 400 for 10 sec.",
          "[Wedge of Cold Snap] Increases DMG by 42% and upon casting, increases CC ACC by 400 for 10 sec.",
          "[Wedge of Cold Snap] Increases DMG by 50% and upon casting, increases CC ACC by 400 for 10 sec."
        ]
      }
    },
    {
      "id": 2,
      "skillInfo": [
        {
          "skillNumber": "s2",
          "name": "Ice Spear",
          "description": "Attacks random enemies 5 times, dealing ??? M.DMG and inflicting Frost. When attacking enemies inflicted with Frost, creates an additional spear that deals extra half DMG. Additional spears do not inflict Frost. Enemies inflicted with Freeze take 50% increased DMG.",
          "cooldown": 8,
          "cost": 2
        }
      ],
      "light": "Mana cost is reduced by 1.",
      "dark": "Target changes to the enemy with the highest ATK.",
      "books": [
        "DMG is increased by 10%.",
        "DMG is increased by 15%.",
        "DMG is increased by 25%."
      ],
      "uniqueTreasure": {
        "name": "Frozen Brooch",
        "effect": [
          "[Ice Spear] Reduces Cooldown by 8% and has a 40% chance to freeze the enemy for 1 sec upon damaging the enemy in Frost state. This effect is not applied to additionally created spears.",
          "[Ice Spear] Reduces Cooldown by 8% and has a 48% chance to freeze the enemy for 1 sec upon damaging the enemy in Frost state. This effect is not applied to additionally created spears.",
          "[Ice Spear] Reduces Cooldown by 8% and has a 58% chance to freeze the enemy for 1 sec upon damaging the enemy in Frost state. This effect is not applied to additionally created spears.",
          "[Ice Spear] Reduces Cooldown by 8% and has a 70% chance to freeze the enemy for 1 sec upon damaging the enemy in Frost state. This effect is not applied to additionally created spears.",
          "[Ice Spear] Reduces Cooldown by 8% and has a 84% chance to freeze the enemy for 1 sec upon damaging the enemy in Frost state. This effect is not applied to additionally created spears.",
          "[Ice Spear] Reduces Cooldown by 8% and has a 100% chance to freeze the enemy for 1 sec upon damaging the enemy in Frost state. This effect is not applied to additionally created spears."
        ]
      }
    },
    {
      "id": 3,
      "skillInfo": [
        {
          "skillNumber": "s3",
          "name": "Icy Conquest",
          "description": "Deals ??? M.DMG to all enemies. Enemies inflicted with Frost becomes inflicted with Freeze for 3 sec. Enemies inflicted with Freeze take 100% increased DMG.",
          "cooldown": 20,
          "cost": 4
        }
      ],
      "light": "Mana cost is reduced by 1.",
      "dark": "Gain CC immunity while using said skill.",
      "books": [
        "DMG is increased by 10%.",
        "DMG is increased by 15%.",
        "DMG is increased by 25%."
      ],
      "uniqueTreasure": {
        "name": "Glacial Heart",
        "effect": [
          "[Icy Conquest] DMG is increased by 50% and Freeze duration is increased by 1 sec.",
          "[Icy Conquest] DMG is increased by 50% and Freeze duration is increased by 1.2 sec.",
          "[Icy Conquest] DMG is increased by 50% and Freeze duration is increased by 1.4 sec.",
          "[Icy Conquest] DMG is increased by 50% and Freeze duration is increased by 1.7 sec.",
          "[Icy Conquest] DMG is increased by 50% and Freeze duration is increased by 2.1 sec.",
          "[Icy Conquest] DMG is increased by 50% and Freeze duration is increased by 2.5 sec."
        ]
      }
    },
    {
      "id": 4,
      "skillInfo": [
        {
          "skillNumber": "s4",
          "name": "Chill of Early Dawn",
          "description": "Deals ??? M.DMG to 3 enemies every 15 sec and inflicts Frost on them to reduce their ATK Spd by 100 for 8 sec."
        }
      ],
      "light": "Target's CC resistance is reduced by 250 for 10 sec.",
      "dark": "Frost cannot be dispelled by dispel skills.",
      "books": [
        "DMG is increased by 10%.",
        "DMG is increased by 15%.",
        "DMG is increased by 25%."
      ],
      "uniqueTreasure": {
        "name": "Ice Dragon's Heart",
        "effect": [
          "[Chill of Early Dawn] Increases the number of targets by 1. Upon a Critical Hit, recovers own Mana by 100.",
          "[Chill of Early Dawn] Increases the number of targets by 1. Upon a Critical Hit, recovers own Mana by 120.",
          "[Chill of Early Dawn] Increases the number of targets by 1. Upon a Critical Hit, recovers own Mana by 140.",
          "[Chill of Early Dawn] Increases the number of targets by 1. Upon a Critical Hit, recovers own Mana by 170.",
          "[Chill of Early Dawn] Increases the number of targets by 1. Upon a Critical Hit, recovers own Mana by 210.",
          "[Chill of Early Dawn] Increases the number of targets by 1. Upon a Critical Hit, recovers own Mana by 250."
        ]
      }
    }
  ],
  "light": "ATK, DEF, HP+15% / Crit DMG +20%",
  "dark": "Every 3 sec, attacks all enemies and deals 50% of ATK as M.DMG, inflicting Frost with 50% chance. Enemies already inflicted with Frost takes 300% of ATK as M.DMG over time for 3 sec.",
  "background": {
    "profile": {
      "gender": "Male(+Female)",
      "race": "Human (Possessing a dragon's soul)",
      "age": "243 (Dragon: ???)",
      "height": "172 cm",
      "birthday": "12(Month) 2(Day), Month of Patience",
      "constellation": "Hexipolia the Wanderer",
      "likes": "Peace, silence, reading",
      "dislikes": "Hot weather, loud things"
    },
    "story": "A curious case of a human wizard possessed by the soul of an ice dragon. Having fought alongside Kyle 100 years ago, this ancient ice wizard has actually existed far before even then. The dragon's soul is usually asleep, but wakes up occasionally to speak to him in the voice of a lover. The empire considers him a key figure, and has dispatched Rodina to monitor and protect him. He himself, however, only wishes to live in peace and quiet, away from the concerns of the world.",
    "itemIntroductions": {
      "weapon": "Andarta and Andraste were two dragons who were defeated by the Demons during the war. They were a pair connected at the soul. They were lovers who understood each other better than anyone. Even as they lay dying, they refused to stay apart, and made one final request to Pavel, their comrade. Pavel granted their final wish by transferring their souls into their hearts, and then turning them into a pair of gems. Even though the two have lost their bodies, they remain together, and as inseparable as ever.",
      "soul": "An ominous wave of mana stroked the dragon's heart.\n\nLewisia had told Pavel about the situation in Orvel, and how Kasel turned into a dark lord. Pavel let out his rage onto the cruel reality, and his freezing fury fiercely permeated throughout the air.\nThe strong vibration of the soul was powerful enough to break the barrier containing immense mana to ensure comfortable rest to the two dragons.\n\nUltimately, Andarta and Andraste resonated with Pavel's freezing fury, and appeared with their gigantic wings.",
      "treasures": [
        "A snow crystal in an ancient form, and a home of the winter elementals. Its beauty imprisons weak minds in an eternal blizzard. Dragons Andarta and Andraste gave this to Pavel after he made their wish come true. It also consoled his lonely heart during his solitary stay in Windland until Rodina came along.",
        "The dragon of ice gifted this brooch to a young Pavel, and imbued it with its breath. But after the dragon of ice and Pavel became one, it reminds Pavel to not leave him. It can inflict pain that pierces the heart. Imbues a chill to Pavel's mana, making his magic even sharper.",
        "Frozen blood of the winter spirit. Pavel found it deep inside the Ice Cave and made it into earrings. A harsh chill and severe pain can be felt from it, but it increases Pavel's mana to its limit.",
        "A present that a possessed female Dragon gave to Pavel. The Ice Dragon always gave him all kinds of gifts, whether Pavel liked it or not. This orb was one of them, and it has a little part of her soul imbued in it."
      ]
    }
  },
  "skins": ["Professor", "Beachside", "Mad Hatter", "Caroler", "Kilt", "Soulbound Companion", "Red Velvet Cookie Cake Dreams"],
  "voice": {
    "actor": {
      "jp": "Inoue Yuki",
      "kr": "Park Shin Hee",
      "en": "N/A"
    },
    "lines": {
      "jp": [],
      "kr": [],
      "en": []
    }
  }
}
