{
  "name": "Lakrak",
  "title": "Hand Cannon's Hunter",
  "class": "mechanic",
  "damageType": "physical",
  "position": "Middle",
  "weapon": {
    "uniqueWeapon": {
      "name": "Lakrak MK-1",
      "effect": [
        "Gains a 25% chance to obtain a stack of Gunpowder upon attacking. Each stack of Gunpowder increases ATK by 3%, ATK Spd by 30, and DMG to non-Hero enemies by 3%. Gunpowder stacks up to 7 times and cannot be removed.",
        "Gains a 25% chance to obtain a stack of Gunpowder upon attacking. Each stack of Gunpowder increases ATK by 3.6%, ATK Spd by 36, and DMG to non-Hero enemies by 3.6%. Gunpowder stacks up to 7 times and cannot be removed.",
        "Gains a 25% chance to obtain a stack of Gunpowder upon attacking. Each stack of Gunpowder increases ATK by 4.3%, ATK Spd by 43, and DMG to non-Hero enemies by 4.3%. Gunpowder stacks up to 7 times and cannot be removed.",
        "Gains a 25% chance to obtain a stack of Gunpowder upon attacking. Each stack of Gunpowder increases ATK by 5.1%, ATK Spd by 51, and DMG to non-Hero enemies by 5.1%. Gunpowder stacks up to 7 times and cannot be removed.",
        "Gains a 25% chance to obtain a stack of Gunpowder upon attacking. Each stack of Gunpowder increases ATK by 6.2%, ATK Spd by 62, and DMG to non-Hero enemies by 6.2%. Gunpowder stacks up to 7 times and cannot be removed.",
        "Gains a 25% chance to obtain a stack of Gunpowder upon attacking. Each stack of Gunpowder increases ATK by 7.5%, ATK Spd by 75, and DMG to non-Hero enemies by 7.5%. Gunpowder stacks up to 7 times and cannot be removed."
      ]
    },
    "soulWeapon": {
      "advancement0": "Summons the soul of Lakrak MK-1, increasing own ATK by 50% for 12 sec. Afterward, deals a total of ??? P.DMG to enemies within range of a random enemy over 5 times every 4 sec, stunning them for 2 sec and increasing P.DMG they take by 30% for 8 sec.",
      "advancement1": "Reduces Skill Activation Requirements by 2 sec and gains immunity to CC for 12 sec.",
      "advancement2": "Reduces Skill Activation Requirements by an additional 4 sec, and immediately reduces Cooldown of all Skills by 3 sec every 4 sec.",
      "activation": "Charges up over 18 sec.",
      "cd": 19,
      "charges": 6
    }
  },
  "skills": [
    {
      "id": 1,
      "skillInfo": [
        {
          "skillNumber": "s1",
          "name": "Rapid Fire",
          "description": "Attacks all frontal enemies in a straight line, dealing ??? P.DMG and pushing them back. If the target is not a Hero, deals ??? additional P.DMG and stuns them for 5 sec.",
          "cooldown": 8,
          "cost": 2
        }
      ],
      "light": "DMG is increased by 40%.",
      "dark": "Stuns the enemy for 3 sec.",
      "books": [
        "DMG is increased by 10%.",
        "DMG is increased by 15%.",
        "DMG is increased by 25%."
      ],
      "uniqueTreasure": {
        "name": "Cudgel Bullet",
        "effect": [
          "[Rapid Fire] Increases DMG by 50%, and increases P.DMG target receives by 10% for 10 sec.",
          "[Rapid Fire] Increases DMG by 50%, and increases P.DMG target receives by 12% for 10 sec.",
          "[Rapid Fire] Increases DMG by 50%, and increases P.DMG target receives by 14% for 10 sec.",
          "[Rapid Fire] Increases DMG by 50%, and increases P.DMG target receives by 17% for 10 sec.",
          "[Rapid Fire] Increases DMG by 50%, and increases P.DMG target receives by 21% for 10 sec.",
          "[Rapid Fire] Increases DMG by 50%, and increases P.DMG target receives by 25% for 10 sec."
        ]
      }
    },
    {
      "id": 2,
      "skillInfo": [
        {
          "skillNumber": "s2",
          "name": "Smoke Bomb",
          "description": "Deals ??? P.DMG to enemies in range. Target takes 20% increased P.DMG for 10 sec and is inflicted with Blind for 4 sec.",
          "cooldown": 15,
          "cost": 2
        }
      ],
      "light": "Mana cost is reduced by 1.",
      "dark": "Blind duration is increased by 2 sec.",
      "books": [
        "DMG is increased by 10%.",
        "DMG is increased by 15%.",
        "Deals DMG and Stuns the enemy for 1 sec."
      ],
      "uniqueTreasure": {
        "name": "Special Gas Mask",
        "effect": [
          "[Smoke Bomb] Reduces Cooldown by 30% and increases blind duration by 1 sec.",
          "[Smoke Bomb] Reduces Cooldown by 30% and increases blind duration by 1.2 sec.",
          "[Smoke Bomb] Reduces Cooldown by 30% and increases blind duration by 1.4 sec.",
          "[Smoke Bomb] Reduces Cooldown by 30% and increases blind duration by 1.7 sec.",
          "[Smoke Bomb] Reduces Cooldown by 30% and increases blind duration by 2.1 sec.",
          "[Smoke Bomb] Reduces Cooldown by 30% and increases blind duration by 2.5 sec."
        ]
      }
    },
    {
      "id": 3,
      "skillInfo": [
        {
          "skillNumber": "s3",
          "name": "Glue Bomb",
          "description": "Attaches a Glue Bomb to a random enemy that explodes in 3 sec. The explosion deals max ??? P.DMG proportional to enemy's current HP to enemies in range, and inflicts Stun for 3 sec. Upon attaching the Glue Bomb, target is inflicted with Stun for 2 sec.",
          "cooldown": 12,
          "cost": 3
        }
      ],
      "light": "Mana cost is increased by 1, and attacks a random target 2 times.",
      "dark": "Mana cost is reduced by 1.",
      "books": [
        "DMG is increased by 10%.",
        "DMG is increased by 15%.",
        "DMG is increased by 25%."
      ],
      "uniqueTreasure": {
        "name": "Goblincraft Special High-Density Gunpowder",
        "effect": [
          "[Glue Bomb] DMG is increased by 50%, and upon Crit Hit, recovers 200 mana.",
          "[Glue Bomb] DMG is increased by 50%, and upon Crit Hit, recovers 240 mana.",
          "[Glue Bomb] DMG is increased by 50%, and upon Crit Hit, recovers 290 mana.",
          "[Glue Bomb] DMG is increased by 50%, and upon Crit Hit, recovers 350 mana.",
          "[Glue Bomb] DMG is increased by 50%, and upon Crit Hit, recovers 420 mana.",
          "[Glue Bomb] DMG is increased by 50%, and upon Crit Hit, recovers 500 mana."
        ]
      }
    },
    {
      "id": 4,
      "skillInfo": [
        {
          "skillNumber": "s4",
          "name": "Load Cannon",
          "description": "Each auto attack has a 15% chance of firing a bomb that deals ??? P.DMG to enemies in range and stuns them for 2 sec."
        }
      ],
      "light": "Activation chance is boosted by 10%.",
      "dark": "Target takes 25% increased P.DMG for 10 sec.",
      "books": [
        "DMG is increased by 10%.",
        "DMG is increased by 15%.",
        "DMG is increased by 25%."
      ],
      "uniqueTreasure": {
        "name": "Bada Boom Cannonball",
        "effect": [
          "[Load Cannon] Reduces Mana of hit enemies by 400. The first strike in a battle will activate [Load Cannon].",
          "[Load Cannon] Reduces Mana of hit enemies by 480. The first strike in a battle will activate [Load Cannon].",
          "[Load Cannon] Reduces Mana of hit enemies by 580. The first strike in a battle will activate [Load Cannon].",
          "[Load Cannon] Reduces Mana of hit enemies by 700. The first strike in a battle will activate [Load Cannon].",
          "[Load Cannon] Reduces Mana of hit enemies by 840. The first strike in a battle will activate [Load Cannon].",
          "[Load Cannon] Reduces Mana of hit enemies by 1000. The first strike in a battle will activate [Load Cannon]."
        ]
      }
    }
  ],
  "light": "ATK, DEF, HP+15% / Crit DMG +20%",
  "dark": "Upon a Critical Hit, gain 5% Crit DMG and 30 CC Accuracy. Stacks up to 10 times.",
  "background": {
    "profile": {
      "gender": "Male",
      "race": "Goblin",
      "age": "19 Years",
      "height": "120 cm",
      "birthday": "5(Month) 12(Day), Month of Hope",
      "constellation": "Graham the Thief",
      "likes": "Gunpowder, guns, cannons",
      "dislikes": "Foolish Goblins"
    },
    "story": "This eccentric albino Goblin enjoys developing powerful weapons more than anything else. Having been harassed and ostracized by other Goblins due to his skin color, he feels no compassion toward his kind. He would gladly shoot, blow up, and smash even a fellow Goblin to test his weapons. However, he also expresses his gratitude to those who help him, and this is how he became Roi's friend. Unfortunately, he is terrible at remembering faces, so he often tries to shoot Roi before he recalls who he is.",
    "itemIntroductions": {
      "weapon": "The destructive yet artistic magnum opus of a quirky Goblin inventor. This single-hand cannon packs the maximum amount of firepower a single Goblin can physically handle. Despite the dangerous amount of gunpowder used, this weapon has fortunately not blown up yet.",
      "soul" : "Lakrak had made many weapons, but nothing surpassed Lakrak MK-1. Not only did this weapon not malfunction even it was overloaded with excess black powder, but also consistently delivered powerful blasts which met Lakrak's standard for 'ideal' firepower.\nLakrak however, did not stop there.\nAltough Lakrak was a small, weak goblin, he never stopped with the development of the ultimate weapon, and it was his everything. In the end, Lakrak's endless desire to create the ultimate weapon awakened the soul accumulated within Lakrak MK-1.\nTo satiate its creator's needs, the soul of Lakrak MK-1 became obsessed with devastating firepower, but it seems to be neglecting the fact that its obession is potentially life-threatening to its master.",
      "treasures": [
        "A self-defense bullet with lower killing power. This bullet, whose design is based on Lakrak's knowledge in precise explosive engineering, is used to cause knock-back when using Rapid Fire. To minimize unnecessary killing, he makes it a point to label all his explosives.",
        "A high-performing mask that was made with special materials that Lakrak obtained from around the Orbis Continent. This mask is made from Harpy's first feather, a dragon's scales, a leaf from the World Tree, and the empire's mithril, which are all hard to find. This mask protects one from poisonous gas as well as the blinding effect of Smoke Bombs.",
        "Gunpowder made with Lakrak's dangerous secret recipe. Lakrak believed that simple explosions weren't effective enough in terms of battle strategy, so he added some formic acid and stinging nettle poison to add a stunning effect. It requires an extremely accurate filtering process, and he uses it in secret to avoid abuse.",
        "A cannon shell Lakrak made in collaboration with Miruru Pirates. After overcoming many hardships, Miruru Pirates and Lakrak joined hands and worked together for this monster of a weapon. The special Miruru gunpowder added a significant amount of destructive power to Lakrak's cannonball."
      ]
    }
  },
  "skins": ["Patch Style", "Clown", "Ice Demon", "Beachside", "Miner"],
  "voice": {
    "actor": {
      "jp": "N/A",
      "kr": "N/A",
      "en": "N/A"
    },
    "lines": {
      "jp": [],
      "kr": [],
      "en": []
    }
  }
}