{
    "name": "Cain",
    "title": "The Immortal God King",
    "class": "wizard",
    "damageType": "physical",
    "position": "Middle",
    "weapon": {
        "uniqueWeapon": {
            "name": "Might of the God King, Tyrannicus",
            "effect": [
                "Depending on which form Cain is in, Normal and Skill attacks grant additional effects.\n[God King] Stuns the target for 1 sec with a 20% chance.\n[Tyrant] Increases P.DMG the target takes by 20% for 3 sec.",
                "Depending on which form Cain is in, Normal and Skill attacks grant additional effects.\n[God King] Stuns the target for 1 sec with a 2$% chance.\n[Tyrant] Increases P.DMG the target takes by 2$% for 3 sec.",
                "Depending on which form Cain is in, Normal and Skill attacks grant additional effects.\n[God King] Stuns the target for 1 sec with a 29% chance.\n[Tyrant] Increases P.DMG the target takes by 29% for 3 sec.",
                "Depending on which form Cain is in, Normal and Skill attacks grant additional effects.\n[God King] Stuns the target for 1 sec with a 35% chance.\n[Tyrant] Increases P.DMG the target takes by 35% for 3 sec.",
                "Depending on which form Cain is in, Normal and Skill attacks grant additional effects.\n[God King] Stuns the target for 1 sec with a 42% chance.\n[Tyrant] Increases P.DMG the target takes by 42% for 3 sec.",
                "Depending on which form Cain is in, Normal and Skill attacks grant additional effects.\n[God King] Stuns the target for 1 sec with a 50% chance.\n[Tyrant] Increases P.DMG the target takes by 50% for 3 sec."
            ]
        },
        "soulWeapon": {
            "advancement0": "Summons the soul of Might of the God King, Tyrannicus, dealing ??? P.DMG to enemies within range of self, and inflicting time stop for 4 sec. Afterwards, increases own ATK by 50% for 10 sec. While time stop is active, Normal and Skill attacks cannot be used, and Cooldown is fixed.",
            "advancement1": "Heals HP of allies within range by ??? over 10 sec.",
            "advancement2": "Dispels positiv effects of all enemies in range.",
            "activation": "Charges up upon using Skills 5 times.",
            "cd": 22,
            "charges": 5
        }
    },
    "skills": [
        {
            "id": 1,
            "skillInfo": [
                {
                    "skillNumber": "s1",
                    "name": "Tremble!",
                    "description": "Cain heals the ally with the lowest HP by ??? and grants the ally with [The God King’s Blessing] for 5 seconds, which reduces All DMG the ally receives 30% and grants immunity to CC. After 5 seconds, Cain dispels negative effects from the target and the allies nearby. Afterwards, heals their HP by ???. [The God King’s Blessing] is irremovable.",
                    "cooldown": 12,
                    "cost": 2
                },
                {
                    "skillNumber": "s1_2",
                    "name": "Kneel.",
                    "description": "Cain deals ??? P.DMG to the enemy with the highest ATK and casts [Sealing Technique of the Tyrant] that reduces the target's ATK Spd 350 and prevents the target from receiving any positive effects for 5 sec. After 5 sec, Cain deals ??? P.DMG to the target and the enemies nearby, inflicting stun for 3 sec. [Sealing Technique of the Tyrant] is irremovable.",
                    "cooldown": 12,
                    "cost": 2
                }
            ],
            "light": "[Tremble] The effect applies to 3 allies, but all the effects that activate after few will not be activated.",
            "dark": "[Kneel] The effect apples to 3 enemies, but all the effects that activate after few will not be activated.",
            "books": [
                "Increases DMG and Heal Rate by 10%.",
                "Increases DMG and Heal Rate by 15%.",
                "Increases DMG and Heal Rate by 25%."
            ],
            "uniqueTreasure": {
                "name": "Rune of the Flow",
                "effect": [
                    "[Tremble!] Increase All DMG Reduction effect of the Skill by an additional 10%.\n[Kneel] Reduces Mana Cost by 1.",
                    "[Tremble!] Increase All DMG Reduction effect of the Skill by an additional 12%.\n[Kneel] Reduces Mana Cost by 1.",
                    "[Tremble!] Increase All DMG Reduction effect of the Skill by an additional 14%.\n[Kneel] Reduces Mana Cost by 1.",
                    "[Tremble!] Increase All DMG Reduction effect of the Skill by an additional 17%.\n[Kneel] Reduces Mana Cost by 1.",
                    "[Tremble!] Increase All DMG Reduction effect of the Skill by an additional 21%.\n[Kneel] Reduces Mana Cost by 1.",
                    "[Tremble!] Increase All DMG Reduction effect of the Skill by an additional 25%.\n[Kneel] Reduces Mana Cost by 1."
                ]
            }
        },
        {
            "id": 2,
            "skillInfo": [
                {
                    "skillNumber": "s2",
                    "name": "Behold My Might.",
                    "description": "Cain turns into a [Tyrant] and constantly attacks the target, dealing ??? P.DMG with each hit. While Cain is in [Tyrant] form, [Tremble!] and [Gaze Upon My Almighty Power!] change to [Kneel.] and [Now Die.]. Upon using the Skill again, he returns to [God King] form.\n[The God King’s Mercy] - While Cain is in God King form, reduces DMG all allies take 10%.\n[Dignity of the Tyrant] – While Cain is in Tyrant form, increases DMG all enemies take 10%.",
                    "cooldown": 8,
                    "cost": 2
                }
            ],
            "light": "Each stack of [King of the Desert] increases the DMG of this Skill by 30%",
            "dark": "Reduces Cooldown by 4 sec, and during Auto Battle, allows Cain to return to God King form after turning into Tyrant form.",
            "books": [
                "Increases DMG by 10%.",
                "Increases DMG by 15%.",
                "Increases DMG by 25%."
            ],
            "uniqueTreasure": {
                "name": "Eye of the God King",
                "effect": [
                    "[Behold My Might] Increases DMG by 50% and when Cain is in Tyrant form, increases DMG by 10%.",
                    "[Behold My Might] Increases DMG by 50% and when Cain is in Tyrant form, increases DMG by 12%.",
                    "[Behold My Might] Increases DMG by 50% and when Cain is in Tyrant form, increases DMG by 14%.",
                    "[Behold My Might] Increases DMG by 50% and when Cain is in Tyrant form, increases DMG by 17%.",
                    "[Behold My Might] Increases DMG by 50% and when Cain is in Tyrant form, increases DMG by 21%.",
                    "[Behold My Might] Increases DMG by 50% and when Cain is in Tyrant form, increases DMG by 25%."
                ]
            }
        },
        {
            "id": 3,
            "skillInfo": [
                {
                    "skillNumber": "s3",
                    "name": "Gaze Upon My Almighty Power!",
                    "description": "Increases All DEF of allies nearby self by ??? for 10 sec 10 times. DEF Boost effect stacks up to 10 time(s), and if this Skill is cast on an ally with 10 stacks, increases the target’s ATK ??? and grants immunity to CC for 10 sec.",
                    "cooldown": 25,
                    "cost": 3
                },
                {
                    "skillNumber": "s3_2",
                    "name": "Now Die",
                    "description": "Places a [Gate of Hell] in frontal area of self for 3 sec, dealing a total of ??? P.DMG to enemies in range over 10 attack(s) and pulling them to the center. Afterwards, explodes the [Gate of hell], dealing ??? P.DMG and stunning the enemies for 3 sec.",
                    "cooldown": 25,
                    "cost": 4
                }
            ],
            "light": "[Gaze Upon My Almighty Power!] Increases the duration of the effect by 10 sec.",
            "dark": "[Now Die.] Reduces mana cost by 1.",
            "books": [
                "Increases ATK Boost and DMG by 10%.",
                "Increases ATK Boost and DMG by 15%.",
                "Increases ATK Boost and DMG by 25%."
            ],
            "uniqueTreasure": {
                "name": "Chest of Integrity",
                "effect": [
                    "[Gaze Upon Mu Almighty Power!] Increases ATK Boost by 50%.\n[Now Die] Increases P.DMG the target takes by 10% for 10 sec.",
                    "[Gaze Upon Mu Almighty Power!] Increases ATK Boost by 50%.\n[Now Die] Increases P.DMG the target takes by 12% for 10 sec.",
                    "[Gaze Upon Mu Almighty Power!] Increases ATK Boost by 50%.\n[Now Die] Increases P.DMG the target takes by 15% for 10 sec.",
                    "[Gaze Upon Mu Almighty Power!] Increases ATK Boost by 50%.\n[Now Die] Increases P.DMG the target takes by 17% for 10 sec.",
                    "[Gaze Upon Mu Almighty Power!] Increases ATK Boost by 50%.\n[Now Die] Increases P.DMG the target takes by 21% for 10 sec.",
                    "[Gaze Upon Mu Almighty Power!] Increases ATK Boost by 50%.\n[Now Die] Increases P.DMG the target takes by 25% for 10 sec."
                ]
            }
        },
        {
            "id": 4,
            "skillInfo": [
                {
                    "skillNumber": "s4",
                    "name": "I Am the King of the Desert.",
                    "description": "At the beginning of each battle, gains an irremoveable stack of [King of the Desert]. Each Stack of of [King of the Desert] increases the effect of [The God King's Mercy and [Dignity of the Tyrant] by 5%. Additionally, recovers 100 Mana every second, and increases ATK by ???. If [King of the Desert] is stacked 3 time(s) or more, self deals 50% increased DMG to Bosses. [King of the Desert] can be stacked up to 5 times."
                }
            ],
            "light": "DMG Boost against Bosses changes to 100%.",
            "dark": "Mana recovery per sec changes to 150.",
            "books": [
                "Increases ATK boost by 10%.",
                "Increases ATK boost by 15%.",
                "Increases ATK boost by 25%."
            ],
            "uniqueTreasure": {
                "name": "Archive of Sekireinel",
                "effect": [
                    "[I Am the King of the Desert.] Increases ATK Boost by 50%. If there are 3 or more stacks of [King of the Desert], increases Heal Rate of all allies by 20%.",
                    "[I Am the King of the Desert.] Increases ATK Boost by 50%. If there are 3 or more stacks of [King of the Desert], increases Heal Rate of all allies by 24%.",
                    "[I Am the King of the Desert.] Increases ATK Boost by 50%. If there are 3 or more stacks of [King of the Desert], increases Heal Rate of all allies by 29%.",
                    "[I Am the King of the Desert.] Increases ATK Boost by 50%. If there are 3 or more stacks of [King of the Desert], increases Heal Rate of all allies by 35%.",
                    "[I Am the King of the Desert.] Increases ATK Boost by 50%. If there are 3 or more stacks of [King of the Desert], increases Heal Rate of all allies by 42%.",
                    "[I Am the King of the Desert.] Increases ATK Boost by 50%. If there are 3 or more stacks of [King of the Desert], increases Heal Rate of all allies by 50%."
                ]
            }
        }
    ],
    "light": " ATK, DEF, HP+15% / HP +10%",
    "dark": "At the beginning of each battle, consumes 20% of self's current HP and increases ATK of all allies by 20% for 20 sec. If there 3 or less allies, reduces DMG that all allies take by 30%",
    "background": {
        "profile": {
            "gender": "Male",
            "race": "Human",
            "age": "28 Years",
            "height": "191 cm",
            "birthday": "2(Month), 1(Day), Month of Wisdom",
            "constellation": "Satua the Sage",
            "likes": "Laias, Clowns",
            "dislikes": "Darkness, backstabbing subjects, flatterers, those who are disloyal"
        },
        "story": "Ancient Sekireinel was a kingdom blessed with eternal prosperity under the rule of Cain, the greatest king that has ever ruled Sekireinel. Descendants of the desert addess Cain as the God King, as  it was their way of expressing their respect to the flawless, god-like king.\nThe people of the desert praised and followed Cain's overwhelming charisma, and Cain in return, gifted them with the fairest rule, and showed endless generosity and benevolence to his people. In Contrast, against those who would threaten his kingdom, Cain did not show any mercy. He ruthlessly tracked down and killed all those who threatened the peace of his kingdom, causing fear within the nations outside.\nHowever, deep inside the majestic, ruthless God King who asserted his reign over the kingdom, there lied a deep loneliness. When alone, the God King would contemplate endlessly. It was Laias who held Cain's hands when he was most vulnerable, and Cain fell in love with Laias who sang for him. Cain has since strongly expressed his love to Laias, eager to help Laias fulfill anything she wants.",
        "itemIntroductions": {
            "weapon": "Atermos was one the kings who ruled the Kingdom of Sekireinel, known as the king of insight for his great wisdom. One Day, he received a revelation from the heavens and gathered holy materials to handcraft a weapon. The legend says that as this weapon was wielded by the king of insight, Tyrannicus has the ability to look through the mind of anyone who tries to wield it. If deemed unworthy, Tyrannicus will not even let them hold itself; rather, it will serve the unworthy their death.\nAfter the passing of Atermos, Tyrannicus was used as a decoration that shined upon the throne from its behind, symbolizing the competence and authority of the king that ruled Sekireinel. Then, the day before Cain's enthronement, when cain reached his hand out to Tyrannicus, it immediately became the sun that shines upon Cain, as if it was overjoyed to find it true master.",
            "soul": "When Cain first locked his eyes on Tyrannicus on the throne, he came to fully understand what the true throne of the God King is.\n\nThe form of Tyrannicus' soul was the throne of God itself, and the light it emitted was truly fitting of the title: sun.\n\nAfter seeing the authority of the God King which eyes of other beings cannot perceive, Cain paid his utmost respect to the brilliance of Tyrannicus, and swore to become one worthy of the weapon. Ultimately, he rose to become the perfect king that reigned upon the desert Tyrannicus responded to Cain and accepted him, as if it was rewarding Cain's efforts. Tyrannicus deeply resonated with Cain's soul, and helped Cain rule the desert by sharing the wisdom of the king of acumen.",
            "treasures": [
                "A gold ring which  was equipped to Cain's body for ritualistic purpose, when Cain's soul-bound body entered a deep slumber called death.\nThe ring, imbued with the blessing of flow by Laias herself, was put onto Cain's ring finger, so that Cain can enjoy his eternal glory in the afterlife as the God King.\nAltough ut was unexpected for Cain to be awakened by a trivial being, thousands of years have already passed when he awoke. The ring was wrapped in sand and dust, but the jewel imbued with the Blue God Dragon's blessing was still shining brightly as ever.",
                "A coffin with an eye decoration, the symbol of the God King.\nThe symbol carries a message that since the almighty God King watches all over the ancient Sekireinel, the poeple of the desert should fear and praise him.",
                "A sealed container which cannot be opened no matter how hard one exerts strength.\nIt contains a gift from Skakmeh, Cain's brother who left behind his settled life in a foreign nation and returned to Sekireinel following Cain's command.\nCain had cherished his loyal, kind brother's gift, but the day when Shakmeh became the darkness that covered Sekireinel and became Cain's nemesis, Cain used his brother's gift as a medium to seal Shakmeh.\nCain, after awakening from his long slumber, grabbed the open container that was rolling on the ground and placed it somewhere he can see clearly to reflect upon old memories.",
                "A historical archive that contains the history of Sekireinel.\nAfter the awakening, curious of how the story of ancient Sekireinel and his brother were passed down to the future generations, Cain asked Zafir to bring him the historical records. The archive which Zafir brought to the God King is known as the most accurate record among other records of the tribes, since it is the record written and updated by the generations of the archivist family of Sekireinel, which they guarded with their life in the times of war and turmoil."
            ]
        }
    },
    "skins": [],
    "voice": {
        "actor": {
            "jp": "Nakaya Kazuhiro",
            "kr": "Yi Ho San",
            "en": "N/A"
        },
        "lines": {
            "jp": [],
            "kr": [],
            "en": []
        }
    }
}