{
  "heroName": "Seria",
  "title": "Shadow of the Abyss",
  "class": "warrior",
  "uw": {
    "name": "Executioner of Domains, Elsion",
    "effect": "Reduces own Heal Rate by 20%. Upon a critical skill hit, deals additional M.DMG of 30% ATK. Reduces Heal Rate of the target by 24% for 5 sec, and increases own Heal Rate by 4% for 20 sec. The Heal Rate increasing effect can be stacked up to max 5 times, and cannot be dispelled."
  },
  "skills":
  [
    {
      "id": 1,
      "skillInfo":
      [
        {
        "skillNumber": "s1_1",
        "name": "Mysterious Sword - Falling Petals",
        "effect": "Performs a horizontal slash to the front and deals ??? M.DMG to the target and enemies in a narrow range. Can activate [Mysterious Sword - Blossom] once within 5 sec after use.",
        "cooldown": 7,
        "cost": 1
        },
        {
          "skillNumber": "s1_2",
          "name": "Mysterious Sword - Blossom",
          "effect": "Performs a vertical slash to the front and deals ??? M.DMG to the target and enemies in a narrow range.",
          "cooldown": 0,
          "cost": 0
        }
      ],
      "linked": true,
      "light": "[Mysterious Sword - Falling Petals] - Mana cost is reduced by 1. [Mysterious Sword - Blossom] - Hit enemies' heal rate is reduced by 50% for 5 sec.",
      "dark": "[Mysterious Sword - Falling Petals] - Target takes 25% increased M.DMG for 10 sec. [Mysterious Sword - Blossom] - Mana cost is increased by 1, and Ignores enemy's DEF.",
      "books": [
        "Dmg is increased by 10%",
        "Dmg is increased by 15%",
        "DMG is increased by 25%"
      ],
      "ut": {
        "name": "Whetstone of Demon",
        "effect": "[Mysterious Sword - Falling Petals] Increases DMG by 50%, and upon Critical Hit, recovers Mana by 240. [Mysterious Sword - Blossom] Increases DMG by 50%, and upon Critical Hit, reduces Cooldown of [Mysterious Sword - Falling Petals] by 1 sec. "
      }
    },
    {
      "id": 2,
      "skillInfo": [
        {
          "skillNumber": "s2",
          "name": "Blood Scattering Blade",
          "effect": "Rapidly charges forward to deal ??? M.DMG and inflicts irremovable Original Sin of Blood on enemies for 3 sec. Enemies under Original Sin of Blood have their ATK Spd reduced by 300. Shortly afterward, attacks enemies under Original Sin of Blood 2 times, and deals additional ??? M.DMG, and if the target is not a hero, deals additional ??? DEF Ignoring M.DMG.",
          "cooldown": 13,
          "cost": 3
        }],
      "light": "Reduces Mana Cost by 1.",
      "dark": "Upon each DMG dealt, recovers 200 Mana.",
      "books": [
        "Dmg is increased by 10%",
        "Dmg is increased by 15%",
        "DMG is increased by 25%"
      ],
      "ut": {
        "name": "Ring of Abyss",
        "effect": "Increases DMG by 50% and reduces M.Block of affected enemies by 200."
      }
    },
    {
      "id": 3,
      "skillInfo": [
        {
          "skillNumber": "s3",
          "name": "Red Moon Blade",
          "effect": "Brandishes a moon-bloodying sword, dealing ??? M.DMG to enemies in a wide range, and additional ??? M.DMG on non-Hero enemies. When the moon is ripe, gains Moonlight for 1 sec, and when cast at this state, deals ??? M.DMG to enemies and reduces their Heal Rate by 100%. If the target is not a hero, deals additional ??? M.DMG.The caster is not affected by ATK Spd related effects while casting.",
          "cooldown": 24,
          "cost": 4
        }
      ],
      "light": "Dispels positive effects of all enemies in range.",
      "dark": "Increases Mana Cost by 1 and ignores DEF when attacking Non-Hero enemies.",
      "books": [
        "Dmg is increased by 10%",
        "Dmg is increased by 15%",
        "DMG is increased by 25%"
      ],
      "ut": {
        "name": "Enlightening Candlelight",
        "effect": "[Red Moon Blade] Gains immunity to CC for the duration of the skill. When the battle starts, increases DMG by 70% for 5 time."
      }
    },
    {
      "id": 4,
      "skillInfo": [
        {
          "skillNumber": "s4",
          "name": "Cold-Blooded Witch",
          "effect": "ATK is increased by ???. Upon a critical skill hit, own Crit DMG is increased by 5%. This effect can be stacked up to 30 times.",
          "cooldown": 0,
          "cost": 0
        }],
      "light": "Takes 0.7% reduced DMG per stack.",
      "dark": "When the battle starts, increases DMG to Non-Hero enemies by 25% for 200 sec.",
      "books": [
        "ATK boost is increased by 10%.",
        "ATK boost is increased by 15%.",
        "ATK boost is increased by 25%."
      ],
      "ut": {
        "name": "Demonic Eight Trigrams",
        "effect": "[Cold-Blooded Witch] Increases ATK boost by 50% and the max number of stacks for Crit DMG boost by 2."
      }
    }
  ],
  "light": "ATK, DEF, HP+15% / Crit DMG +20%",
  "dark": "All of caster's attacks will be critical hits, but the caster becomes unable to block while taking 25% increased damage.",
  "skins": [],
  "story": "Seria is the 101st heir of the ShadowHilts, a family of hunters that slays non-human, supernatural beings. She came all the way to Orvelia as a vampire hunter, seeking vengeance against her sister who turned into a vampire and slaughtered her comrades. Seria is also trying to save her little sister by putting her out of her misery.",
  "trivia": [
    "Seria is a 19 year old girl.",
    "Her birthday is July 6, month of Harmony.",
    "Her constellation is Notmun the Turner.",
    "She likes her sister Erze, strawberry parfait, fine swords and the moon.",
    "She dislikes her sister as a vampire and spiders.",
    "She is the second hero to have a playable sibling (after Laias and Lilia).",
    "Aside from hunting down her sister due to the murder of her friends, Seria had also been searching for Lewisia.",
    "Her name means 'serious' in Spanish.",
    "Her weapon more closely resembles a Katana.",
    "Likely the chosen warrior in her story is Kyle, who seems to have fallen into path of darkness."
  ]
}
