{
  "name": "Erze",
  "title": "Endless thirst",
  "class": "assassin",
  "damageType": "physical",
  "position": "Middle",
  "weapon": {
    "uniqueWeapon": {
      "name": "Essence of Greed, Perion",
      "effect": [
        "Each skill hit increases ATK and ATK Spd by 0.5% for 15 sec. This effect stacks up to 80 times.",
        "Each skill hit increases ATK and ATK Spd by 0.5% for 15 sec. This effect stacks up to 90 times.",
        "Each skill hit increases ATK and ATK Spd by 0.5% for 15 sec. This effect stacks up to 110 times.",
        "Each skill hit increases ATK and ATK Spd by 0.5% for 15 sec. This effect stacks up to 130 times.",
        "Each skill hit increases ATK and ATK Spd by 0.5% for 15 sec. This effect stacks up to 160 times.",
        "Each skill hit increases ATK and ATK Spd by 0.5% for 15 sec. This effect stacks up to 200 times."
      ]
    },
    "soulWeapon": {
      "advancement0": "Summons the soul of Essence of Greed, Perion for 7 sec. Every Skill attack grants a stack of 'Essence of Greed'. After 7 sec, the soul explodes and deals ??? P.DMG to all enemies. The DMG of this Skill increases by 1% for every 'Essence of Greed' stacks gained for the duration. 'Essence of Greed' can be stacked up to max 30 times.",
      "advancement1": "Each stack of 'Essence of Greed' deals 2% DMG.",
      "advancement2": "Max number of stacks of 'Essence of Greed' increases by 30, and DMG dealt at max stack of 'Essence of Greed' increases by 150%.",
      "activation": "Charges up over 22 sec.",
      "cd": 15,
      "charges": 6
    }
  },
  "skills": [
    {
      "id": 1,
      "skillInfo": [
        {
          "skillNumber": "s1",
          "name": "Sweet Blood",
          "description": "Deals ??? P.DMG to all enemies and steals HP equal to 10% of DMG dealt. Reduces Cooldown of [Sweet Blood] by ??? sec on each hit, and gains 1 stack of [Sweet Blood]. [Sweet Blood] can be stacked up to 5 times, and using the skill with 5 stacks of [Sweet Blood] grants 1 additional hits and removes [Sweet Blood] stacks.",
          "cooldown": 5,
          "cost": 2
        }
      ],
      "light": "Recovers 150 Mana every hit.",
      "dark": "Each use increases DMG by 10%. Stacks 30 times max.",
      "books": [
        "DMG is increased by 10%.",
        "DMG is increased by 15%.",
        "DMG is increased by 25%."
      ],
      "uniqueTreasure": {
        "name": "Fang of Thirst",
        "effect": [
          "[Sweet Blood] Reduces Mana Cost by 1 and increases P.DMG the hit enemy takes by 1%. This effect can be stacked up to max 10 times.",
          "[Sweet Blood] Reduces Mana Cost by 1 and increases P.DMG the hit enemy takes by 1.2%. This effect can be stacked up to max 10 times.",
          "[Sweet Blood] Reduces Mana Cost by 1 and increases P.DMG the hit enemy takes by 1.4%. This effect can be stacked up to max 10 times.",
          "[Sweet Blood] Reduces Mana Cost by 1 and increases P.DMG the hit enemy takes by 1.7%. This effect can be stacked up to max 10 times.",
          "[Sweet Blood] Reduces Mana Cost by 1 and increases P.DMG the hit enemy takes by 2.1%. This effect can be stacked up to max 10 times.",
          "[Sweet Blood] Reduces Mana Cost by 1 and increases P.DMG the hit enemy takes by 2.5%. This effect can be stacked up to max 10 times."
        ]
      }
    },
    {
      "id": 2,
      "skillInfo": [
        {
          "skillNumber": "s2",
          "name": "Soaking Blood",
          "description": "Dispels all negative effects and gains immunity to all CCs, P.DMG, and M.DMG for 5 sec. Inflicts 1 stack of [Soaking Blood] on all enemies, and additional 1 stack upon attacking a target with [Soaking Blood]. [Soaking Blood] can be stacked up to 6 times. Deals ??? P.DMG to enemies with [Soaking Blood] stacks after 5 sec, and steals HP equal to 25% of the DMG dealt. For every 3 stack(s) of [Soaking Blood], hit count increases by 1 and removes [Soaking Blood] stacks upon attacking.",
          "cooldown": 35,
          "cost": 2
        }
      ],
      "light": "Stuns the target for 3 sec upon hit.",
      "dark": "Mana cost is reduced by 1.",
      "books": [
        "DMG is increased by 10%.",
        "DMG is increased by 15%.",
        "DMG is increased by 25%."
      ],
      "uniqueTreasure": {
        "name": "Wine of Shivers",
        "effect": [
          "[Soaking Blood] Increases DMG of [Soaking Blood] by 50% and reduces Cooldown of [Soaking Blood] by 5 sec.",
          "[Soaking Blood] Increases DMG of [Soaking Blood] by 50% and reduces Cooldown of [Soaking Blood] by 6 sec.",
          "[Soaking Blood] Increases DMG of [Soaking Blood] by 50% and reduces Cooldown of [Soaking Blood] by 7 sec.",
          "[Soaking Blood] Increases DMG of [Soaking Blood] by 50% and reduces Cooldown of [Soaking Blood] by 8 sec.",
          "[Soaking Blood] Increases DMG of [Soaking Blood] by 50% and reduces Cooldown of [Soaking Blood] by 9 sec.",
          "[Soaking Blood] Increases DMG of [Soaking Blood] by 50% and reduces Cooldown of [Soaking Blood] by 10 sec."
        ]
      }
    },
    {
      "id": 3,
      "skillInfo": [
        {
          "skillNumber": "s3",
          "name": "Blood Liberation",
          "description": "Deals ??? P.DMG to all enemies every 1 sec for 10 sec. Each hit of [Blood Liberation] causes an additional hit on 1 random enemy.",
          "cooldown": 14,
          "cost": 3
        }
      ],
      "light": "Recovers 75 Mana every hit.",
      "dark": "Mana cost is increased by 1 orb but DMG is boosted by 100%.",
      "books": [
        "DMG is increased by 10%.",
        "DMG is increased by 15%.",
        "DMG is increased by 25%."
      ],
      "uniqueTreasure": {
        "name": "Lipstick of Shame",
        "effect": [
          "[Blood Liberation] Increases DMG of [Blood Liberation] by 20% and gains immunity to CC for the duration of [Blood Liberation].",
          "[Blood Liberation] Increases DMG of [Blood Liberation] by 24% and gains immunity to CC for the duration of [Blood Liberation].",
          "[Blood Liberation] Increases DMG of [Blood Liberation] by 29% and gains immunity to CC for the duration of [Blood Liberation].",
          "[Blood Liberation] Increases DMG of [Blood Liberation] by 35% and gains immunity to CC for the duration of [Blood Liberation].",
          "[Blood Liberation] Increases DMG of [Blood Liberation] by 42% and gains immunity to CC for the duration of [Blood Liberation].",
          "[Blood Liberation] Increases DMG of [Blood Liberation] by 50% and gains immunity to CC for the duration of [Blood Liberation]."
        ]
      }
    },
    {
      "id": 4,
      "skillInfo": [
        {
          "skillNumber": "s4",
          "name": "Life Drinker",
          "description": "Increases ATK by ??? and Max HP by ??? upon killing an enemy. Stacks up to max 50. Upon taking fatal DMG, casts [Soaking Blood], and decreases Max HP by 40%. This effect is not applied when [Soaking Blood] is in cooldown. This skill consumes all Mana upon activation."
        }
      ],
      "light": "Increases Max HP by 100% upon killing an enemy and changes the Max HP reduction after auto-casting [Soaking Blood] to 33%.",
      "dark": "Increases ATK by 200% upon killing an enemy, but Max HP boost does not apply.",
      "books": [
        "Increases ATK and Max HP Boost by 10%.",
        "Increases ATK and Max HP Boost by 15%.",
        "Increases ATK and Max HP Boost by 25%."
      ],
      "uniqueTreasure": {
        "name": "Moonlight Piano",
        "effect": [
          "[Life Drinker] Increases ATK boost and Max HP boost by 20%. Life Drinker becomes irremovable.",
          "[Life Drinker] Increases ATK boost and Max HP boost by 24%. Life Drinker becomes irremovable.",
          "[Life Drinker] Increases ATK boost and Max HP boost by 29%. Life Drinker becomes irremovable.",
          "[Life Drinker] Increases ATK boost and Max HP boost by 35%. Life Drinker becomes irremovable.",
          "[Life Drinker] Increases ATK boost and Max HP boost by 42%. Life Drinker becomes irremovable.",
          "[Life Drinker] Increases ATK boost and Max HP boost by 50%. Life Drinker becomes irremovable."
        ]
      }
    }
  ],
  "light": "ATK, DEF, HP+15% / Crit Chance +100",
  "dark": "Steals HP equal to 25% of DMG dealt by the final normal attack and gains 1 stack of [Sweet Blood].",
  "background": {
    "profile": {
      "gender": "Female",
      "race": "Vampire",
      "age": "18 Years",
      "height": "170 cm",
      "birthday": "7(Month) 6(Day), Month of Harmony",
      "constellation": "Notmun the Tuner",
      "likes": "Seria as a sister, chocolate parfait, blood of the corrupted",
      "dislikes": "Seria as a vampire hunter, spiders"
    },
    "story": "Born the second daughter of the ShadowHilt family, Erze also chose to become a vampire hunter after her beloved sister Seria. Erze's feeble frame kept her from learning how to fight with swords, but she managed to become known as a hunter with her talents in magic. One day she fell into a trap during an operation and was bitten by a mysterious vampire on the shoulder. Her weak constitution grew worse, and she suffered from frequent headaches and thirst every night. Erze knew what this meant and what would end up happening to her. She hid the bite and tried to find a cure on her own, distancing herself from her comrades in her efforts. Meanwhile, Seria was dispatched to Windland Snow Mountain to investigate the Vampire Princess that went missing 100 years ago. On the day her sister left... - Ahh, Seria... I cannot control it anymore... Erze quietly and secretly started slitting the throats of her comrades.",
    "itemIntroductions": {
      "weapon": "When did this all begin...? This torment that comes with unending thirst... But after quenching that thirst... My heart throbs with burning hatred against you, Seria......Ah, Seria. I have no other choice. I need this power to satisfy this endless thirst. This ever-flowing essence of power is the only cure to my eternal torment. Ah... This ecstasy... More... Someone, thrill me more.",
      "soul": "When Erze was presented with eternal thirst by the vampires, she instead killed them and absorbed their power. Perion, an essence created by this incident, was a small and weak sphere then.\nHowever, Erze's hidden talent transformed this sphere into an item that cycles itself to quench Erze's eternal thirst, and manifest the quenched thirst in a form of greed and strength.\nHer thirst exacerbated boundlessly, and eventually, even her mixed feeling toward her sister started to seep into the vortex of an endless cycle. Perion decided to aid Erze, and now it attempts to break its vessel to reborn into a new form.",
      "treasures": [
        "A fang of the Vampire that bit Erze. After Erze gained the power of blood that she had been craving, she went to this Vampire, brutally murdered it, and took its fang. When the moon is full, she would fiddle with the fang that once had her blood smeared on it, thinking of the past when she used to be a human, before she suffered from the violent thirst for blood.",
        "A wine made by Erze herself with the blood of fallen priests. One of her greatest pleasures is forcing those once considered holy to kneel before her. Inside the bottle is a bloody cross, and those who hear Erze drinking the wine off it shiver and tremble as the sound of the cross clanging inside.",
        "A dark red lipstick made from the blood of those who died disgraceful deaths. The ones who abandoned their dignity as humans and caved in to their insatiable desires failed to escape Erze's grasp. They died while in a complete trance state, but perhaps they might still feel happy about being used by Erze. Erze uses it to leave a mark on the neck of her prey after she has fed on them.",
        "A piano played by Erze on the Festival of Blood held on full moon's night. When her unquenchable thirst for blood finally settled down after razing a peaceful town to the ground, she found herself standing in complete silence on the blood-soaked ground. There was not a life that did not belong to her, and it made her want to play a beautiful tune for her silent audience. The sonata echoed around, over the mountain of dead bodies."
      ]
    }
  },
  "skins": ["Maid", "Pharaoh", "The Blood Oath", "Beachside", "Dancer"],
  "voice": {
    "actor": {
      "jp": "N/A",
      "kr": "N/A",
      "en": "N/A"
    },
    "lines": {
      "jp": [],
      "kr": [],
      "en": []
    }
  }
}