{
  "name": "Clause",
  "title": "Knight of Iron Defense",
  "class": "knight",
  "damageType": "physical",
  "position": "Front",
  "weapon": {
    "uniqueWeapon": {
      "name": "The Guardian, Exian",
      "effect": [
        "Upon casting an active skill 3 times, increases P.DEF and ATK for all allies by 10% for 10 sec. ATK boost is doubled for the ally with the highest ATK.",
        "Upon casting an active skill 3 times, increases P.DEF and ATK for all allies by 12% for 10 sec. ATK boost is doubled for the ally with the highest ATK.",
        "Upon casting an active skill 3 times, increases P.DEF and ATK for all allies by 14% for 10 sec. ATK boost is doubled for the ally with the highest ATK.",
        "Upon casting an active skill 3 times, increases P.DEF and ATK for all allies by 17% for 10 sec. ATK boost is doubled for the ally with the highest ATK.",
        "Upon casting an active skill 3 times, increases P.DEF and ATK for all allies by 21% for 10 sec. ATK boost is doubled for the ally with the highest ATK.",
        "Upon casting an active skill 3 times, increases P.DEF and ATK for all allies by 25% for 10 sec. ATK boost is doubled for the ally with the highest ATK."
      ]
    },
    "soulWeapon": {
      "advancement0": "Summons the soul of The Guardian, Exian, increasing P.DEF of all allies by 70% for 12 sec. For the duration of the Skill, normal attacks stun the target for 1 sec.",
      "advancement1": "For the Duration of the Skill, normal attacks reduce the target's P.DEF by 5% for 5 sec. The P.DEF reduction effect stacks up to max 7 times.",
      "advancement2": "Upon activation, reduces P.DMG the ally with the highest ATK takes by 80% for 6 sec, and increases ATK equal to 100% of clauses P.DEF. This effect is irremovable.",
      "activation": "Charges up every sec and every time self takes DMG. This Skill can be cast upon gaining 80 charges.",
      "cd": 25,
      "charges": 5
    }
  },
  "skills": [
    {
      "id": 1,
      "skillInfo": [
        {
          "skillNumber": "s1",
          "name": "Cut Ground",
          "description": "Leaps into the air and deals ??? P.DMG to enemies in range, stunning them for 3 sec.",
          "cooldown": 9,
          "cost": 2
        }
      ],
      "light": "Cooldown is reduced by 2 sec.",
      "dark": "In exchange for 1 additional Mana Cost, the skill has a 100% chance to draw the target in.",
      "books": [
        "DMG is increased by 10%.",
        "DMG is increased by 15%.",
        "Stun duration is increased by 2 sec."
      ],
      "uniqueTreasure": {
        "name": "Cape of Justice",
        "effect": [
          "[Cut Ground] Increases P.DMG target receives by 10% for 10 sec, and recovers own Mana by 400 per every hit enemy.",
          "[Cut Ground] Increases P.DMG target receives by 12% for 10 sec, and recovers own Mana by 400 per every hit enemy.",
          "[Cut Ground] Increases P.DMG target receives by 14% for 10 sec, and recovers own Mana by 400 per every hit enemy.",
          "[Cut Ground] Increases P.DMG target receives by 17% for 10 sec, and recovers own Mana by 400 per every hit enemy.",
          "[Cut Ground] Increases P.DMG target receives by 21% for 10 sec, and recovers own Mana by 400 per every hit enemy.",
          "[Cut Ground] Increases P.DMG target receives by 25% for 10 sec, and recovers own Mana by 400 per every hit enemy."
        ]
      }
    },
    {
      "id": 2,
      "skillInfo": [
        {
          "skillNumber": "s2",
          "name": "Shield Strike",
          "description": "Deals ??? P.DMG proportional to DEF to enemies in range and knocks them back. Hit enemies' DEF is reduced by 30%. Upon blocking an attack, skill cooldown is reduced by 0.5 sec.",
          "cooldown": 8,
          "cost": 1
        }
      ],
      "light": "Target takes 25% increased P.DMG for 10 sec.",
      "dark": "Stuns the enemy for 1 sec.",
      "books": [
        "DMG is increased by 10%.",
        "DMG is increased by 15%.",
        "Target's Spd is reduced by 50%."
      ],
      "uniqueTreasure": {
        "name": "Firm Determination",
        "effect": [
          "[Shield Strike] Reduces P.Crit Resistance of the affected enemy by 500 and Crit Chance by 100 for 10 sec.",
          "[Shield Strike] Reduces P.Crit Resistance of the affected enemy by 500 and Crit Chance by 120 for 10 sec.",
          "[Shield Strike] Reduces P.Crit Resistance of the affected enemy by 500 and Crit Chance by 140 for 10 sec.",
          "[Shield Strike] Reduces P.Crit Resistance of the affected enemy by 500 and Crit Chance by 170 for 10 sec.",
          "[Shield Strike] Reduces P.Crit Resistance of the affected enemy by 500 and Crit Chance by 210 for 10 sec.",
          "[Shield Strike] Reduces P.Crit Resistance of the affected enemy by 500 and Crit Chance by 250 for 10 sec."
        ]
      }
    },
    {
      "id": 3,
      "skillInfo": [
        {
          "skillNumber": "s3",
          "name": "Guardian Shield",
          "description": "All allies' P.DEF is increased by ??? for 20 sec and P.Crit Resistance is increased by 30%.",
          "cooldown": 12,
          "cost": 2
        }
      ],
      "light": "DEF boost is increased by 40%.",
      "dark": "Receives 25% reduced P.DMG for the duration.",
      "books": [
        "DEF boost is increased by 10%.",
        "DEF boost is increased by 15%.",
        "DEF boost is increased by 25%."
      ],
      "uniqueTreasure": {
        "name": "Guardian Knight Insignia",
        "effect": [
          "[Guardian Shield] Upon activation, removes negative effects on self, and DEF boost is increased by 20%.",
          "[Guardian Shield] Upon activation, removes negative effects on self, and DEF boost is increased by 24%.",
          "[Guardian Shield] Upon activation, removes negative effects on self, and DEF boost is increased by 29%.",
          "[Guardian Shield] Upon activation, removes negative effects on self, and DEF boost is increased by 35%.",
          "[Guardian Shield] Upon activation, removes negative effects on self, and DEF boost is increased by 42%.",
          "[Guardian Shield] Upon activation, removes negative effects on self, and DEF boost is increased by 50%."
        ]
      }
    },
    {
      "id": 4,
      "skillInfo": [
        {
          "skillNumber": "s4",
          "name": "Vow of Knights",
          "description": "Upon blocking, deals ??? P.DMG to frontal enemies and decreases ATK of affected targets by 20% for 8 sec. Recovers 300 MP after hitting the target."
        }
      ],
      "light": "Casting time is greatly boosted.",
      "dark": "Reduce an additional 10% of ATK.",
      "books": [
        "DMG is increased by 10%.",
        "DMG is increased by 15%.",
        "DMG is increased by 25%."
      ],
      "uniqueTreasure": {
        "name": "Mittens",
        "effect": [
          "[Vow of Knights] Upon activation, heals HP by 2% of Max HP, and increases own P.DEF by 20% for 5 sec.",
          "[Vow of Knights] Upon activation, heals HP by 2% of Max HP, and increases own P.DEF by 24% for 5 sec.",
          "[Vow of Knights] Upon activation, heals HP by 2% of Max HP, and increases own P.DEF by 29% for 5 sec.",
          "[Vow of Knights] Upon activation, heals HP by 2% of Max HP, and increases own P.DEF by 35% for 5 sec.",
          "[Vow of Knights] Upon activation, heals HP by 2% of Max HP, and increases own P.DEF by 42% for 5 sec.",
          "[Vow of Knights] Upon activation, heals HP by 2% of Max HP, and increases own P.DEF by 50% for 5 sec."
        ]
      }
    }
  ],
  "light": "ATK, DEF, HP+15% / P. Block +200",
  "dark": "When an ally other than this hero is hit by an attack, increase all allies P.DEF by 20% and P.Crit Resist by 20%. (10 sec Cooldown)",
  "background": {
    "profile": {
      "gender": "Male",
      "race": "Human",
      "age": "20 Years",
      "height": "195 cm",
      "birthday": "10(Month) 22(Day), Month of Friendship",
      "constellation": "Asiphia the Empress",
      "likes": "His new family",
      "dislikes": "Causing harm to friends"
    },
    "story": "This upright and righteous man protects Orvel as one of its knights. Many people consider him a dependable defender of Orvel, but due to his lack of interest in wealth and success, his actual rank within the order has never been very high. He grew up together with Kasel and Frey in the same orphanage, and he loves his land as the home of those precious to him. He recently volunteered to join the expedition to investigate the King's Plains.",
    "itemIntroductions": {
      "weapon": "A sword and shield set engraved with various Runes and infused with ancient magic. These legendary items are said to have been created eons ago by an ancient dragon named Exian, using its own scales. As one of the royal treasures of Orvel, the sword is bestowed only to the knight of the most honorable principles. Its wielder shall serve as the defender of the kingdom and its people, and the protector of life.",
      "soul": "Exian was always there with Clause. Exian saw how Clause swore to protect the ones precious to him, how he refused to be discouraged even facing loss, and how he cried in despair after losing his family. Exian always regarded Clause's conviction and courage highly, and whenever Clause cried and directed his fury, Exian did the same. Ultimately, Exian resonated with Clause's soul and unleashed its power.\n'Guardian knight, I shall guard you from now on, so that your conviction wil never break!'\nExian's power, awakened through ancient magic and ironclad will, shall accompany the unbreakable knight in his journey, even if the path is perilous and twisted...",
      "treasures": [
        "A ceremonial cape used on special occasions of Orvelia. Ever since it was bestowed upon Clause on the day he was knighted, it reminds Clause of his early resolutions. Whenever he wants to quit, exhausted from all the battles, Clause would bring it out and contemplate on it. Young Kasel used to watch Clause do this and dream of becoming a knight.",
        "Old wooden shield of the knight of the Iron Wall. It's a precious shield that Clause used when he first started training. He has since engraved the names of his deceased comrades in order to remember his determination as a guardian knight. Each time he pushes away enemies with the shield, the knight's firm determination helps him tap into power beyond his limits.",
        "Rune of the Orvel Guardian Knights. A Gold Lion Rune that is given to knights when they first join the Guardian Knights, along with the vow that they will give their lives to protect the kingdom. The rune from the Guardian Knights bolsters a knight's iron will and loyalty, increasing the effectiveness of the Guardian Shield.",
        "A pair of gloves that Clause cherishes the most. Young Kasel and Frey gave him these when Clause was ordained a knight during a particularly cold winter. Although it wasn't knitted perfectly, each of them knitted each piece with their initials engraved on it."
      ]
    }
  },
  "skins": ["Student Council", "Beachside", "Halcyon Knights", "Ice Knight", "Butler", "Centurion", "Beachside 2"],
  "voice": {
    "actor": {
      "jp": "Terashima Takuma",
      "kr": "Jeong Jae Heon",
      "en": "N/A"
    },
    "lines": {
      "jp": [],
      "kr": [],
      "en": []
    }
  }
}
