{
    "name": "Epis",
    "title": "Captivating Demon",
    "class": "assassin",
    "damageType": "magical",
    "position": "Front",
    "weapon": {
        "uniqueWeapon": {
            "name": "The Seductress, Guillotine",
            "effect": [
                "Upon attacking, there is a 25% chance of dealing 80% of ATK as extra M.DMG, and ATK being increased by 2%. ATK boost can be stacked up to 10 times max.",
                "Upon attacking, there is a 25% chance of dealing 96% of ATK as extra M.DMG, and ATK being increased by 2.4%. ATK boost can be stacked up to 10 times max.",
                "Upon attacking, there is a 25% chance of dealing 115% of ATK as extra M.DMG, and ATK being increased by 2.9%. ATK boost can be stacked up to 10 times max.",
                "Upon attacking, there is a 25% chance of dealing 138% of ATK as extra M.DMG, and ATK being increased by 3.5%. ATK boost can be stacked up to 10 times max.",
                "Upon attacking, there is a 25% chance of dealing 165% of ATK as extra M.DMG, and ATK being increased by 4.2%. ATK boost can be stacked up to 10 times max.",
                "Upon attacking, there is a 25% chance of dealing 200% of ATK as extra M.DMG, and ATK being increased by 5%. ATK boost can be stacked up to 10 times max."
            ]
        },
        "soulWeapon": {
            "advancement0": "Summons the Soul of The Seductress, Guillotine, and increases own ATK by 40% for 8 sec. For the duration of Skill, Normal and Skill attacks have a 20% chance to deal ??? M.DMG that ignores DEF to a target. If [Absorbing Blow] hits a target, this effect will activate with a 100% chance.",
            "advancement1": "Activation chance changes to 30%, and DMG increases by 50%.",
            "advancement2": "The M.DMG now ignores Block, and hit enemy takes 30% increased M.DMG for 7 sec.",
            "activation": "Charges up over 18 sec.",
            "cd": 18,
            "charges": 6
        }
    },
    "skills": [
        {
            "id": 1,
            "skillInfo": [
                {
                    "skillNumber": "s1",
                    "name": "Absorbing Blow",
                    "description": "Deals ??? M.DMG that ignores enemy DEF, and heals 25% of DMG as HP.",
                    "cooldown": 12,
                    "cost": 2
                }
            ],
            "light": "If there is 1 enemy, DMG is increased by 100%.",
            "dark": "Ignores enemy Block.",
            "books": [
                "DMG is increased by 10%.",
                "DMG is increased by 15%.",
                "DMG is increased by 25%."
            ],
            "uniqueTreasure": {
                "name": "Green Fairy",
                "effect": [
                    "[Absorbing Blow] Increases DMG by 20%, and upon killing an enemy, ATK is increased by 20% for 10 sec. ATK increase effect can be stacked up to max 3 times.",
                    "[Absorbing Blow] Increases DMG by 24%, and upon killing an enemy, ATK is increased by 20% for 10 sec. ATK increase effect can be stacked up to max 3 times.",
                    "[Absorbing Blow] Increases DMG by 29%, and upon killing an enemy, ATK is increased by 20% for 10 sec. ATK increase effect can be stacked up to max 3 times.",
                    "[Absorbing Blow] Increases DMG by 35%, and upon killing an enemy, ATK is increased by 20% for 10 sec. ATK increase effect can be stacked up to max 3 times.",
                    "[Absorbing Blow] Increases DMG by 42%, and upon killing an enemy, ATK is increased by 20% for 10 sec. ATK increase effect can be stacked up to max 3 times.",
                    "[Absorbing Blow] Increases DMG by 50%, and upon killing an enemy, ATK is increased by 20% for 10 sec. ATK increase effect can be stacked up to max 3 times."
                ]
            }
        },
        {
            "id": 2,
            "skillInfo": [
                {
                    "skillNumber": "s2",
                    "name": "Nightmare",
                    "description": "Moves behind the furthest enemy and deals ??? M.DMG. Hit enemies take 30% increased M.DMG for 10 sec.",
                    "cooldown": 8,
                    "cost": 2
                }
            ],
            "light": "Mana cost is reduced by 1.",
            "dark": "Mana consumption is increased by 1, and upon using the skill, 'Absorbing Blow' is activated. Cannot use when there are no enemies in range.",
            "books": [
                "DMG is increased by 10%.",
                "DMG is increased by 15%.",
                "DMG is increased by 25%."
            ],
            "uniqueTreasure": {
                "name": "Succubus's Box",
                "effect": [
                    "[Nightmare] Increases DMG by 50% and stuns the affected enemy for 2 sec.",
                    "[Nightmare] Increases DMG by 50% and stuns the affected enemy for 2.4 sec.",
                    "[Nightmare] Increases DMG by 50% and stuns the affected enemy for 2.9 sec.",
                    "[Nightmare] Increases DMG by 50% and stuns the affected enemy for 3.5 sec.",
                    "[Nightmare] Increases DMG by 50% and stuns the affected enemy for 4.2 sec.",
                    "[Nightmare] Increases DMG by 50% and stuns the affected enemy for 5 sec."
                ]
            }
        },
        {
            "id": 3,
            "skillInfo": [
                {
                    "skillNumber": "s3",
                    "name": "Devil's Prom",
                    "description": "Deals ??? M.DMG to all enemies in range. Gains CC immunity while using this skill.",
                    "cooldown": 20,
                    "cost": 4
                }
            ],
            "light": "DMG is increased by 40%.",
            "dark": "DMG taken is reduced by 50% while skill is in use.",
            "books": [
                "DMG is increased by 10%.",
                "DMG is increased by 15%.",
                "Upon a Crit Hit, heals 25% of DMG as HP."
            ],
            "uniqueTreasure": {
                "name": "Seductress Shoes",
                "effect": [
                    "[Devil's Prom] Mana cost is reduced by 1, and DMG is increased by 20%.",
                    "[Devil's Prom] Mana cost is reduced by 1, and DMG is increased by 24%.",
                    "[Devil's Prom] Mana cost is reduced by 1, and DMG is increased by 29%.",
                    "[Devil's Prom] Mana cost is reduced by 1, and DMG is increased by 35%.",
                    "[Devil's Prom] Mana cost is reduced by 1, and DMG is increased by 42%.",
                    "[Devil's Prom] Mana cost is reduced by 1, and DMG is increased by 50%."
                ]
            }
        },
        {
            "id": 4,
            "skillInfo": [
                {
                    "skillNumber": "s4",
                    "name": "Harvest",
                    "description": "When an enemy is killed by this hero, ATK is increased by ??? for 12 sec, and all skill cooldown is reduced by 30%."
                }
            ],
            "light": "Each stack increases Mana recovery per sec by 50%.",
            "dark": "While stack number is higher than 5, Mana is always at 100% and cooldowns are decreased by an additional 1 sec per each sec.",
            "books": [
                "ATK boost is increased by 10%.",
                "ATK boost is increased by 15%.",
                "Per each kill, recovers 1 orb of mana."
            ],
            "uniqueTreasure": {
                "name": "Memory of Dream",
                "effect": [
                    "[Harvest] Increases ATK boost by 50%. Killing an enemy increases ATK Spd by 20. This effect can be stacked up to max 10 times.",
                    "[Harvest] Increases ATK boost by 50%. Killing an enemy increases ATK Spd by 24. This effect can be stacked up to max 10 times.",
                    "[Harvest] Increases ATK boost by 50%. Killing an enemy increases ATK Spd by 29. This effect can be stacked up to max 10 times.",
                    "[Harvest] Increases ATK boost by 50%. Killing an enemy increases ATK Spd by 35. This effect can be stacked up to max 10 times.",
                    "[Harvest] Increases ATK boost by 50%. Killing an enemy increases ATK Spd by 42. This effect can be stacked up to max 10 times.",
                    "[Harvest] Increases ATK boost by 50%. Killing an enemy increases ATK Spd by 50. This effect can be stacked up to max 10 times."
                ]
            }
        }
    ],
    "light": "ATK, DEF, HP+15% / Crit DMG +20%",
    "dark": "All of Epis's attacks decrease the M.DEF of hit enemies by 20% for 10 sec. ATK rises by 2% per each enemy hit. Maximum stack number is 10.",
    "background": {
        "profile": {
            "gender": "Female",
            "race": "Demon",
            "age": "???",
            "height": "164 cm",
            "birthday": "8(Month) 13(Day), Month of Vitality",
            "constellation": "Kandala the Conqueror",
            "likes": "Anything that strikes interest or curiosity",
            "dislikes": "Boring atmosphere"
        },
        "story": "This playful and bewitching succubus acts on her own whims. As expected of her Demon lineage, she is a hedonist driven by what she finds fun and enjoyable. Even during the Demon War, she chose traveling around on her own over joining the invasion. In her eyes, fighting alongside Kyle was interesting enough for her to even betray her own kind. When she later met Kasel, she gladly joined his party, knowing that she found another fun adventure for herself. When she finds attractive men, she sometimes visits them in their dreams.",
        "itemIntroductions": {
            "weapon": "A deadly scythe that matches the characters of its wielder, Epis. It reaps the souls of those who approach it to admire its beauty. Created from within Epis's own body, the weapon is much like a succubus itself. It delivers extreme pleasure to its victims before absorbing their life energy. It seems that, in a way, Epis tried to show some sort of kindness with this weapon.",
            "soul": "Guillotine was born from Epis, and it grew as her strength and will grew stronger.\nThrough the Trial of Souls, Guillotine broke its limit as a tool with a fixed shape, and took a form of two scythes in order to harvest more souls and pleasure.\nPainless death and eternal pleasure await those enchanted by Guillotine's seductive appearance.",
            "treasures": [
                "Epis's favorite liquor. The most notorious liquor in Orvel, it is made from the strongest wormwood and can cause people to hallucinate. It is secretly used by artists to stoke their inspiration or as a cure for bad cases of insomnia. For Epis, however, it's a light, easy drink.",
                "Box containing the Nightmare Queen's sand of sleep. A box from the Demon World that contains magic sand that causes one to fall asleep. When the enemy falls asleep, attacks the enemy and deals M. DMG through a nightmare that cannot be dispelled.",
                "Epis's treasured item. When Epis first arrived in the human world, she really got into human culture and attended a masquerade. The dancing of a girl wearing red heels caught her eyes, and she made a deal with her in exchange for the those shoes. Epis wears her seductive heels and get carried away when inflicting pain on her enemies with her dance.",
                "A magical mirror that reflects the dreams Epis has absorbed. Since Epis has been using the mirror to store interesting dreams, it is now filled with countless traces of the deepest of secrets."
            ]
        }
    },
    "skins": ["Beachside", "Santa", "Samba", "Shackles of Seduction", "Angel", "Free Soul", "Nurse"],
    "voice": {
        "actor": {
            "jp": "Makino Yui",
            "kr": "Yeo Min Jeong",
            "en": "N/A"
        },
        "lines": {
            "jp": [],
            "kr": [],
            "en": []
        }
    }
}
