{
  "name": "Mitra",
  "title": "The Silver Battle Wolf",
  "class": "mechanic",
  "damageType": "physical",
  "position": "Middle",
  "weapon": {
    "uniqueWeapon": {
      "name": "Roar of Madness, Velkinoth",
      "effect": [
        "Upon a normal attack, increases own DEF Penetration and ATK Spd by 8. This effect cannot be dispelled, and can be stacked up to max 30 times.",
        "Upon a normal attack, increases own DEF Penetration and ATK Spd by 10. This effect cannot be dispelled, and can be stacked up to max 30 times.",
        "Upon a normal attack, increases own DEF Penetration and ATK Spd by 12. This effect cannot be dispelled, and can be stacked up to max 30 times.",
        "Upon a normal attack, increases own DEF Penetration and ATK Spd by 14. This effect cannot be dispelled, and can be stacked up to max 30 times.",
        "Upon a normal attack, increases own DEF Penetration and ATK Spd by 17. This effect cannot be dispelled, and can be stacked up to max 30 times.",
        "Upon a normal attack, increases own DEF Penetration and ATK Spd by 20. This effect cannot be dispelled, and can be stacked up to max 30 times."
      ]
    },
    "soulWeapon": {
      "advancement0": "Summons the soul of Roar of Madness, Velkinoth for 10 sec, increasing own ATK for 30%. The soul of Roar of Madness, Velkinoth attacks the enemy 12 times, dealing ??? each hit + ??? per each stack of Death Mark.",
      "advancement1": "Increases DMG of the soul of Roar of Madness, Velkinoth by 70%.",
      "advancement2": "For the duration of Skill, increases own DMG dealt to enemies by 30%.",
      "activation": "Charges up upoin dealing DMG 80 times.",
      "cd": 25,
      "charges": 7
    }
  },
  "skills": [
    {
      "id": 1,
      "skillInfo": [
        {
          "skillNumber": "s1",
          "name": "Bang! Bang!!",
          "description": "Attacks an enemy 2 times, dealing ??? P.DMG each. Upon Crit Hit, an explosion occurs, dealing ??? extra P.DMG to enemies in range.",
          "cooldown": 6,
          "cost": 1
        }
      ],
      "light": "DMG is increased by 100% when there is 1 enemy.",
      "dark": "Mark stacks 2 times.",
      "books": [
        "DMG is increased by 10%.",
        "DMG is increased by 15%.",
        "DMG is increased by 25%."
      ],
      "uniqueTreasure": {
        "name": "Potential Madness",
        "effect": [
          "[Bang! Bang!!] Increases DMG by 50% and reduces Cooldown by 0.8 sec.",
          "[Bang! Bang!!] Increases DMG by 50% and reduces Cooldown by 1 sec.",
          "[Bang! Bang!!] Increases DMG by 50% and reduces Cooldown by 1.2 sec.",
          "[Bang! Bang!!] Increases DMG by 50% and reduces Cooldown by 1.4 sec.",
          "[Bang! Bang!!] Increases DMG by 50% and reduces Cooldown by 1.7 sec.",
          "[Bang! Bang!!] Increases DMG by 50% and reduces Cooldown by 2 sec."
        ]
      }
    },
    {
      "id": 2,
      "skillInfo": [
        {
          "skillNumber": "s2",
          "name": "Time to Die!!",
          "description": "For 20 sec, ATK is increased by ??? , and ACC is increased by 300. Each auto attack has a 15% chance of activating 'Bang! Bang!!'.",
          "cooldown": 15,
          "cost": 2
        }
      ],
      "light": "Upon activation, HP will not be reduced below 5% for 3 sec.",
      "dark": "Crit DMG is increased by 50% for the duration of Skill.",
      "books": [
        "ATK boost is increased by 10%.",
        "ATK boost is increased by 15%.",
        "ATK boost is increased by 25%."
      ],
      "uniqueTreasure": {
        "name": "Wolf's Barrage Box",
        "effect": [
          "[Time to Die!] Reduces Mana Cost by 1, and increases DMG dealt to bosses by 20% for the duration of Skill.",
          "[Time to Die!] Reduces Mana Cost by 1, and increases DMG dealt to bosses by 24% for the duration of Skill.",
          "[Time to Die!] Reduces Mana Cost by 1, and increases DMG dealt to bosses by 29% for the duration of Skill.",
          "[Time to Die!] Reduces Mana Cost by 1, and increases DMG dealt to bosses by 35% for the duration of Skill.",
          "[Time to Die!] Reduces Mana Cost by 1, and increases DMG dealt to bosses by 42% for the duration of Skill.",
          "[Time to Die!] Reduces Mana Cost by 1, and increases DMG dealt to bosses by 50% for the duration of Skill."
        ]
      }
    },
    {
      "id": 3,
      "skillInfo": [
        {
          "skillNumber": "s3",
          "name": "Dance with me!!",
          "description": "Rapidly shoots a random enemy 12 times, dealing a total of ??? P.DMG, and additional ??? P.DMG per Mark of Death stack. Each hit with this Skill inflicts an irremovable stack of Mark of Death on the enemy.",
          "cooldown": 25,
          "cost": 4
        }
      ],
      "light": "DMG is increased by 40%.",
      "dark": "Stacks 2 more mark per hit.",
      "books": [
        "DMG is increased by 10%.",
        "DMG is increased by 15%.",
        "DMG is increased by 25%."
      ],
      "uniqueTreasure": {
        "name": "Wolfhead Mercenary Insignia",
        "effect": [
          "[Dance with me!!] DMG is increased by 20% and per every activation, skill cooldown is reduced by 5%. This effect can be stacked max 8 times.",
          "[Dance with me!!] DMG is increased by 24% and per every activation, skill cooldown is reduced by 5%. This effect can be stacked max 8 times.",
          "[Dance with me!!] DMG is increased by 29% and per every activation, skill cooldown is reduced by 5%. This effect can be stacked max 8 times.",
          "[Dance with me!!] DMG is increased by 35% and per every activation, skill cooldown is reduced by 5%. This effect can be stacked max 8 times.",
          "[Dance with me!!] DMG is increased by 42% and per every activation, skill cooldown is reduced by 5%. This effect can be stacked max 8 times.",
          "[Dance with me!!] DMG is increased by 50% and per every activation, skill cooldown is reduced by 5%. This effect can be stacked max 8 times."
        ]
      }
    },
    {
      "id": 4,
      "skillInfo": [
        {
          "skillNumber": "s4",
          "name": "You're Next!!",
          "description": "Normal attacks inflict an irremovable stack of Mark of Death on the enemy. Whenever a normal attack or Bang! Bang! hits the target, deals ??? additional P.DMG. Each stack of Mark of Death deals ??? additional P.DMG. Mark of Death can be stacked up to max 200 times."
        }
      ],
      "light": "Mark maximum is changed to 300.",
      "dark": "All cooldowns are reduced by 0.3 when hitting a target with 100 stacks.",
      "books": [
        "DMG is increased by 10%.",
        "DMG is increased by 15%.",
        "DMG is increased by 25%."
      ],
      "uniqueTreasure": {
        "name": "Song of Madness",
        "effect": [
          "[You're Next!!] Increases DMG by 20%. Upon attacking enemies inflicted with 100 or more stacks of Mark of Death, increases own Crit DMG by 2% for 10 sec. Crit DMG boost can be stacked up to max 25 times.",
          "[You're Next!!] Increases DMG by 24%. Upon attacking enemies inflicted with 100 or more stacks of Mark of Death, increases own Crit DMG by 2% for 10 sec. Crit DMG boost can be stacked up to max 25 times.",
          "[You're Next!!] Increases DMG by 29%. Upon attacking enemies inflicted with 100 or more stacks of Mark of Death, increases own Crit DMG by 2% for 10 sec. Crit DMG boost can be stacked up to max 25 times.",
          "[You're Next!!] Increases DMG by 35%. Upon attacking enemies inflicted with 100 or more stacks of Mark of Death, increases own Crit DMG by 2% for 10 sec. Crit DMG boost can be stacked up to max 25 times.",
          "[You're Next!!] Increases DMG by 42%. Upon attacking enemies inflicted with 100 or more stacks of Mark of Death, increases own Crit DMG by 2% for 10 sec. Crit DMG boost can be stacked up to max 25 times.",
          "[You're Next!!] Increases DMG by 50%. Upon attacking enemies inflicted with 100 or more stacks of Mark of Death, increases own Crit DMG by 2% for 10 sec. Crit DMG boost can be stacked up to max 25 times."
        ]
      }
    }
  ],
  "light": "ATK, DEF, HP+15% / Crit DMG +20%",
  "dark": "Upon a Critical Hit, increases own Crit DMG by 0.5% and ATK Spd by 5. This can be stacked up to max 120 times and is irremovable.",
  "background": {
    "profile": {
      "gender": "Male",
      "race": "Human",
      "age": "17 Years",
      "height": "192 cm",
      "birthday": "12(Month) 17(Day), Month of Patience",
      "constellation": "Hexipolia the Wanderer",
      "likes": "Battle, exciting fights, the smell of gunpowder",
      "dislikes": "Pretensions Hypocrisy"
    },
    "story": "Known to some as the Song of the Silver Madness, he is incredibly insincere in everything he does. He shows absolutely no sense of responsibility in regard to those around him. Once he engages in a combat, though, he turns into an untouchable silver wolf that storms across the battlefield. Nothing is known about his past. One thing is certain: he does not distinguish between friend and foe once the madness of battle takes over him. Staying near him when he's in this state may be far more dangerous than holding onto a ticking time bomb.",
    "itemIntroductions": {
      "weapon": "A pair of magical weapons that absorb the bloodlust of their user to enhance their own firepower. Each pull of their triggers pushes the user deeper and deeper into the craze of the battle. It is said that when a master craftsman creates a weapon, it develops a soul. Berkinos seem to have the soul of the war god. According to the story, when their creator pulled their triggers for the first time, he suddenly turned pale with terror and threw them into a river.",
      "soul": "The flash from the barrels of Velkinoth did not fade. As the smoke from its gunpowder entwined with the scent of blood, it lost its distinct smell. And yet, Mitra did not stop. The scenes of unstoppable carnage eventually awakened the soul of madness that was dormant inside Velkinoth. The newly-awakened soul liked the way how Mitra went full berserk in battles. Above all, it liked how Mitra released his madness through its barrels. But Velkinoth wanted to release even more madness whenever Mitra pulled the trigger. It wanted to release its madness until its body was all burned.\nEventually, Velkinoth's desire resonated with Mitra's soul and gave birth to its new form as the embodiment of madness.\n\n'Damn!! This is awesome!'",
      "treasures": [
        "Velkinoth's speedloader that's custom-made for faster reload. Hot-tempered Mitra used to complain that he wanted to shoot his enemies faster with Velkinoth's crazy rate of fire, but its slow reload speed kept getting in the way. One day, when Mitra was complaining as he always had been, Crow suddenly appeared in front of him. - Oh? Old... Kugh! Crow punched Mitra in the stomach, threw something at him, then went away. - Use that and stop complaining. Is this just his unique way of showing he cares?",
        "Steel Wolf's special barrage box. The Steel Wolves were infamous for being too violent and making it impossible to revitalize their enemies. The most infamous Silver Wolf only uses the maximized Wolf Barrage Box that he got from the owner of the Gold Bar.",
        "Rune of the greatest mercenaries, the Steel Wolves. A rune that symbolizes the mercenary Steel Wolves, who were called the demons of the battlefield. Mitra was called the Silver Wolf of the battlefield. Even after he's left the mercenaries, he carries it in remembrance of the battle against the naval officer of the empire.",
        "A bullet necklace that Valance, the chief of Magos Le'Flamme, made especially for Mitra. It looks like an ordinary necklace, but it is actually a bullet with devastating explosive power. With the cutting-edge technology of Magos Le'Flamme, it was made solely to be loaded to Velkinoth. As its ingredients were very rare, making a single bullet took a long time. Valance decided to call it the Song of Madness, a name that fits the madness that Mitra shows in the battlefield."
      ]
    }
  },
  "skins": ["Beachside", "Halcyon Knights", "Rudolph", "Cowboy", "Student Council", "Wolf of Passion", "Mad Wolf"],
  "voice": {
    "actor": {
      "jp": "Majima Junji",
      "kr": "Jun Jong Koo",
      "en": "N/A"
    },
    "lines": {
      "jp": [],
      "kr": [],
      "en": []
    }
  }
}
