{
  "name": "Oddy",
  "title": "Clocksmith of Eternal Life",
  "class": "mechanic",
  "damageType": "magical",
  "position": "Middle",
  "weapon": {
    "uniqueWeapon": {
      "name": "Moonshade Countdown, Tempodiana",
      "effect": [
        "Upon using Time Distortion, All allies' skill cooldown is reduced by extra 2 sec, and ATK is increased by 14% for 10 sec.",
        "Upon using Time Distortion, All allies' skill cooldown is reduced by extra 3 sec, and ATK is increased by 17% for 10 sec.",
        "Upon using Time Distortion, All allies' skill cooldown is reduced by extra 4 sec, and ATK is increased by 21% for 10 sec.",
        "Upon using Time Distortion, All allies' skill cooldown is reduced by extra 5 sec, and ATK is increased by 25% for 10 sec.",
        "Upon using Time Distortion, All allies' skill cooldown is reduced by extra 6 sec, and ATK is increased by 30% for 10 sec.",
        "Upon using Time Distortion, All allies' skill cooldown is reduced by extra 7 sec, and ATK is increased by 35% for 10 sec."
      ]
    },
    "soulWeapon": {
      "advancement0": "Summons the soul of Moonshade Countdown, Tempodiana, increasing Crit DMG of the ally with the Highest ATK by 80% for 15 sec, and reducing Cooldown of all Skills by 1 sec every sec.",
      "advancement1": "For the duration of Skill, increases the target's DEF Penetration by 350.",
      "advancement2": "Changes the number of targets to 3.",
      "activation": "Charges up over 23 sec.",
      "cd": 25,
      "charges": 7
    }
  },
  "skills": [
    {
      "id": 1,
      "skillInfo": [
        {
          "skillNumber": "s1",
          "name": "Time Fracture",
          "description": "Deals ??? M.DMG to enemies in a straight line, and inflicts Petrify for 3 sec.",
          "cooldown": 7,
          "cost": 2
        }
      ],
      "light": "DMG is increased by 40%.",
      "dark": "Cooldown is reduced by 1.5 sec.",
      "books": [
        "DMG is increased by 10%.",
        "DMG is increased by 15%.",
        "Crit Chance is increased by 250."
      ],
      "uniqueTreasure": {
        "name": "Exquisite Orbment",
        "effect": [
          "[Time Fracture] Gains immunity to CC for the skill's duration, and reduces the target's Mana by 400.",
          "[Time Fracture] Gains immunity to CC for the skill's duration, and reduces the target's Mana by 480.",
          "[Time Fracture] Gains immunity to CC for the skill's duration, and reduces the target's Mana by 580.",
          "[Time Fracture] Gains immunity to CC for the skill's duration, and reduces the target's Mana by 700.",
          "[Time Fracture] Gains immunity to CC for the skill's duration, and reduces the target's Mana by 840.",
          "[Time Fracture] Gains immunity to CC for the skill's duration, and reduces the target's Mana by 1000."
        ]
      }
    },
    {
      "id": 2,
      "skillInfo": [
        {
          "skillNumber": "s2",
          "name": "Time Fragments",
          "description": "Attacks random enemies 6 times, dealing a total of ??? M.DMG. With 50% chance, 'Time Fragments' cooldown resets and consumes no mana for the next single activation.",
          "cooldown": 12,
          "cost": 3
        }
      ],
      "light": "Target changes to 2 random enemies.",
      "dark": "While in cooldown, auto-attacks will reduce the cooldown of 'Time Fragments' by 1 sec.",
      "books": [
        "DMG is increased by 10%.",
        "DMG is increased by 15%.",
        "Crit Chance is increased by 250."
      ],
      "uniqueTreasure": {
        "name": "Fragment Collection",
        "effect": [
          "[Time Fragments] Has a 25% chance to reset Cooldown and increases DMG by 20%.",
          "[Time Fragments] Has a 25% chance to reset Cooldown and increases DMG by 24%.",
          "[Time Fragments] Has a 25% chance to reset Cooldown and increases DMG by 29%.",
          "[Time Fragments] Has a 25% chance to reset Cooldown and increases DMG by 35%.",
          "[Time Fragments] Has a 25% chance to reset Cooldown and increases DMG by 42%.",
          "[Time Fragments] Has a 25% chance to reset Cooldown and increases DMG by 50%."
        ]
      }
    },
    {
      "id": 3,
      "skillInfo": [
        {
          "skillNumber": "s3",
          "name": "Time Distortion",
          "description": "Deals ??? M.DMG to all enemies and increases all allies' ATK Spd by 250 for 15 sec. All allies' skill cooldown is reduced by 50%. 'Time Distortion' is not affected by skill cooldown reduction.",
          "cooldown": 35,
          "cost": 4
        }
      ],
      "light": "Increases Mana Cost by 2 and fully recovers Mana for all allies.",
      "dark": "When there are 5 or more enemies, increases DMG by 100%. Hit Enemies take extra 50% DMG for 10 sec.",
      "books": [
        "DMG is increased by 10%.",
        "DMG is increased by 15%.",
        "Crit Chance is increased by 250."
      ],
      "uniqueTreasure": {
        "name": "Threads of Time",
        "effect": [
          "[Time Distortion] DMG is increased by 20% and all allies' negative effects are dispelled.",
          "[Time Distortion] DMG is increased by 24% and all allies' negative effects are dispelled.",
          "[Time Distortion] DMG is increased by 29% and all allies' negative effects are dispelled.",
          "[Time Distortion] DMG is increased by 35% and all allies' negative effects are dispelled.",
          "[Time Distortion] DMG is increased by 42% and all allies' negative effects are dispelled.",
          "[Time Distortion] DMG is increased by 50% and all allies' negative effects are dispelled."
        ]
      }
    },
    {
      "id": 4,
      "skillInfo": [
        {
          "skillNumber": "s4",
          "name": "Clock Magic",
          "description": "Upon using the skill, next 2 attacks deal ??? additional M.DMG with a 30% chance to petrify the target for 3 sec. This effect activates every 1 sec."
        }
      ],
      "light": "Changes the instances of gaining extra DMG from using the skill to 3 times.",
      "dark": "Changes the chance to Petrify to 40%.",
      "books": [
        "DMG is increased by 10%.",
        "DMG is increased by 15%.",
        "Crit Chance is increased by 250."
      ],
      "uniqueTreasure": {
        "name": "Time Manipulating Clockwork",
        "effect": [
          "[Clock Magic] Increases DMG by 50%. Hit enemies take 10% increased M.DMG for 10 sec.",
          "[Clock Magic] Increases DMG by 50%. Hit enemies take 12% increased M.DMG for 10 sec.",
          "[Clock Magic] Increases DMG by 50%. Hit enemies take 14% increased M.DMG for 10 sec.",
          "[Clock Magic] Increases DMG by 50%. Hit enemies take 17% increased M.DMG for 10 sec.",
          "[Clock Magic] Increases DMG by 50%. Hit enemies take 21% increased M.DMG for 10 sec.",
          "[Clock Magic] Increases DMG by 50%. Hit enemies take 25% increased M.DMG for 10 sec."
        ]
      }
    }
  ],
  "light": "ATK, DEF, HP+15% / ATK.Spd +100",
  "dark": "Every 10 sec, any skills on cooldown for 4 random allies have their cooldowns reduced by 1 sec.",
  "background": {
    "profile": {
      "gender": "Male",
      "race": "Redpur (Formerly Human)",
      "age": "???",
      "height": "125 cm",
      "birthday": "10(Month) 4(Day), Month of Friendship",
      "constellation": "Asiphia the Empress",
      "likes": "Clocks",
      "dislikes": "Poachers"
    },
    "story": "He was a mechanic of the royal palace of Orvelia in the distant past. However, he was cursed by the mythical creature Redpur and turned into a Redpur himself. Ever since the transformation, he has been living for so long that he forgot his own age. When he was Human, he invented the first portable watch, but no one in Orvelia saw its true value. To give his invention the recognition it deserved, he set out to the empire. On his way, he was cursed by a group of Redpurs who mistook him for a poacher. The curse also affected his watch, giving it a magical power to control the time flow within a living body. Oddy's own time stopped as well.",
    "itemIntroductions": {
      "weapon": "After Oddy's watch was zapped with the Redpur curse and gained the power to control time over a living being, he used the infinite time he gained to research its possible applications. When he finally created a watch containing the essence of time magic after so many trials, Oddy found out that the secret of Redpur magic originated from moonlight and the shadow it creates. He named his masterpiece 'Tempodiana,' and gave it the nickname 'Moonshade Countdown.'",
      "soul": "Since Tempodiana was based on the magic of Redpur, it had a power that attracted other Redpurs.\nTherefore, it was a daily routine for Oddy to stop the other Redpurs from playing with his watch. It was just like any other day when Oddy tried to stop them from playing with his watch.\n'Why you! That isn't a toy!'\nBut to the Redpurs, Oddy's scolding was part of the fun.\nWhen Oddy was examining his watch after finally retrieving it from the Redpurs by desperately chasing them, Tempodiana started to float into the air with a shining light.\n'What in the-! What is happening!'\nIn front of a dazzled Oddy, a Redpur appeared, all settled within the clockwork of the watch.\n\n'-Koo?'\n\nThe mysterious Redpur turned toward Oddy and smiled, looking happy to see him.\nThe mysterious magic of the Redpur awakened the spirit of the moonlight and shadow within Tempodiana.\nAlthough why it took the form of a Redpur was unknown, regardless, Oddy smiled at it.\n\n'What a discovery! Now, this is going to be worth studying!'",
      "treasures": [
        "A device that adjusts the cracks of time. Time manipulation can create cracks in time, and strong energy gathers inside them. Those incapable of controlling the cracks can get stuck and forced to spend eternity in them. However, Oddy, a veteran time sorcerer, crafted this exquisite orb to tweak the cracks of time and used the energy to maximize the performance of Tempodiana.",
        "Time Fragments that fell from the shadows of the moon. Sometimes, Time Fragments fall from another dimension from the effect of the shadow of the moon that appears when using time magic. The Time Fragments are small, but when gathered, they become a giant Fragment Collection of records, which give ceaseless inspiration to the caster.",
        "Fur of the Red Fur chief hung in the shadow of the moon. It is said that the mythical creature, the Red Fur Chief, uses the shadow of the moon during full moon to go through dimensions and dance. The Red Fur Chief dances until the shadow of the moon disappears, and it is said that his tail sometimes gets stuck in the pathway. The fur of the colorful mythical creature gets stuck in the rift of time and space and stops time temporarily. Oddy uses the fur from the traces of the shadows of the moon to make a skein and uses it effectively for Time Distortion.",
        "A clockwork device that Oddy made to control the flow of time. Oddy spent countless days researching and developing the perfect clockwork, but to no avail. The design was perfect, but he did not have the right catalyst container for his powerful Clock Magic. No metal on earth would endure the heat for a single tick of the clock. When he was agonizing over his plan, he remembered something: there was a space stone that Nyx gave him for display. He ground it to make a clockwork out of it, and the result was perfect."
      ]
    }
  },
  "skins": ["Vampire", "Nutritionist", "Beachside", "Mariachi", "Christmas of a Divine Animal"],
  "voice": {
    "actor": {
      "jp": "Ito Kentaro",
      "kr": "Kwon Oh Seok",
      "en": "N/A"
    },
    "lines": {
      "jp": [],
      "kr": [],
      "en": []
    }
  }
}
