{
    "name": "Laudia",
    "title": "Dancer of the Oasis",
    "class": "assassin",
    "damageType": "magical",
    "position": "Front",
    "weapon": {
        "uniqueWeapon": {
            "name": "Whispering Sands, Arlaq",
            "effect": [
                "[Blessing of Oasis] can be stacked up to max 14 times, and upon auto attack, all skill cooldown is decreased by 4% with 10% chance.",
                "[Blessing of Oasis] can be stacked up to max 15 times, and upon auto attack, all skill cooldown is decreased by 4.8% with 10% chance.",
                "[Blessing of Oasis] can be stacked up to max 16 times, and upon auto attack, all skill cooldown is decreased by 5.8% with 10% chance.",
                "[Blessing of Oasis] can be stacked up to max 17 times, and upon auto attack, all skill cooldown is decreased by 7% with 10% chance.",
                "[Blessing of Oasis] can be stacked up to max 18 times, and upon auto attack, all skill cooldown is decreased by 8.4% with 10% chance.",
                "[Blessing of Oasis] can be stacked up to max 20 times, and upon auto attack, all skill cooldown is decreased by 10% with 10% chance."
            ]
        },
        "soulWeapon": {
            "advancement0": "Summons Whispering Sands, Arlaq for 6 sec, recovering own Mana by 500 every sec, and reducing ATK Spd of enemies within circular range of self by 120. The ATK Spd Reduction effect stacks up to 5 times, and enemies inflicted with 5 stacks take 50% increased M.DMG for 7 sec, and become Petrified.",
            "advancement1": "Increases own ATK by 40% for the duration of the Skill.",
            "advancement2": "For every sec, dispels positiv effects from an enemy within range and deals ??? M.DMG.",
            "activation": "Charges up over 21 sec.",
            "cd": 22,
            "charges": 6
        }
    },
    "skills": [
        {
            "id": 1,
            "skillInfo": [
                {
                    "skillNumber": "s1",
                    "name": "Whisper of Sand",
                    "description": "Attacks target enemy and deals ??? M.DMG to enemies in close range, decreasing enemy block chance by ??? and Crit resistance by 500 for 8 sec. Additionally, attacks and deals ??? M.DMG and stuns them for 3 sec.",
                    "cooldown": 11,
                    "cost": 2
                }
            ],
            "light": "Mana cost is reduced by 1.",
            "dark": "Target takes 25% increased M.DMG for 10 sec.",
            "books": [
                "DMG is increased by 10%.",
                "DMG is increased by 15%.",
                "DMG is increased by 25%."
            ],
            "uniqueTreasure": {
                "name": "Anklet of Oasis",
                "effect": [
                    "[Whisper of Sand] Makes the effect irremovable, and recovers Mana by 140 upon Critical Hit.",
                    "[Whisper of Sand] Makes the effect irremovable, and recovers Mana by 170 upon Critical Hit.",
                    "[Whisper of Sand] Makes the effect irremovable, and recovers Mana by 210 upon Critical Hit.",
                    "[Whisper of Sand] Makes the effect irremovable, and recovers Mana by 250 upon Critical Hit.",
                    "[Whisper of Sand] Makes the effect irremovable, and recovers Mana by 300 upon Critical Hit.",
                    "[Whisper of Sand] Makes the effect irremovable, and recovers Mana by 360 upon Critical Hit."
                ]
            }
        },
        {
            "id": 2,
            "skillInfo": [
                {
                    "skillNumber": "s2",
                    "name": "Enchanting Flow",
                    "description": "Increases own ATK by ??? and Crit DMG by 70% for 10 sec. Then moves a short distance forward, dealing ??? M.DMG to enemies in movement range and Charms them for 5 sec if the skill was used in the Arena. Can activate [Alluring Ambush] once within 5 sec after use.",
                    "cooldown": 20,
                    "cost": 2
                },
                {
                    "skillNumber": "s2_2",
                    "name": "Alluring Ambush",
                    "description": "Attacks target enemy 3 times, dealing a total of ??? M.DMG. Deals extra ??? M.DMG ignoring the target's DEF to Boss enemies and enemies inflicted by Charm.",
                    "cooldown": 0,
                    "cost": 1,
                    "linked": "s2_0"
                }
            ],
            "light": "Gains 2 orbs of mana after movement. Gained Mana is consumed over 10 sec.",
            "dark": "After using [Enchanting Flow], [Alluring Ambush] can be used twice within 10 sec.",
            "books": [
                "ATK boost and DMG is increased by 10%",
                "ATK boost and DMG is increased by 15%",
                "ATK boost and DMG is increased by 25%"
            ],
            "uniqueTreasure": {
                "name": "Halidom of Trovatia",
                "effect": [
                    "[Enchanting Flow] After movement, absorbs DMG equal to 160% of ATK for 3 sec, then creates a shield that is immune to CC, and mana cost of [Alluring Ambush] is decreased by 1.",
                    "[Enchanting Flow] After movement, absorbs DMG equal to 190% of ATK for 3 sec, then creates a shield that is immune to CC, and mana cost of [Alluring Ambush] is decreased by 1.",
                    "[Enchanting Flow] After movement, absorbs DMG equal to 230% of ATK for 3 sec, then creates a shield that is immune to CC, and mana cost of [Alluring Ambush] is decreased by 1.",
                    "[Enchanting Flow] After movement, absorbs DMG equal to 270% of ATK for 3 sec, then creates a shield that is immune to CC, and mana cost of [Alluring Ambush] is decreased by 1.",
                    "[Enchanting Flow] After movement, absorbs DMG equal to 330% of ATK for 3 sec, then creates a shield that is immune to CC, and mana cost of [Alluring Ambush] is decreased by 1.",
                    "[Enchanting Flow] After movement, absorbs DMG equal to 400% of ATK for 3 sec, then creates a shield that is immune to CC, and mana cost of [Alluring Ambush] is decreased by 1."
                ]
            }
        },
        {
            "id": 3,
            "skillInfo": [
                {
                    "skillNumber": "s3",
                    "name": "Dance of the Desert",
                    "description": "Attacks enemies in range 30 times, dealing a total of ??? M.DMG. Additionally throws the 'Blades of Arlaq' at random enemies 30 times, dealing a total of ??? M.DMG. Extra ??? DMG is stacked every time the blade hits the same enemy. [Blinding Acceleration] can be used once during skill activation, and the 'Blades of Arlaq' prioritize targets inflicted by Charm.",
                    "cooldown": 20,
                    "cost": 2
                },
                {
                    "skillNumber": "s3_2",
                    "name": "Blinding Acceleration",
                    "description": "Gains immunity to CC for 3 sec and ATK Spd is increased by 800.",
                    "cooldown": 0,
                    "cost": 1,
                    "linked": "s3_0"
                }
            ],
            "light": "Recovers 30 Mana every hit.",
            "dark": "Mana cost is increased by 1 and DMG is increased by 100%.",
            "books": [
                "DMG is increased by 10%.",
                "DMG is increased by 15%.",
                "DMG is increased by 25%."
            ],
            "uniqueTreasure": {
                "name": "Veil of Charm",
                "effect": [
                    "[Dance of the Desert] Skill cooldown is decreased by 30% and Penetration is increased by 100 during skill activation.",
                    "[Dance of the Desert] Skill cooldown is decreased by 30% and Penetration is increased by 120 during skill activation.",
                    "[Dance of the Desert] Skill cooldown is decreased by 30% and Penetration is increased by 140 during skill activation.",
                    "[Dance of the Desert] Skill cooldown is decreased by 30% and Penetration is increased by 170 during skill activation.",
                    "[Dance of the Desert] Skill cooldown is decreased by 30% and Penetration is increased by 210 during skill activation.",
                    "[Dance of the Desert] Skill cooldown is decreased by 30% and Penetration is increased by 250 during skill activation."
                ]
            }
        },
        {
            "id": 4,
            "skillInfo": [
                {
                    "skillNumber": "s4",
                    "name": "Blessing of Oasis",
                    "description": "Decreases CC duration inflicted on self by ???%. Upon using a skill, gains [Blessing of Oasis] for 20 sec, increasing own Penetration by 30 and DEF by ???. [Blessing of Oasis] can be stacked up to max 10 times and cannot be dispelled."
                }
            ],
            "light": "Gains 2 stack of [Blessing of Oasis].",
            "dark": "Per each stack, takes 2% less DMG from enemies other than heroes",
            "books": [
                "DEF Penetration and DEF boost are increased by 10%.",
                "DEF Penetration and DEF boost are increased by 15%.",
                "DEF Penetration and DEF boost are increased by 25%."
            ],
            "uniqueTreasure": {
                "name": "Earrings of God Dragon",
                "effect": [
                    "[Blessing of Oasis] Increases DEF boost by 50%. Upon gaining Blessing of Oasis, increases ATK Spd by 100 for 5 sec.",
                    "[Blessing of Oasis] Increases DEF boost by 50%. Upon gaining Blessing of Oasis, increases ATK Spd by 120 for 5 sec.",
                    "[Blessing of Oasis] Increases DEF boost by 50%. Upon gaining Blessing of Oasis, increases ATK Spd by 140 for 5 sec.",
                    "[Blessing of Oasis] Increases DEF boost by 50%. Upon gaining Blessing of Oasis, increases ATK Spd by 170 for 5 sec.",
                    "[Blessing of Oasis] Increases DEF boost by 50%. Upon gaining Blessing of Oasis, increases ATK Spd by 210 for 5 sec.",
                    "[Blessing of Oasis] Increases DEF boost by 50%. Upon gaining Blessing of Oasis, increases ATK Spd by 250 for 5 sec."
                ]
            }
        }
    ],
    "light": "ATK, DEF, HP+15% / ATK.Spd +100",
    "dark": "At the start of each battle, gains immunity to CC for 7 sec, and ACC, CC ACC are increased by 300 for 10 sec.",
    "background": {
        "profile": {
            "gender": "Female",
            "race": "Human",
            "age": "22 Years",
            "height": "169 cm",
            "birthday": "10(Month) 11(Day), Month of Friendship",
            "constellation": "Asiphia the Empress",
            "likes": "Laias, Lilia, people in the desert",
            "dislikes": "Watching people suffer"
        },
        "story": "Trovatias are a nomadic tribe of Aegina Desert who inherited the tradition and religion of the ancient desert kingdom. Laudia is the daughter of the tribe leader and serves the Priestess of Water, Laias. She also looks after the tribe on behalf of her old father. When she prayed for help, God Dragon Laias and her sister Lilia woke up from their long sleep and led her and her tribe into the shrine, protecting them. Ever since, Laudia has been defeating demons in the desert with Zafir, the leader of the Mauhata tribe of Desert Warriors.",
        "itemIntroductions": {
            "weapon": "A rare treasure that is the manifestation of passion burning like a flame in the desert. A pair of these beautiful weapons is known to have been stored in the ancient God King's repositorium. When swung, they beautifully sound like the wind with the scent of a breeze. It is a sweet but lethal temptation, just like a mirage in the desert...",
            "soul": "Arlaq was supposed to carry the power of a Soul Weapon through Cain.\nWhen Laudia was first bestowed with the awakened Arlaq as a Soul Weapon. she recognized a fragrance which is feint, yet existent. However, the fragrance had disappeared when she attempted to get a whiff of its smell after going through numerous incidents.\nAfter a few trial-and-errors, Laudia realized that Arlaq must be fully awakened in order to invigorate that fragrance. At the end of severe training, Laudia was finally rewarded.\nLaudia was dancing as if she was being guided by a sandstorm when a captivating fragrance pleasantly entered her system from both her hands. After the dances, Laudia was struck with enlightenment that she had just achieved the zenith of blade arts.\nIt marked the birth of the greatest Desert Dancer of all ages. Arlaq accepted Laudia as one worthy of its power, and granted her its maximum power.\nArlaq's fragrance is no longer just a simple scent with captivating odor. Now its ever-alluring fragrance is capable of completely bewitching its target, shaking the willpower of the target at very core.\n\nThis irresistible fragrance, when blended with Laudia's dance, can charm both sight and smell of living beings.",
            "treasures": [
                "An anklet of the Trovatia tribe that's used for the dance to summon the God Dragon in the Shrine of Flow. Only one individual chosen by the great desert can wear it after being tested by the sandstorm. Laudia, the leader of Trovatia, is its current owner. The anklet does not reveal its true powers until it is soaked for days in the holy oasis that only shows itself to the chosen one.",
                "A chest containing the artifacts needed for worship rituals for the Dragon of Water. Some ornaments on it are crafted with 'Azure Lapis Lazuli,' a gem that represents complete fullness. It is the dearest thing that Laudia's father treasures, and is only given to those who have the ability to lead the entire Trovatia tribe.",
                "A legendary Veil only given to the best dancer in the continent. Performing a dance with it on can mesmerize those who are watching. Laudia used the veil to mesmerize enemies with her seductive dance and achieved everything she wanted.",
                "Earrings that the God Dragon Laias bestowed upon Laudia. On the last day Laudia performed the ritual for the God Dragon at the Shrine of Flow, Laias finally opened her eyes. Then, some orbs of water appeared around Laudia, releasing blue, blinding light. The orbs landed upon the hands of Laudia and became a beautiful pair of earrings. It was a gift blessed by the oasis, the token of gratitude that Laias gave to Laudia in recognition of the painstaking effort Laudia made to bring her back."
            ]
        }
    },
    "skins": ["Beachside", "Maid", "Another Busy Day"],
    "voice": {
        "actor": {
            "jp": "N/A",
            "kr": "N/A",
            "en": "N/A"
        },
        "lines": {
            "jp": [],
            "kr": [],
            "en": []
        }
    }
}