{
    "name": "Maria",
    "title": "Fallen Witch",
    "class": "wizard",
    "damageType": "magical",
    "position": "Middle",
    "weapon": {
        "uniqueWeapon": {
            "name": "Lea's Messenger, Cocytus",
            "effect": [
                "Upon a Critical Hit, reduces Heal Rate of the target by 50% and increases own Crit DMG by 2% for 10 sec. Crit DMG increase effect can be stacked up to max 20 times.",
                "Upon a Critical Hit, reduces Heal Rate of the target by 50% and increases own Crit DMG by 2.4% for 10 sec. Crit DMG increase effect can be stacked up to max 20 times.",
                "Upon a Critical Hit, reduces Heal Rate of the target by 50% and increases own Crit DMG by 2.9% for 10 sec. Crit DMG increase effect can be stacked up to max 20 times.",
                "Upon a Critical Hit, reduces Heal Rate of the target by 50% and increases own Crit DMG by 3.5% for 10 sec. Crit DMG increase effect can be stacked up to max 20 times.",
                "Upon a Critical Hit, reduces Heal Rate of the target by 50% and increases own Crit DMG by 4.2% for 10 sec. Crit DMG increase effect can be stacked up to max 20 times.",
                "Upon a Critical Hit, reduces Heal Rate of the target by 50% and increases own Crit DMG by 5% for 10 sec. Crit DMG increase effect can be stacked up to max 20 times."
            ]
        },
        "soulWeapon": {
            "advancement0": "Summons the Soul of Lea's Messenger, Cocytus, dealing xxx M.DMG to frontral enemies in a straight line, knocking them back far away for 3 sec, and inflicting 'Raven Catastrophe' for 10 sec. Targets inflicted with 'Raven Catastrophe' have their ATK reduced by 40%.",
            "advancement1": "Reduces Heal Rate of the target inflicted with Raven Catastrophe by 50%.",
            "advancement2": "Reduces Skill Activation Requirements to 3 times.",
            "activation": "Charges up upon using Skills 4 times.",
            "cd": 15,
            "charges": 8
        }
    },
    "skills": [
        {
            "id": 1,
            "skillInfo": [
                {
                    "skillNumber": "s1",
                    "name": "Raven Storm",
                    "description": "Deals ??? M.DMG to enemies in frontal range and pushes them back. Reduces M.DEF of hit enemies by 20% for 15 sec. Deals additional ??? M.DMG to Non-Hero enemies.",
                    "cooldown": 9,
                    "cost": 3
                }
            ],
            "light": "DMG is increased by 40%.",
            "dark": "Has a 20% chance of inflicting a 3 sec Shackle.",
            "books": [
                "DMG is increased by 10%.",
                "DMG is increased by 15%.",
                "Reduces ATK Spd by 25% for the duration of skill."
            ],
            "uniqueTreasure": {
                "name": "Turbulent Dance",
                "effect": [
                    "[Raven Storm] Gains immunity to CC for the skill's duration, and reduces the target's Mana by 100.",
                    "[Raven Storm] Gains immunity to CC for the skill's duration, and reduces the target's Mana by 120.",
                    "[Raven Storm] Gains immunity to CC for the skill's duration, and reduces the target's Mana by 140.",
                    "[Raven Storm] Gains immunity to CC for the skill's duration, and reduces the target's Mana by 170.",
                    "[Raven Storm] Gains immunity to CC for the skill's duration, and reduces the target's Mana by 210.",
                    "[Raven Storm] Gains immunity to CC for the skill's duration, and reduces the target's Mana by 250."
                ]
            }
        },
        {
            "id": 2,
            "skillInfo": [
                {
                    "skillNumber": "s2",
                    "name": "Claw of Restriction",
                    "description": "Deals ??? M.DMG to 2 enemies, and shackles them for 6 sec. Hit enemies will take ??? M.DMG over 6 sec.",
                    "cooldown": 13,
                    "cost": 2
                }
            ],
            "light": "Mana cost is increased by 1 and the skill targets 3 enemies.",
            "dark": "Shackle duration is increased by 1.5 sec.",
            "books": [
                "DMG is increased by 10%.",
                "DMG is increased by 15%.",
                "Enemy takes increased M.DMG by 30% for the duration of skill."
            ],
            "uniqueTreasure": {
                "name": "Spirit's Sabaton",
                "effect": [
                    "[Claw of Restriction] Increases DMG by 50% and increases M.Weakness of the affected enemy by 10% for 10 sec.",
                    "[Claw of Restriction] Increases DMG by 50% and increases M.Weakness of the affected enemy by 12% for 10 sec.",
                    "[Claw of Restriction] Increases DMG by 50% and increases M.Weakness of the affected enemy by 14% for 10 sec.",
                    "[Claw of Restriction] Increases DMG by 50% and increases M.Weakness of the affected enemy by 17% for 10 sec.",
                    "[Claw of Restriction] Increases DMG by 50% and increases M.Weakness of the affected enemy by 21% for 10 sec.",
                    "[Claw of Restriction] Increases DMG by 50% and increases M.Weakness of the affected enemy by 25% for 10 sec."
                ]
            }
        },
        {
            "id": 3,
            "skillInfo": [
                {
                    "skillNumber": "s3",
                    "name": "Area of Darkness",
                    "description": "Draws in nearby enemies towards the center 5 times and deals a total of ??? M.DMG. The last attack stuns enemies for 3 sec. Deals additional ??? M.DMG to Non-Hero enemies.",
                    "cooldown": 25,
                    "cost": 4
                }
            ],
            "light": "Target takes 25% increased M.DMG for 10 sec.",
            "dark": "Mana cost is reduced by 1.",
            "books": [
                "DMG is increased by 10%.",
                "DMG is increased by 15%.",
                "DMG is increased by 25%."
            ],
            "uniqueTreasure": {
                "name": "Pendant of Darkness",
                "effect": [
                    "[Area of Darkness] DMG is increased by 20%, and the last attack reduces target's P.DEF and M.DEF by 30% for 7 sec.",
                    "[Area of Darkness] DMG is increased by 24%, and the last attack reduces target's P.DEF and M.DEF by 30% for 7 sec.",
                    "[Area of Darkness] DMG is increased by 29%, and the last attack reduces target's P.DEF and M.DEF by 30% for 7 sec.",
                    "[Area of Darkness] DMG is increased by 35%, and the last attack reduces target's P.DEF and M.DEF by 30% for 7 sec.",
                    "[Area of Darkness] DMG is increased by 42%, and the last attack reduces target's P.DEF and M.DEF by 30% for 7 sec.",
                    "[Area of Darkness] DMG is increased by 50%, and the last attack reduces target's P.DEF and M.DEF by 30% for 7 sec."
                ]
            }
        },
        {
            "id": 4,
            "skillInfo": [
                {
                    "skillNumber": "s4",
                    "name": "Black Wind",
                    "description": "Enemies damaged by Maria has their ATK reduced by ??? for 10 sec."
                }
            ],
            "light": "ATK reduction is increased by 40%.",
            "dark": "Reduces enemy M. Crit Resistance by 25% for 10 sec.",
            "books": [
                "ATK reduction rate is increased by 10%.",
                "ATK reduction rate is increased by 15%.",
                "Enemy Crit Chance is reduced by 25% for the duration of skill."
            ],
            "uniqueTreasure": {
                "name": "Abyssal Letter",
                "effect": [
                    "[Black Wind] Every 10 sec, attacks enemies affected by Black Wind, dealing M.DMG equal to 200% of ATK. Increases own ATK by 2% for 20 sec per hit enemy. This effect can be stacked up to max 10 times.",
                    "[Black Wind] Every 10 sec, attacks enemies affected by Black Wind, dealing M.DMG equal to 200% of ATK. Increases own ATK by 2.4% for 20 sec per hit enemy. This effect can be stacked up to max 10 times.",
                    "[Black Wind] Every 10 sec, attacks enemies affected by Black Wind, dealing M.DMG equal to 200% of ATK. Increases own ATK by 2.9% for 20 sec per hit enemy. This effect can be stacked up to max 10 times.",
                    "[Black Wind] Every 10 sec, attacks enemies affected by Black Wind, dealing M.DMG equal to 200% of ATK. Increases own ATK by 3.5% for 20 sec per hit enemy. This effect can be stacked up to max 10 times.",
                    "[Black Wind] Every 10 sec, attacks enemies affected by Black Wind, dealing M.DMG equal to 200% of ATK. Increases own ATK by 4.2% for 20 sec per hit enemy. This effect can be stacked up to max 10 times.",
                    "[Black Wind] Every 10 sec, attacks enemies affected by Black Wind, dealing M.DMG equal to 200% of ATK. Increases own ATK by 5% for 20 sec per hit enemy. This effect can be stacked up to max 10 times."
                ]
            }
        }
    ],
    "light": "ATK, DEF, HP+15% / Crit Chance +100",
    "dark": "Upon a Crit Hit, target's CC resistance is reduced by 250 for 10 sec, and all Skill Cooldown, excluding the skill in use, is reduced by 2% each.",
    "background": {
        "profile": {
            "gender": "missing",
            "race": "missing",
            "age": "missing",
            "height": "missing",
            "birthday": "missing",
            "constellation": "missing",
            "likes": "Corrupting the believers of Lua",
            "dislikes": "Lua and her church"
        },
        "story": "Although she was a Holy Maiden of Lua in the past, she eventually fell into corruption. Now, this cynical, crow-commanding witch curses her former Goddess from the darkness. There was a time when she was a friend of Kyle and a heroine of the people. However, when Kyle disappeared, she hid herself from the world as well. She eventually came back as a fallen witch, threatening mankind as the spearhead of the Demon Army. These days, however, she appears to be plotting some scheme, not as a Demon commander, but completely on her own.",
        "itemIntroductions": {
            "weapon": "A mysterious raven that can travel across dimensions. Its intelligence and shrewdness are certainly not those of a mere bird. In truth, it is a monster filled with dark energy, much like Demons. Indeed, it is said that this beast is as powerful as a high-ranking Demon. Some claim that it occasionally flies over fields of battle, speaking in human languages. Much of this creature's identity is still shrouded in mystery.",
            "treasures": [
                "A magic mirror that summons Tempest Elemental Aerial. This magical mirror is made with an obsidian stone from Pandemonium, and Tempest Elemental Aerial sleeps inside it. Whenever Raven Storm is used, Aerial awakes and amplifies its effect with its violent dance.",
                "A claw armor that Maria gifted to Lea's messenger. The claw armor that is made with fancy gold contains a binding curse that never lets go of any enemy that it grabs. Enemies bound by the messenger's Sabaton will become defenseless against magic attacks and will receive great damage.",
                "Ashes of a grey messenger that announces the end. These are the ashes of the raven that flew into the Church of Lua right before the Republic of Gray collapsed a hundred years ago. Everyone ignored the ominous messenger, and only Priestess Maria cared for it until its last day. Even after its death, it has helped Maria expand her area of darkness by pouring its dark energy on her.",
                "A letter of notice issued from Lea's Messenger. This letter created by the Essence of Darkness contains a warning and the terms of the contract that Maria made with the darkness."
            ]
        }
    },
    "skins": [],
    "voice": {
        "actor": {
            "jp": "N/A",
            "kr": "N/A",
            "en": "N/A"
        },
        "lines": {
            "jp": [],
            "kr": [],
            "en": []
        }
    }
}