{
  "name": "Yanne",
  "title": "Dragon Slayer",
  "class": "archer",
  "damageType": "physical",
  "position": "Back",
  "weapon": {
    "uniqueWeapon": {
      "name": "Dragonbane, Svelta",
      "effect": [
        "Upon a Crit Hit, there is a 10% chance of dealing 200% of ATK as P.DMG, and recovering 5% of Mana. If the target is a Dragon, inflicts Stun for 1.5 sec.",
        "Upon a Crit Hit, there is a 12% chance of dealing 240% of ATK as P.DMG, and recovering 5% of Mana. If the target is a Dragon, inflicts Stun for 1.5 sec.",
        "Upon a Crit Hit, there is a 14% chance of dealing 290% of ATK as P.DMG, and recovering 5% of Mana. If the target is a Dragon, inflicts Stun for 1.5 sec.",
        "Upon a Crit Hit, there is a 17% chance of dealing 350% of ATK as P.DMG, and recovering 5% of Mana. If the target is a Dragon, inflicts Stun for 1.5 sec.",
        "Upon a Crit Hit, there is a 21% chance of dealing 420% of ATK as P.DMG, and recovering 5% of Mana. If the target is a Dragon, inflicts Stun for 1.5 sec.",
        "Upon a Crit Hit, there is a 25% chance of dealing 500% of ATK as P.DMG, and recovering 5% of Mana. If the target is a Dragon, inflicts Stun for 1.5 sec."
      ]
    },
    "soulWeapon": {
      "advancement0": "Summons the soul of Dragonbane, Svelta for 10 sec, increasing all allies' ATK Spd by 300 and recovering own Mana by 400 every sec. For the duration of Skill, increases All DMG that all enemies take by 20%. If the target enemy is a Dragon, the DMG Boost effect changes to 60%.",
      "advancement1": "The duration of the effect increases by 10 sec.",
      "advancement2": "For the duration of Skill, increases own ATK by 50%.",
      "activation": "Charges up over 18 sec.",
      "cd": 25,
      "charges": 7
    }
  },
  "skills": [
    {
      "id": 1,
      "skillInfo": [
        {
          "skillNumber": "s1",
          "name": "Focus Shot!",
          "description": "Taking up a stance, focuses for a while and deals ??? P.DMG to enemies in a straight line. If the target is a dragon, inflicts Stun for 3 sec. The longer she focuses, DMG and Stun duration are increased by 100%.",
          "cooldown": 9,
          "cost": 2
        }
      ],
      "light": "DMG is increased by 40%.",
      "dark": "Target takes 25% additional P.DMG for 10 sec.",
      "books": [
        "DMG is increased by 10%.",
        "DMG is increased by 15%.",
        "Crit DMG is increased by 50%."
      ],
      "uniqueTreasure": {
        "name": "Talisman of Concentration",
        "effect": [
          "[Focus Shot!] Increases ATK Spd by 800 for the skill's duration, and increases P.DMG target receives by 10% for 10 sec.",
          "[Focus Shot!] Increases ATK Spd by 800 for the skill's duration, and increases P.DMG target receives by 12% for 10 sec.",
          "[Focus Shot!] Increases ATK Spd by 800 for the skill's duration, and increases P.DMG target receives by 14% for 10 sec.",
          "[Focus Shot!] Increases ATK Spd by 800 for the skill's duration, and increases P.DMG target receives by 17% for 10 sec.",
          "[Focus Shot!] Increases ATK Spd by 800 for the skill's duration, and increases P.DMG target receives by 21% for 10 sec.",
          "[Focus Shot!] Increases ATK Spd by 800 for the skill's duration, and increases P.DMG target receives by 25% for 10 sec."
        ]
      }
    },
    {
      "id": 2,
      "skillInfo": [
        {
          "skillNumber": "s2",
          "name": "Wipeout!",
          "description": "Deals ??? P.DMG to target enemy and other enemies in range. If the target is a Dragon, deals ??? extra DMG that ignores DEF.",
          "cooldown": 10,
          "cost": 3
        }
      ],
      "light": "When there is 1 enemy, DMG is boosted by 100%.",
      "dark": "Enemies hit are stunned for 2 sec.",
      "books": [
        "DMG is increased by 10%.",
        "DMG is increased by 15%.",
        "Crit DMG is increased by 50%."
      ],
      "uniqueTreasure": {
        "name": "Giant Arrow of Sudden Death",
        "effect": [
          "[Wipeout!] Increases DMG by 20% and reduces Cooldown by 12% upon a Crit Hit.",
          "[Wipeout!] Increases DMG by 24% and reduces Cooldown by 12% upon a Crit Hit",
          "[Wipeout!] Increases DMG by 29% and reduces Cooldown by 12% upon a Crit Hit",
          "[Wipeout!] Increases DMG by 35% and reduces Cooldown by 12% upon a Crit Hit",
          "[Wipeout!] Increases DMG by 42% and reduces Cooldown by 12% upon a Crit Hit",
          "[Wipeout!] Increases DMG by 50% and reduces Cooldown by 12% upon a Crit Hit"
        ]
      }
    },
    {
      "id": 3,
      "skillInfo": [
        {
          "skillNumber": "s3",
          "name": "No Holding Back!",
          "description": "Dispels all negative effects from self. For 30 sec, ATK is increased by ??? and Penetration by 500. For the duration of skill, normal attacks consume 3% mana to deal DMG to all enemies in a straight line and deals ??? additional P.DMG that ignores DEF to Dragons. This effect is irremovable.",
          "cooldown": 25,
          "cost": 4
        }
      ],
      "light": "ATK Spd is boosted by 250 for the duration.",
      "dark": "For the duration, all DMG taken is reduced by 25%.",
      "books": [
        "ATK boost is increased by 10%.",
        "ATK boost is increased by 15%.",
        "ATK boost is increased by 25%."
      ],
      "uniqueTreasure": {
        "name": "Dragon Steak",
        "effect": [
          "[No Holding Back!] Reduces Mana Cost by 1 and increases DMG to Dragons by 10% for the skill's duration.",
          "[No Holding Back!] Reduces Mana Cost by 1 and increases DMG to Dragons by 12% for the skill's duration.",
          "[No Holding Back!] Reduces Mana Cost by 1 and increases DMG to Dragons by 14% for the skill's duration.",
          "[No Holding Back!] Reduces Mana Cost by 1 and increases DMG to Dragons by 17% for the skill's duration.",
          "[No Holding Back!] Reduces Mana Cost by 1 and increases DMG to Dragons by 21% for the skill's duration.",
          "[No Holding Back!] Reduces Mana Cost by 1 and increases DMG to Dragons by 25% for the skill's duration."
        ]
      }
    },
    {
      "id": 4,
      "skillInfo": [
        {
          "skillNumber": "s4",
          "name": "Dragon Slayer",
          "description": "ATK is increased by ??? , and Max HP is increased by 30%. Also, DMG dealt to Dragons is increased by 100%."
        }
      ],
      "light": "Reduces DMG that all allies take from Dragons by 20%.",
      "dark": "Changes self's DMG Boost against Dragons to 130%.",
      "books": [
        "ATK boost is increased by 10%.",
        "ATK boost is increased by 15%.",
        "ATK boost is increased by 25%."
      ],
      "uniqueTreasure": {
        "name": "Blazing Heart of Giant",
        "effect": [
          "[Dragon Slayer] Increases ATK boost by 50%. All allies deal 4% increased DMG to Dragons.",
          "[Dragon Slayer] Increases ATK boost by 50%. All allies deal 4.8% increased DMG to Dragons.",
          "[Dragon Slayer] Increases ATK boost by 50%. All allies deal 5.8% increased DMG to Dragons.",
          "[Dragon Slayer] Increases ATK boost by 50%. All allies deal 7% increased DMG to Dragons.",
          "[Dragon Slayer] Increases ATK boost by 50%. All allies deal 8.4% increased DMG to Dragons.",
          "[Dragon Slayer] Increases ATK boost by 50%. All allies deal 10% increased DMG to Dragons."
        ]
      }
    }
  ],
  "light": "ATK, DEF, HP+15% / Crit DMG +20%",
  "dark": "Auto-attacks ignore enemy Block effects.",
  "background": {
    "profile": {
      "gender": "Female",
      "race": "Barbarian",
      "age": "21 Years",
      "height": "185 cm",
      "birthday": "6(Month) 30(Day), Month of Love",
      "constellation": "Mira the Minstrel",
      "likes": "Delicious dishes, cooking, monster hunting",
      "dislikes": "Monsters that cannot be defeated physically"
    },
    "story": "A Barbarian warrior who specializes in dealing with monsters that threaten people. Thanks to a unique physical trait, her muscular strength is several times stronger than that of a normal Barbarian warrior. She wields a greatbow larger than her own body with such ease that people call her a walking siege weapon. While she is a kindhearted woman who enjoys helping others, once engaged in a combat, her Barbarian aggressiveness begins to surface. She once slayed a mad dragon named Svelta, a feat that earned her the nickname Dragon Slayer.",
    "itemIntroductions": {
      "weapon": "An enchanted weapon made from the bones, tendons, and pieces of hide the Mad Dragon Svelta. Too heavy for a normal human to even lift, let alone draw, this monstrous greatbow is a combination of the siege weapon technologies from the Dark Elves and Dwarves. Only those with incredible muscular strength such as Yanne can hope to handle this ridiculous bow. The Mad Dragon's soul still remains in this bow. Her ferocious energy rides on every arrow it fires, granting it the power to shatter through even the mightiest of walls.",
      "soul": "Even in death, Mad Dragon Svelta's soul did not fully rest in peace.\nHis rage and resentment lingered in Yanne's great bow, and let out a cry of destruction. However, after spending years as Yanne's weapon, Svelta's soul acquired the ability to control its anger which had been slowly eating away its mind.\n\nPerhaps it was because Svelta's soul had touches with Demone and Mad Dragons that Yanne had hunted for years.\nGradually, it learned the ability to understand the nature of those who had to face the Mad Dragon's anger.\nNot all the creations of the world deserved anger.\nDemons, Mad Dragons, evil creatures, and the corrupted beings were the ones that had to be destroyed.\n\nSvelta's soul attained serenity, and it communed with Yanne's soul.\nNow the soul of the Mad Dragon shares the same path with the dragon slayer of the dragon heritage.",
      "treasures": [
        "Bracelet that Yanne received from the townspeople when she slayed Svelta. Made from Red Dragon leather, it gathers the yang energy inside the wearer to allow them to achieve a high level of concentration. When Yanne takes aim, it helps her successfully fire a single, killing shot.",
        "An arrow made from Mad Dragon Svelta's spine, who spews out powerful magic cannons. It's Yanne's loot. The arrowhead has the Mad Dragon's burning red eye. It's still imbued with its madness, always ready to burn the enemy.",
        "T-bone steak from which you can taste a dragon's sirloin and tenderloin at the same time. The taste is truly wonderful. The dragon's holy energy enters the body, and increases Yanne's battle stamina to the max.",
        "When Yanne was requested to kill off the giants, she met the Fire Giant, the leader of them all, and fought three days and three nights to defeat it. The heart of the Fire Giant was pierced, but strong flames were still blazing in it. There, she found a fist-sized stone. When she took the stone out, the flames died out. Since then, Yanne's arrows have been imbued with flame energy."
      ]
    }
  },
  "skins": ["March Hare", "Rudolph", "Native American", "Delinquent", "Beachside", "Beachside 2"],
  "voice": {
    "actor": {
      "jp": "Fujita Masayo",
      "kr": "Kang Seon Yeong",
      "en": "N/A"
    },
    "lines": {
      "jp": [],
      "kr": [],
      "en": []
    }
  }
}
