{
  "name": "Tanya",
  "title": "The Silencing Blade",
  "class": "assassin",
  "damageType": "physical",
  "position": "Front",
  "weapon": {
    "uniqueWeapon": {
      "name": "Demon of the Calm, Caethasis",
      "effect": [
        "At the beginning of each battle, becomes Stealth for 10 sec and dodges all attacks for 2 sec. Every time Tanya becomes Stealth, her Crit DMG increases by 30% for 10 sec.",
        "At the beginning of each battle, becomes Stealth for 10 sec and dodges all attacks for 2.4 sec. Every time Tanya becomes Stealth, her Crit DMG increases by 36% for 10 sec.",
        "At the beginning of each battle, becomes Stealth for 10 sec and dodges all attacks for 2.9 sec. Every time Tanya becomes Stealth, her Crit DMG increases by 43% for 10 sec.",
        "At the beginning of each battle, becomes Stealth for 10 sec and dodges all attacks for 3.5 sec. Every time Tanya becomes Stealth, her Crit DMG increases by 52% for 10 sec.",
        "At the beginning of each battle, becomes Stealth for 10 sec and dodges all attacks for 4.2 sec. Every time Tanya becomes Stealth, her Crit DMG increases by 62% for 10 sec.",
        "At the beginning of each battle, becomes Stealth for 10 sec and dodges all attacks for 5 sec. Every time Tanya becomes Stealth, her Crit DMG increases by 75% for 10 sec."
      ]
    },
    "soulWeapon": {
      "advancement0": "Summons the soul of Demon of the Calm, Caethasis, increasing own ATK by 50% for 10 sec. Afterward, hits the enemy with the lowest P.DEF 4 times every 3 sec, dealing a total of ??? P.DMG.\nIf the target's HP is 50% or above, this hit reduces target's P.DEF by 5% for 5 sec.\nIf the target's HP is below 50%, this hit increases its DMG by 2 times and will be a Critical Hit.\nThe P.DEF Reduction effect can be stacked up to max 10 times.",
      "advancement1": "Changes Skill Activation Requirements to 14 sec.",
      "advancement2": "Changes the P.DEF Reduction effect to 7%. The DMG Boost effect applied to enemies below 50% HP applies as 3.6 times.",
      "activation": "Charges up over 18 sec.",
      "cd": 22,
      "charges": 6
    }
  },
  "skills": [
    {
      "id": 1,
      "skillInfo": [
        {
          "skillNumber": "s1",
          "name": "Target Sighted",
          "description": "Increases P.DMG the enemy with the lowest P.DEF takes by 30% for 10 sec, and moves behind the target, dealing ??? P.DMG and knocking it down for 2 sec. If used during Stealth, 150% increased Crit DMG applies, and Stealth is dispelled. If Skill is used while not in Stealth, becomes Stealth for 10 sec.",
          "cooldown": 8,
          "cost": 2
        }
      ],
      "light": "Reduces the target's Heal Rate by 30%.",
      "dark": "For 10 sec, target's P.Crit resistance is reduced by 250.",
      "books": [
        "DMG is increased by 10%.",
        "DMG is increased by 15%.",
        "DMG is increased by 25%."
      ],
      "uniqueTreasure": {
        "name": "Copied Codex of Stealth",
        "effect": [
          "[Target Sighted] Increases DMG by 50%, and after use, recovers Mana by 400.",
          "[Target Sighted] Increases DMG by 50%, and after use, recovers Mana by 480.",
          "[Target Sighted] Increases DMG by 50%, and after use, recovers Mana by 580.",
          "[Target Sighted] Increases DMG by 50%, and after use, recovers Mana by 700.",
          "[Target Sighted] Increases DMG by 50%, and after use, recovers Mana by 840.",
          "[Target Sighted] Increases DMG by 50%, and after use, recovers Mana by 1000."
        ]
      }
    },
    {
      "id": 2,
      "skillInfo": [
        {
          "skillNumber": "s2",
          "name": "Blade Tornado",
          "description": "Attacks nearby enemies 3 times and deals a total of ??? P.DMG, inflicting 1 stack of Bleed per each hit. If used in a Stealth state, target's heal rate is reduced by 70%, and Stealth is dispelled. If Skill is used while not in Stealth, becomes Stealth for 10 sec.",
          "cooldown": 14,
          "cost": 2
        }
      ],
      "light": "If there is 1 enemy, DMG is increased by 100%.",
      "dark": "Recovers 200 mana upon a Crit hit.",
      "books": [
        "DMG is increased by 10%.",
        "DMG is increased by 15%.",
        "DMG is increased by 25%."
      ],
      "uniqueTreasure": {
        "name": "Laughing Mask All-round Belt",
        "effect": [
          "[Blade Tornado] Increases DMG by 20% and reduces Cooldown by 8% upon a Crit Hit.",
          "[Blade Tornado] Increases DMG by 24% and reduces Cooldown by 8% upon a Crit Hit.",
          "[Blade Tornado] Increases DMG by 29% and reduces Cooldown by 8% upon a Crit Hit.",
          "[Blade Tornado] Increases DMG by 35% and reduces Cooldown by 8% upon a Crit Hit.",
          "[Blade Tornado] Increases DMG by 42% and reduces Cooldown by 8% upon a Crit Hit.",
          "[Blade Tornado] Increases DMG by 50% and reduces Cooldown by 8% upon a Crit Hit."
        ]
      }
    },
    {
      "id": 3,
      "skillInfo": [
        {
          "skillNumber": "s3",
          "name": "Whisper of Death",
          "description": "Attacks a random enemy 6 times and deals a total of ??? P.DMG, then deals an extra that deals ??? P.DMG. If used during Stealth, dispels positive effects from the Target, and Stealth is dispelled. If Skill is used while not in Stealth, becomes Stealth for 10 sec.",
          "cooldown": 18,
          "cost": 3
        }
      ],
      "light": "Mana cost is increased by 1 orb but DMG is boosted by 100%.",
      "dark": "Cooldown is reduced by 5 sec.",
      "books": [
        "DMG is increased by 10%.",
        "DMG is increased by 15%.",
        "DMG is increased by 25%."
      ],
      "uniqueTreasure": {
        "name": "Dagger of Silence",
        "effect": [
          "[Whisper of Death] DMG is increased by 20% and upon use, immediately gains Stealth. If used in Stealth mode, ATK is increased by 20% for 10 sec.",
          "[Whisper of Death] DMG is increased by 24% and upon use, immediately gains Stealth. If used in Stealth mode, ATK is increased by 20% for 10 sec.",
          "[Whisper of Death] DMG is increased by 29% and upon use, immediately gains Stealth. If used in Stealth mode, ATK is increased by 20% for 10 sec.",
          "[Whisper of Death] DMG is increased by 35% and upon use, immediately gains Stealth. If used in Stealth mode, ATK is increased by 20% for 10 sec.",
          "[Whisper of Death] DMG is increased by 42% and upon use, immediately gains Stealth. If used in Stealth mode, ATK is increased by 20% for 10 sec.",
          "[Whisper of Death] DMG is increased by 50% and upon use, immediately gains Stealth. If used in Stealth mode, ATK is increased by 20% for 10 sec."
        ]
      }
    },
    {
      "id": 4,
      "skillInfo": [
        {
          "skillNumber": "s4",
          "name": "Silent Ambush",
          "description": "Increases Crit Chance by 150 and Dodge by 150 during Stealth. Upon a Critical Skill Hit, deals ??? additional P.DMG to the enemy and inflicts Silence for 1.5 sec. If the target is not a Hero, deals ??? additional P.DMG that ignores DEF and reduces the target's ATK Spd by 200 for 10 sec."
        }
      ],
      "light": "Increases additional DMG against non-Hero enemies by 100%.",
      "dark": "Increases Silence duration by 0.5 sec.",
      "books": [
        "DMG is increased by 10%.",
        "DMG is increased by 15%.",
        "DMG is increased by 25%."
      ],
      "uniqueTreasure": {
        "name": "Needle of Silence",
        "effect": [
          "[Silent Ambush] Upon activation, recovers own Mana by 100 while reducing the target's Mana by 200.",
          "[Silent Ambush] Upon activation, recovers own Mana by 120 while reducing the target's Mana by 200.",
          "[Silent Ambush] Upon activation, recovers own Mana by 140 while reducing the target's Mana by 200.",
          "[Silent Ambush] Upon activation, recovers own Mana by 170 while reducing the target's Mana by 200.",
          "[Silent Ambush] Upon activation, recovers own Mana by 210 while reducing the target's Mana by 200.",
          "[Silent Ambush] Upon activation, recovers own Mana by 250 while reducing the target's Mana by 200."
        ]
      }
    }
  ],
  "light": "ATK, DEF, HP+15% / Crit DMG +20%",
  "dark": "Normal attacks have a 15% chance to activate Stealth mode that lasts for 10 sec. While in Stealth mode, normal attacks deal 50% increased DMG.",
  "background": {
    "profile": {
      "gender": "Female",
      "race": "Half-Elf",
      "age": "18 (Physical age: 18)",
      "height": "169 cm",
      "birthday": "1(Month) 8(Day), Month of Protection",
      "constellation": "Guardian Mertis",
      "likes": "Roi",
      "dislikes": "Roi, Laughing Mask, Half-Elf blood"
    },
    "story": "An assassin of the Laughing Mask, and Roi's colleague. Although she has a physical advantage over Roi as a Half-Elf, she lacks his worldly wisdom and his ability to connect with others, traits that made him crucial in large-scale operations. This has given her something of an inferiority complex. As the 'Cleaner' of the organization, she was tasked with eliminating any traitors. When Roi abandoned the organization, she set out to chase him to figure out his motivation, leaving all her other tasks behind. Her plans after finding him remain to be seen.",
    "itemIntroductions": {
      "weapon": "The Demon War dates back to 100 years ago. During this war, the greatest threat to mankind was, without a doubt, the high-ranking Demon officers. Kaitasis, the Demon of the Calm, was especially dangerous among them. Countless wizards and priests were slaughtered by this Demon who specifically targeted magic users for their souls. Eventually, Kaitasis was defeated by Kyle, and its core was sealed away. However, years later, the core came into the possession of the Laughing Mask and it once again served as an instrument of death.",
      "soul": "Inside Caethasis, there exist the vengeful spirits of wizards and priests who were killed by Caethasis. After death, the soul of Caethasis encountered those it had devoured and had to stand their curses and resentment, Rather than enduring and accepting this, Caethasis chose to devour all the souls voraciously even in its death. The sword was wielded by many masters across time, and no matter what master it served, Caethasis never ceased fighting inside the sword.\nOne day. when Tanya became aware of the rancor of the souls she had killed, she also noticed that there was a similar battle taking place within her sword. Was it Tanya's and Caethasis destiny to fight endlessly against the souls of they had killed? Without any clear answer, Tanya still faces the demon of her sword with a perplexed mind.",
      "treasures": [
        "Laughing Mask has a secret training manual of veteran assassins' stealth techniques. This book describes stealth skills and their applications in detail. Tanya added her own tips, making this manual even more valuable.",
        "A multi-purpose tool of Laughing Masks used for assassination. It is a unique item for Laughing Masks, known for their speed and efficiency in eliminating their targets. Optimized to the wearer's attacking patterns, it improves the handling of throwing weapons and enhances continuous attacks while casting Blade Tornado.",
        "A dagger given to those who complete the first mission of the Laughing Mask. There's a rule that says that assassins should always carry the dagger that has traces of their target. The silent dagger that assassins carry like an amulet consistently whispers to them about death.",
        "A secret weapon that the leader of the Laughing Masks made for Tanya. After watching Tanya flawlessly accomplish countless missions, the leader decided that Tanya was the right one to be sent to the most dangerous of missions and had this secret weapon of Laughing Mask, 'Needle of Silence' delivered to her. Made with advanced biotechnology, it causes the energy flowing inside the body to regurgitate, killing the opponent in the blink of an eye. Most importantly, it is something that would help Tanya to keep the vow of silence when things go wrong and the mission is compromised."
      ]
    }
  },
  "skins": ["Beachside", "Beachside 2", "R.R. Hood", "Band Member", "Beautiful Silence"],
  "voice": {
    "actor": {
      "jp": "Iwami Manaka",
      "kr": "Cho Kyung Ah",
      "en": "N/A"
    },
    "lines": {
      "jp": [],
      "kr": [],
      "en": []
    }
  }
}
