{
  "name": "Kaulah",
  "title": "Shaman of Lightning",
  "class": "priest",
  "damageType": "magical",
  "position": "Back",
  "weapon": {
    "uniqueWeapon": {
      "name": "The Bluewind, Coventina",
      "effect": [
        "Grants a 10% chance to deal M.DMG equal to 100% of ATK and inflicts Electric Shock on 2 random enemies through a normal attack. If the target is already inflicted with Electric Shock, stuns the target for 2 sec.",
        "Grants a 12% chance to deal M.DMG equal to 120% of ATK stat and inflicts Electric Shock on 2 random enemies through a normal attack. If the target is already inflicted with Electric Shock, stuns the target for 2 sec.",
        "Grants a 14% chance to deal M.DMG equal to 140% of ATK stat and inflicts Electric Shock on 2 random enemies through a normal attack. If the target is already inflicted with Electric Shock, stuns the target for 2 sec.",
        "Grants a 17% chance to deal M.DMG equal to 170% of ATK stat and inflicts Electric Shock on 2 random enemies through a normal attack. If the target is already inflicted with Electric Shock, stuns the target for 2 sec.",
        "Grants a 21% chance to deal M.DMG equal to 210% of ATK stat and inflicts Electric Shock on 2 random enemies through a normal attack. If the target is already inflicted with Electric Shock, stuns the target for 2 sec.",
        "Grants a 25% chance to deal M.DMG equal to 250% of ATK stat and inflicts Electric Shock on 2 random enemies through a normal attack. If the target is already inflicted with Electric Shock, stuns the target for 2 sec."
      ]
    },
    "soulWeapon": {
      "advancement0": "Summons the soul of The Bluewind, Conventina, recovering Mana of all allies by 2000. Afterward, reduces Heal Rate of all enemies by 30%, increases M.DMG the enemies take by 30% for 10 sec, and attacks a random enemy with lighting every 3 sec. dispelling positiv effects, dealing ??? M.DMG, and reducing the enemy's Mana by 500. After 10 sec, deals ??? M.DMG to all enemies and inflicts Stun for 5 sec.",
      "advancement1": "Changes Heal Rate Reduction effect to 50% and M.DMG Boost effect to 50%.",
      "advancement2": "Increases DEF Penetration of all allies by 500 for the duration of Skill.",
      "activation": "Charges up over 20 sec.",
      "cd": 20,
      "charges": 7
    }
  },
  "skills": [
    {
      "id": 1,
      "skillInfo": [
        {
          "skillNumber": "s1",
          "name": "Thunderbolt",
          "description": "Drops 5 lightning bolts upon a random enemy, dealing ??? M.DMG and inflicting Electrify. Electrified enemy is stunned for 3 sec.",
          "cooldown": 10,
          "cost": 3
        }
      ],
      "light": "Mana cost is reduced by 1.",
      "dark": "Target takes 25% increased M.DMG for 10 sec.",
      "books": [
        "DMG is increased by 10%.",
        "DMG is increased by 15%.",
        "Crit Chance is increased by 250."
      ],
      "uniqueTreasure": {
        "name": "Thunderstone Bracelet",
        "effect": [
          "[Thunderbolt] Reduces the target's Heal Rate by 30% and the target's Mana by 100 for 10 sec.",
          "[Thunderbolt] Reduces the target's Heal Rate by 30% and the target's Mana by 120 for 10 sec.",
          "[Thunderbolt] Reduces the target's Heal Rate by 30% and the target's Mana by 140 for 10 sec.",
          "[Thunderbolt] Reduces the target's Heal Rate by 30% and the target's Mana by 170 for 10 sec.",
          "[Thunderbolt] Reduces the target's Heal Rate by 30% and the target's Mana by 210 for 10 sec.",
          "[Thunderbolt] Reduces the target's Heal Rate by 30% and the target's Mana by 250 for 10 sec."
        ]
      }
    },
    {
      "id": 2,
      "skillInfo": [
        {
          "skillNumber": "s2",
          "name": "Healing Rain",
          "description": "HP of all allies is healed by ??? for 5 sec.",
          "cooldown": 11,
          "cost": 2
        }
      ],
      "light": "Allies take 25% less DMG while skill is in effect.",
      "dark": "In exchange for 1 additional Mana Cost, additionally heal allies by 5% of their Max HP.",
      "books": [
        "Heal rate is increased by 10%.",
        "Heal rate is increased by 15%.",
        "While in use, DMG Reduction is increased by 500 , and gains CC immunity."
      ],
      "uniqueTreasure": {
        "name": "Thunderbird Mask",
        "effect": [
          "[Healing Rain] Absorbs DMG of 200% ATK and creates a shield that grants Immunity to CC for 1 sec when used upon allies with full HP.",
          "[Healing Rain] Absorbs DMG of 240% ATK and creates a shield that grants Immunity to CC for 1 sec when used upon allies with full HP.",
          "[Healing Rain] Absorbs DMG of 290% ATK and creates a shield that grants Immunity to CC for 1 sec when used upon allies with full HP.",
          "[Healing Rain] Absorbs DMG of 350% ATK and creates a shield that grants Immunity to CC for 1 sec when used upon allies with full HP.",
          "[Healing Rain] Absorbs DMG of 420% ATK and creates a shield that grants Immunity to CC for 1 sec when used upon allies with full HP.",
          "[Healing Rain] Absorbs DMG of 500% ATK and creates a shield that grants Immunity to CC for 1 sec when used upon allies with full HP."
        ]
      }
    },
    {
      "id": 3,
      "skillInfo": [
        {
          "skillNumber": "s3",
          "name": "Swift Wind",
          "description": "For 15 sec, all allies' ATK is increased by ??? , and ATK Spd is increased by 350.",
          "cooldown": 20,
          "cost": 4
        }
      ],
      "light": "Recovers 1 orb of Mana for all allies.",
      "dark": "Cooldown is reduced by 3 sec.",
      "books": [
        "ATK boost is increased by 10%.",
        "ATK boost is increased by 15%.",
        "Crit Chance is increased by 350 for the duration of skill."
      ],
      "uniqueTreasure": {
        "name": "Skywind Feather Decoration",
        "effect": [
          "[Swift Wind] Mana cost is reduced by 1, and Crit DMG 20% boost effect is added.",
          "[Swift Wind] Mana cost is reduced by 1, and Crit DMG 24% boost effect is added.",
          "[Swift Wind] Mana cost is reduced by 1, and Crit DMG 29% boost effect is added.",
          "[Swift Wind] Mana cost is reduced by 1, and Crit DMG 35% boost effect is added.",
          "[Swift Wind] Mana cost is reduced by 1, and Crit DMG 42% boost effect is added.",
          "[Swift Wind] Mana cost is reduced by 1, and Crit DMG 50% boost effect is added."
        ]
      }
    },
    {
      "id": 4,
      "skillInfo": [
        {
          "skillNumber": "s4",
          "name": "Chain Lightning",
          "description": "Deals ??? M.DMG to 4 enemies every 15 sec, inflicts Electric Shock for 20 sec, and stuns them for 1 sec upon a Critical Hit. Enemies under Electric Shock take a total of ??? M.DMG over 20 sec."
        }
      ],
      "light": "Electric Shock effect becomes irremovable.",
      "dark": "Increases Stun duration by 0.7 sec.",
      "books": [
        "DMG is increased by 10%.",
        "DMG is increased by 15%.",
        "DMG is increased by 25%."
      ],
      "uniqueTreasure": {
        "name": "Skywind Stone",
        "effect": [
          "[Chain Lightning] Reduces the target's ATK Spd by 250 and increases M.DMG it takes by 10% for 10 sec.",
          "[Chain Lightning] Reduces the target's ATK Spd by 250 and increases M.DMG it takes by 12% for 10 sec.",
          "[Chain Lightning] Reduces the target's ATK Spd by 250 and increases M.DMG it takes by 14% for 10 sec.",
          "[Chain Lightning] Reduces the target's ATK Spd by 250 and increases M.DMG it takes by 17% for 10 sec.",
          "[Chain Lightning] Reduces the target's ATK Spd by 250 and increases M.DMG it takes by 21% for 10 sec.",
          "[Chain Lightning] Reduces the target's ATK Spd by 250 and increases M.DMG it takes by 25% for 10 sec."
        ]
      }
    }
  ],
  "light": "ATK, DEF, HP+15% / Crit Chance +100",
  "dark": "When taking DMG, decreases ATK Spd of the attacking enemy by 300 for 5 sec. This effect is activated only once every 5 sec.",
  "background": {
    "profile": {
      "gender": "Male",
      "race": "Orc",
      "age": "46 Years",
      "height": "210 cm",
      "birthday": "3(Month) 11(Day), Month of Insight",
      "constellation": "Lasiphil the Prophet",
      "likes": "Fellow kinsmen, world peace",
      "dislikes": "Malduk, war"
    },
    "story": "This great Orc shaman wields the power of lightning. He is the chieftain of the Skywind Tribe and a respected elder of the Orc Alliance. He has trained countless Orc shamans and is considered their spiritual leader. He is also one of the few shamans who has clairvoyant dreams, and he is wise enough to properly interpret them.",
    "itemIntroductions": {
      "weapon": "A staff resembling the four-winged thunderbird. Indeed, it has been crafted from a feather of a thunderbird, a beast considered holy among the Skywind Orcs. The staff has the power to communicate with the sky, read the weather, and control the air. To a Skywind shaman who uses the power of lightning, this staff is the ultimate medium.",
      "soul": "Thunderbird, the guardian of rain and thunder, is a sacred entity considered holy by the Skywind Tribe. Thunderbird, however, had never intervened in the matters of earthen beings, because it strongly believed that they should be the ones who control their fate's course.\nEven when the Demons first invaded 100 years ago, Thunderbird only offered to lend its power, and did not fight in battles. However, its idle choices resulted in a grand catastrophe.\nCountless lives suffered horrible deaths in the hands of Demons, and even Ogria was not safe from such devastation. Although the terrible war ended when Kyle defeated Dark Lord Angmund, Thunderbird regretted its decision ever since. 100 years have passed since then, and just when scars of the past were being mended, darkness unfolded over the world once again, dragging Ogria into chaos.\nCountless Orcs were slaughtered by Demons, and even Sieg, their high chieftain, fell, Not only that, dead Orcs were turned into undeads, and turned against their once-kin. Although Kaulah had been still fighting the Demons with Orc survivors, the outlook did not seem great.\nHence, Thunderbird made its decision to directly aid the Orcs to save Ogria in crisis and to not repeat the same mistake from 100 years ago. Thunderbird appeared in front of Kaulah, and after hearing about the situation in detail, offered to lend its true power to Kaulah to save chaos-engulfed Ogria. Through his encounter with Thunderbird, Kaulah finally learned the ability to harness the power of the sacred entity, and the holy power he harnesses will purify all evil from the land.",
      "treasures": [
        "A bracelet made from a holy thunderstone. Also known as Thunder God's Tear, the thunderstone on the bracelet maximizes the power of Thunderbolt. It's passed down through generations among the orc shamans.",
        "Mask of the auspicious thunderbird that brings rain. Once the Healing Droplets of the Skywind shaman begin, the soul of the thunderbird stays by those who were hit by Healing Rain and recovers their tired bodies.",
        "Feather from a thunderbird, guardian of rain and thunder. The high ranking shamans of the Skywind Tribe commune through the feathers of a thunderbird. Shamans use this feather accessory when using Swift Wind to become one with the thunderbird, increasing ATK and ATK Spd of all allies.",
        "A mysterious stone that summons Thunderbird. Holding the Thunder Elemental inside, it is a legendary stone that can infinitely bring forth the power of the Thunder Bird."
      ]
    }
  },
  "skins": ["Dean", "Santa", "Beachside"],
  "voice": {
    "actor": {
      "jp": "Matsumoto Shinobu",
      "kr": "Kim Ki Hyun",
      "en": "N/A"
    },
    "lines": {
      "jp": [],
      "kr": [],
      "en": []
    }
  }
}
