{
  "name": "Ricardo",
  "title": "Lua's Judgment",
  "class": "knight",
  "damageType": "physical",
  "position": "Front",
  "weapon": {
    "uniqueWeapon": {
      "name": "Light of Judgment, Theoria",
      "effect": [
        "When an ally other than the caster takes DMG, there is a 10% chance that a shield is cast upon them to absorb DMG equal to 320% of ATK for 5 sec while granting immunity to CC. This effect does not trigger more than once in 5 sec.",
        "When an ally other than the caster takes DMG, there is a 12% chance that a shield is cast upon them to absorb DMG equal to 384% of ATK for 5 sec while granting immunity to CC. This effect does not trigger more than once in 5 sec.",
        "When an ally other than the caster takes DMG, there is a 14% chance that a shield is cast upon them to absorb DMG equal to 460% of ATK for 5 sec while granting immunity to CC. This effect does not trigger more than once in 5 sec.",
        "When an ally other than the caster takes DMG, there is a 17% chance that a shield is cast upon them to absorb DMG equal to 552% of ATK for 5 sec while granting immunity to CC. This effect does not trigger more than once in 5 sec.",
        "When an ally other than the caster takes DMG, there is a 20% chance that a shield is cast upon them to absorb DMG equal to 660% of ATK for 5 sec while granting immunity to CC. This effect does not trigger more than once in 5 sec.",
        "When an ally other than the caster takes DMG, there is a 25% chance that a shield is cast upon them to absorb DMG equal to 800% of ATK for 5 sec while granting immunity to CC. This effect does not trigger more than once in 5 sec."
      ]
    },
    "soulWeapon": {
      "advancement0": "Summons the soul of Light of Judgment, Theoria for 15 sec, inreasing own DEF by 50%. If Ricardo takes DMG for the duration of Skill, there is a 10% chance to deal ??? P.DMG to the attacker and inflict stun for 2 sec.",
      "advancement1": "Increases the duration of stun by 2 sec.",
      "advancement2": "Increases activation chance by 10% and reduces Mana of the hit target by 500.",
      "activation": "Charges up every sec and every time self takes DMG. This Skill can be cast upon gaining 100 charges.",
      "cd": 25,
      "charges": 5
    }
  },
  "skills": [
    {
      "id": 1,
      "skillInfo": [
        {
          "skillNumber": "s1",
          "name": "Destruction",
          "description": "Deals ??? P.DMG to frontal enemies in range and knocks them down for 3 sec.",
          "cooldown": 8,
          "cost": 2
        }
      ],
      "light": "Target receives 25% increased P.DMG for 10 sec.",
      "dark": "Deals extra P.DMG equal to 200% of M.DEF.",
      "books": [
        "DMG is increased by 10%.",
        "DMG is increased by 15%.",
        "Gains immunity to CC while in use."
      ],
      "uniqueTreasure": {
        "name": "Stole of Templar",
        "effect": [
          "[Destruction] For 10 sec, reduces the target's ATK by 20% and increases P.DMG and M.DMG target receives by 5%.",
          "[Destruction] For 10 sec, reduces the target's ATK by 20% and increases P.DMG and M.DMG target receives by 6%.",
          "[Destruction] For 10 sec, reduces the target's ATK by 20% and increases P.DMG and M.DMG target receives by 7%.",
          "[Destruction] For 10 sec, reduces the target's ATK by 20% and increases P.DMG and M.DMG target receives by 8.5%.",
          "[Destruction] For 10 sec, reduces the target's ATK by 20% and increases P.DMG and M.DMG target receives by 10.5%.",
          "[Destruction] For 10 sec, reduces the target's ATK by 20% and increases P.DMG and M.DMG target receives by 12.5%."
        ]
      }
    },
    {
      "id": 2,
      "skillInfo": [
        {
          "skillNumber": "s2",
          "name": "Divine Protection",
          "description": "Deals ??? P.DMG to enemies in range and inflicts Stun for 1 sec. Additionally, own M.DEF is increased by ??? for 10 sec, and takes 80% of M.DMG instead of allies.",
          "cooldown": 30,
          "cost": 1
        }
      ],
      "light": "In exchange for 1 additional Mana Cost, Ricardo gains 30% DMG resistance to DMG taken due to covering for allies.",
      "dark": "This skill's effect cannot be dispelled.",
      "books": [
        "Defense Boost is increased by 10%.",
        "Defense Boost is increased by 15%.",
        "For 10 sec, heals 1% of own HP per sec."
      ],
      "uniqueTreasure": {
        "name": "Pride of Holy Warrior",
        "effect": [
          "[Divine Protection] Gains Immunity to CC and increases M.Resistance by 10% for the skill's duration.",
          "[Divine Protection] Gains Immunity to CC and increases M.Resistance by 12% for the skill's duration.",
          "[Divine Protection] Gains Immunity to CC and increases M.Resistance by 14% for the skill's duration.",
          "[Divine Protection] Gains Immunity to CC and increases M.Resistance by 17% for the skill's duration.",
          "[Divine Protection] Gains Immunity to CC and increases M.Resistance by 21% for the skill's duration.",
          "[Divine Protection] Gains Immunity to CC and increases M.Resistance by 25% for the skill's duration."
        ]
      }
    },
    {
      "id": 3,
      "skillInfo": [
        {
          "skillNumber": "s3",
          "name": "Divine Judgment",
          "description": "Attacks frontal enemies in a straight line 3 times. The first 2 attacks deal ??? P.DMG to enemies and stun them for 4 sec, and the last attack deals ??? P.DMG to enemies in a 20% wider range, while stunning them for 4 sec. Each attack has a 50% chance of dispelling positive effects from the enemy.",
          "cooldown": 23,
          "cost": 4
        }
      ],
      "light": "Stun duration is increased by 2 sec.",
      "dark": "Mana cost is reduced by 1.",
      "books": [
        "DMG is increased by 10%.",
        "DMG is increased by 15%.",
        "Blocks all DMG while the skill is in use."
      ],
      "uniqueTreasure": {
        "name": "Templar Vow",
        "effect": [
          "[Divine Judgment] dispels enemies' positive effects with 75% chance, and reduces target's ATK Spd by 100 for 10 sec.",
          "[Divine Judgment] dispels enemies' positive effects with 75% chance, and reduces target's ATK Spd by 120 for 10 sec.",
          "[Divine Judgment] dispels enemies' positive effects with 75% chance, and reduces target's ATK Spd by 140 for 10 sec.",
          "[Divine Judgment] dispels enemies' positive effects with 75% chance, and reduces target's ATK Spd by 170 for 10 sec.",
          "[Divine Judgment] dispels enemies' positive effects with 75% chance, and reduces target's ATK Spd by 210 for 10 sec.",
          "[Divine Judgment] dispels enemies' positive effects with 75% chance, and reduces target's ATK Spd by 250 for 10 sec."
        ]
      }
    },
    {
      "id": 4,
      "skillInfo": [
        {
          "skillNumber": "s4",
          "name": "Divine Blessing",
          "description": "When allies excluding self take M.DMG, increases their M.DEF by ??? for 5 sec. Can be stacked up to 5 times max."
        }
      ],
      "light": "M.DEF increase rate is boosted by 40%.",
      "dark": "Max stack count is boosted to 8.",
      "books": [
        "Defense Boost is increased by 10%.",
        "Defense Boost is increased by 15%.",
        "Duration is increased by 2 sec."
      ],
      "uniqueTreasure": {
        "name": "Pendant of Benevolence",
        "effect": [
          "[Divine Blessing] Increases duration by 5 sec. Reduces M.DMG dealt to self by 1% per stack.",
          "[Divine Blessing] Increases duration by 5 sec. Reduces M.DMG dealt to self by 1.2% per stack.",
          "[Divine Blessing] Increases duration by 5 sec. Reduces M.DMG dealt to self by 1.4% per stack.",
          "[Divine Blessing] Increases duration by 5 sec. Reduces M.DMG dealt to self by 1.7% per stack.",
          "[Divine Blessing] Increases duration by 5 sec. Reduces M.DMG dealt to self by 2.1% per stack.",
          "[Divine Blessing] Increases duration by 5 sec. Reduces M.DMG dealt to self by 2.5% per stack."
        ]
      }
    }
  ],
  "light": "ATK, DEF, HP+15% / P. Block +200",
  "dark": "When own HP goes below 40%, HP does not go under 10% for 6 sec, and all allies' ATK is increased by 50% of own M.DEF. This effect is activated once every 60 sec.",
  "background": {
    "profile": {
      "gender": "missing",
      "race": "missing",
      "age": "missing",
      "height": "missing",
      "birthday": "missing",
      "constellation": "missing",
      "likes": "People, helping others",
      "dislikes": "Demons, especially those who attack people for no reason"
    },
    "story": "A hero who saved countless lives from the Demons, and the current commander of the Holy Knights of the Church of Lua. This brave and seasoned knight has been hunting down Demons all across Orvelia since his younger days. He is also the headmaster of the orphanage where Kasel, Frey, and Clause grew up. He trained countless warriors in Orvelia and is considered their spiritual leader. He is preparing to step down from the position due to his age, but his age-defying strength has always led to the denial of his retirement request.",
    "itemIntroductions": {
      "weapon": "When the Holy Sword Aea was bestowed upon Kyle, it appeared in the Temple of Lua located north of the King's Plains. When Kyle removed the sword from the altar, it released a powerful wave of light that turned the entire vicinity into a sacred ground. Everything contained within the Temple was turned into holy relics. Teoria, the central pillar of the Temple, absorbed the greatest amount of holy energy of them all.",
      "treasures": [
        "A ceremonial stole bestowed upon the Grand Master of the Holy Knights. Ricardo made it into an insignia and put it on his armor to boost the morale of his comrades on the battlefield. When the stole waves as he swings Theoria at evil creatures, courage fills the hearts of his allies who see it.",
        "Shield of the arbiter of Lua's Holy Knights. Artifact given to those who've earned the title of Arbiter from the Lua's Holy Knights. An artifact imbued with Goddess Lua's blessing, it protects those under the benevolence of the god, and punishes enemies without mercy.",
        "The seal that Ricardo used for the pledge of the Holy Warrior. When first appointed as a Holy Warrior, knights leave their names on the certificate of oath with their seals. Ricardo made his seal with his affection for the Church of Lua. He still carries it now, after all this time.",
        "The symbol of Ricardo Orphanage, which has a small cross at the center of a bigger one. It was made when the orphanage was built, in the hope that Ricardo's prayers could include the unspoken wishes of the youngest children who did not know any words. Great Priestess Iris also blessed it in the name of Lua, and it is said that it keeps diseases away from children while they grow up."
      ]
    }
  },
  "skins": [],
  "voice": {
    "actor": {
      "jp": "N/A",
      "kr": "N/A",
      "en": "N/A"
    },
    "lines": {
      "jp": [],
      "kr": [],
      "en": []
    }
  }
}