{
  "name": "Nia",
  "title": "Darkness-swallowing Eyes",
  "class": "assassin",
  "damageType": "physical",
  "position": "Front",
  "weapon": {
    "uniqueWeapon": {
      "name": "Rending Chaos, Zakadras",
      "effect": [
        "Crit Chance is increased by 200 and Crit DMG is increased by 40%.",
        "Crit Chance is increased by 240 and Crit DMG is increased by 48%.",
        "Crit Chance is increased by 290 and Crit DMG is increased by 58%.",
        "Crit Chance is increased by 350 and Crit DMG is increased by 70%.",
        "Crit Chance is increased by 420 and Crit DMG is increased by 84%.",
        "Crit Chance is increased by 500 and Crit DMG is increased by 100%."
      ]
    },
    "soulWeapon": {
      "advancement0": "Summons the soul of Rending Chaos, Zakadras, dealing ??? P.DMG to all enemies, stunnig them for 4 sec, and increasing P.DMG the enemies take by 20% for 10 sec. Afterward, increases own ATK by 25% and ATK Spd by 250 for 10 sec.",
      "advancement1": "Increases DMG by 30%, and P.DMG the enemies take 40%.",
      "advancement2": "Reduces Cooldown by 7 sec. Upon activation, gain 2 stacks of Demonic Blood.",
      "activation": "Charges up upon using Skills 5 times.",
      "cd": 22,
      "charges": 5
    }
  },
  "skills": [
    {
      "id": 1,
      "skillInfo": [
        {
          "skillNumber": "s1",
          "name": "Scar of Barbarism",
          "description": "Deals ??? P.DMG to 1 enemy. Then, moves forward while continuously attacking the nearby area and knocking back hit enemies to deal a total of ??? P.DMG. The last strike deals ??? P.DMG to frontal enemies and knocks them down for 2 sec.",
          "cooldown": 15,
          "cost": 3
        },
        {
          "skillNumber": "s1_2",
          "name": "Enhanced Scar of Barbarism",
          "description": "Deals ??? P.DMG to 1 enemy. Then, moves to random enemies while continuously attacking the nearby area and knocking back hit enemies to deal a total of ??? P.DMG. The last strike deals ??? P.DMG to frontal enemies and knocks them down for 4 sec.",
          "cooldown": 0,
          "cost": 1,
          "linked": "s1_0"
        }
      ],
      "light": "Increases DMG by 40%.",
      "dark": "Recovers own Mana by 50 upon every hit.",
      "books": [
        "DMG is increased by 10%.",
        "DMG is increased by 15%.",
        "DMG is increased by 25%."
      ],
      "uniqueTreasure": {
        "name": "Flower of Jungle",
        "effect": [
          "[Scar of Barbarism] Reduces Mana Cost by 1 and reduces P.Crit Resistance of the affected enemy by 200 for 10 sec.",
          "[Scar of Barbarism] Reduces Mana Cost by 1 and reduces P.Crit Resistance of the affected enemy by 240 for 10 sec.",
          "[Scar of Barbarism] Reduces Mana Cost by 1 and reduces P.Crit Resistance of the affected enemy by 290 for 10 sec.",
          "[Scar of Barbarism] Reduces Mana Cost by 1 and reduces P.Crit Resistance of the affected enemy by 350 for 10 sec.",
          "[Scar of Barbarism] Reduces Mana Cost by 1 and reduces P.Crit Resistance of the affected enemy by 420 for 10 sec.",
          "[Scar of Barbarism] Reduces Mana Cost by 1 and reduces P.Crit Resistance of the affected enemy by 500 for 10 sec."
        ]
      }
    },
    {
      "id": 2,
      "skillInfo": [
        {
          "skillNumber": "s2",
          "name": "On the Hunt",
          "description": "Moves behind the farthest enemy to deal ??? P.DMG, and inflicts [Hunt Mark] to all enemies for 12 sec. Enemies under [Hunt Mark] take 20% increased P.DMG and have their Heal Rate reduced by 25%. Dispels all positive effects from enemies with [Enhanced Hunt Mark].",
          "cooldown": 15,
          "cost": 3
        },
        {
          "skillNumber": "s2_2",
          "name": "Enhanced On the Hunt",
          "description": "Moves behind the farthest enemy to deal ??? P.DMG that ignores DEF, and inflicts [Enhanced Hunt Mark] to all enemies for 12 sec. Enemies under [Enhanced Hunt Mark] take 40% increased P.DMG, have their Heal Rate reduced by 50%, and their ATK Spd by 25%. Dispels all positive effects from enemies with [Hunt Mark].",
          "cooldown": 0,
          "cost": 1,
          "linked": "s2_0"
        }
      ],
      "light": "Stuns targets for 1 sec when [Hunt Mark] is inflicted, and for 3 sec when [Enhanced Hunt Mark] is inflicted.",
      "dark": "[Hunt Mark] and [Enhanced Hunt Mark] cannot be dispelled by skills that remove negative effects.",
      "books": [
        "DMG is increased by 10%.",
        "DMG is increased by 15%.",
        "DMG is increased by 25%."
      ],
      "uniqueTreasure": {
        "name": "Gift of Hunter",
        "effect": [
          "[On the Hunt] Increases DMG by 50% and P.DMG increase inflicted by [Hunt Mark] and [Enhanced Hunt Mark] by an additional 8%.",
          "[On the Hunt] Increases DMG by 50% and P.DMG increase inflicted by [Hunt Mark] and [Enhanced Hunt Mark] by an additional 10%.",
          "[On the Hunt] Increases DMG by 50% and P.DMG increase inflicted by [Hunt Mark] and [Enhanced Hunt Mark] by an additional 12%.",
          "[On the Hunt] Increases DMG by 50% and P.DMG increase inflicted by [Hunt Mark] and [Enhanced Hunt Mark] by an additional 14%.",
          "[On the Hunt] Increases DMG by 50% and P.DMG increase inflicted by [Hunt Mark] and [Enhanced Hunt Mark] by an additional 17%.",
          "[On the Hunt] Increases DMG by 50% and P.DMG increase inflicted by [Hunt Mark] and [Enhanced Hunt Mark] by an additional 20%."
        ]
      }
    },
    {
      "id": 3,
      "skillInfo": [
        {
          "skillNumber": "s3",
          "name": "Demonic Eyes of Petrification",
          "description": "Deals ??? P.DMG to frontal enemies ??? times, and petrifies them for 3 sec.",
          "cooldown": 30,
          "cost": 4
        },
        {
          "skillNumber": "s3_2",
          "name": "Enhanced Demonic Eyes of Petrification",
          "description": "Deals ??? P.DMG that ignores DEF to frontal enemies in a wider range ??? times, and petrifies them for 5 sec.",
          "cooldown": 0,
          "cost": 1,
          "linked": "s3_0"
        }
      ],
      "light": "Gains immunity to CC for the skill duration.",
      "dark": "Increases DMG to Non-Hero enemies by 100% for the skill duration.",
      "books": [
        "DMG is increased by 10%.",
        "DMG is increased by 15%.",
        "DMG is increased by 25%."
      ],
      "uniqueTreasure": {
        "name": "Bone Mask of Spell",
        "effect": [
          "[Demonic Eyes of Petrification] Pulls enemies to the front upon casting, and reduces Mana of enemies by 200 upon hit.",
          "[Demonic Eyes of Petrification] Pulls enemies to the front upon casting, and reduces Mana of enemies by 240 upon hit.",
          "[Demonic Eyes of Petrification] Pulls enemies to the front upon casting, and reduces Mana of enemies by 290 upon hit.",
          "[Demonic Eyes of Petrification] Pulls enemies to the front upon casting, and reduces Mana of enemies by 350 upon hit.",
          "[Demonic Eyes of Petrification] Pulls enemies to the front upon casting, and reduces Mana of enemies by 420 upon hit.",
          "[Demonic Eyes of Petrification] Pulls enemies to the front upon casting, and reduces Mana of enemies by 500 upon hit."
        ]
      }
    },
    {
      "id": 4,
      "skillInfo": [
        {
          "skillNumber": "s4",
          "name": "Demonic Blood",
          "description": "Gains 1 stack of [Demonic Blood] upon casting a skill. It can be stacked up to max 4 times, and upon gaining 4 stacks, Cooldown of all skills is reset and [Enhanced Skill] becomes available. Removes [Demonic Blood] stacks when [Enhanced Skill] is used. Upon gaining each stack of [Demonic Blood], increases own ATK by ??? and All Dodge Chance by 20 for 20 sec. This effect can be stacked up to max 10 times."
        }
      ],
      "light": "Increases ATK Boost and All Dodge Chance Boost by 50%.",
      "dark": "Dispels own negative effects upon gaining 4 stacks of [Demonic Blood].",
      "books": [
        "ATK boost is increased by 10%.",
        "ATK boost is increased by 15%.",
        "ATK boost is increased by 25%."
      ],
      "uniqueTreasure": {
        "name": "Blood Stabilizer",
        "effect": [
          "[Demonic Blood] At the beginning of every battle, gains 1 stack of Demonic Blood. 4 stacks of Demonic Blood will grant immunity to CC for 2 sec.",
          "[Demonic Blood] At the beginning of every battle, gains 1 stack of Demonic Blood. 4 stacks of Demonic Blood will grant immunity to CC for 2.4 sec.",
          "[Demonic Blood] At the beginning of every battle, gains 1 stack of Demonic Blood. 4 stacks of Demonic Blood will grant immunity to CC for 2.9 sec.",
          "[Demonic Blood] At the beginning of every battle, gains 1 stack of Demonic Blood. 4 stacks of Demonic Blood will grant immunity to CC for 3.5 sec.",
          "[Demonic Blood] At the beginning of every battle, gains 1 stack of Demonic Blood. 4 stacks of Demonic Blood will grant immunity to CC for 4.2 sec.",
          "[Demonic Blood] At the beginning of every battle, gains 1 stack of Demonic Blood. 4 stacks of Demonic Blood will grant immunity to CC for 5 sec."
        ]
      }
    }
  ],
  "light": "ATK, DEF, HP+15% / ATK.Spd +100",
  "dark": "Normal attacks and [Enhanced Scar of Barbarism] deal additional P.DMG equal to 25% of ATK that ignores DEF.",
  "background": {
    "profile": {
      "gender": "missing",
      "race": "missing",
      "age": "missing",
      "height": "missing",
      "birthday": "missing",
      "constellation": "missing",
      "likes": "Meat, people who give her meat, resting her head on other people's lap, sunbathing",
      "dislikes": "Vegetable, people from Vespia Empire, Demons, Demonic Beasts, being tested, cold weather"
    },
    "story": "An old legend has it that there was a demon that used humans as its test subjects for body modification. He cloned, fused, and modified numerous beast and human bodies with his magic. It was said that one of the test subjects that came to possess great power escaped the laboratory and created a tribe among humans. The leader of the tribe is known to have developed a mysterious ability called Demonic Eyes of Petrification. The demonic eyes, very similar to the cursed eyes of a rare beast Basilisk, are known to have the curse to turn everything they stared at into stones. Nia, the young leader of Krakashu Tribe, currently possesses these demonic eyes. This young beast, as swift as a leopard, is hunting down demons and demonic beasts to avenge her forefathers.",
    "itemIntroductions": {
      "weapon": "A weapon forged from special metal that a shaman from Krakashu, the tribe of darkness, made by melting down living demonic beasts. The metal was then forged by the best smith in the Jungle and was reborn as a magical weapon to punish demons. A huge pair of claws embrace curse, grudge, and rage. These claws are the symbol that represents the leader of Krakashu, and they're also a medium of the spell that appeases the wrath of their forefathers. Nia became the tribe leader at such a young age and has yet to tap into all the darkness that the weapon holds, but deep at night, often when she's about to fall asleep, she can hear the howling grudge of her forefathers from the weapon.",
      "soul": "Voices of unknown origin spoke to Nia each night, and sometimes woke her up from her sleep. One night, when the voice again disturbed Nia's sleep, Nia got out of her bed and walked toward the direction where the voice was coming from. Her footsteps lead to Zakadras, the weapon which Nia inherited when she became the chieftain.\nNia lifted Zakadras and examined its blade to find out the identity of the voice. That's when [...MISSING] within the blade. Once the grudging splits noticed Nia, they started to cry out and shout. Nia however, remained calm and listened to all their outcry. After listening to their story for days and nights, Nia decided to fulfill their wishes. At that very moment when Nia let her guard down, a Demon who was lurking around to attack Nia sprung out and attacked her, but was deflected by a giant hand that Zakadras released. '-This child is the only one who will free us from our rancor. She is not someone who the likes of you can kill!' The spirit killed the Demon instantly and stared at Nia who was looking at it with a shocked face",
      "treasures": [
        "The deep Jungle of Darkness sits in southern Vespia. It is the home, the hunting ground, and the battlefield of the Krakashu tribe. The people in the Empire treat them as barbarians, but they are emotional and sensitive beings that present flowers to their beloved ones. For the Krakashu tribe, the bouquet of flowers means 'return home safe and sound.' This bouquet of flowers handmade by Nia's tribe members holds a spell that keeps the flowers from withering as long as Nia is healthy.",
        "The fame of Dragon Slayer Yanne spread not only to the Orbis Continent, but also to the Vespia empire. Yanne, a skilled monster hunter, was requested by a noble in the empire to hunt down the monsters inhabiting the Jungle of Darkness. However, the empire's ulterior motive was to drive away the natives so that they could develop the jungle and use it for their own sake. Without knowing the truth, Yanne walked into the jungle. The Krakashu tribe, led by the young leader, Nia, mistook Yanne as an imperial invader and attacked her. After Yanne subdued the tribespeople rather effortlessly with her superhuman strength, she had a talk with Nia and figured out the truths. She apologized to Nia for entering their land without permission, and gave her the necklace she made herself as a sign of reconciliation and friendship.",
        "A magical mask made with the skull of Prektrek, the beast of spell. Since Nia disliked traditional masks which covered her entire face, the bone mask was modified into a helmet. The main use of bone masks is to keep the tribe leaders' demonic eyes from going berserk. However, the mask wasn't significant to Nia because her demonic eyes, despite their enormous powers, were very stable. It is what Nia uses to remember her father, who was called by the Blue Star when she succeeded the Demonic Eyes of Petrification. They say that she made her bone mask with a skull that closely resembled her father's bone mask. A little bit of trivia: The beast Prektrek is known to be distantly related to Goblins...",
        "Even though Nia's blood was more stable than her forefathers', there were times when it boiled to the point where Nia almost lost her mind. This special treatment is a unique type of poison that Mediana and Requina made by the request of Yanne, who found out about Nia's status. This poison only attacks the Demonic Blood inside Nia, and it takes one sip to keep her calm. This treatment has a side effect, however, that causes her digestive system to malfunction, during which meat-loving Nia has to stay away from meat. Therefore, Nia tries her best not to use this stabilizer."
      ]
    }
  },
  "skins": [],
  "voice": {
    "actor": {
      "jp": "N/A",
      "kr": "N/A",
      "en": "N/A"
    },
    "lines": {
      "jp": [],
      "kr": [],
      "en": []
    }
  }
}