{
  "name": "Cecilia",
  "title": "Crimson Wind of Justice",
  "class": "mechanic",
  "damageType": "physical",
  "position": "Front",
  "weapon": {
    "uniqueWeapon": {
      "name": "Supersonic Tempest, Gigantix",
      "effect": [
        "Increases ATK Spd by 100. Normal and Skill attacks grant a stack of Explosion on self and have a 3% chance of stunning the target for 4 sec. Upon gaining 100 Explosion stacks, Gigantix explodes, increasing ATK Spd and All Dodge Chance by 100. This effect is irremovable.",
        "Increases ATK Spd by 120. Normal and Skill attacks grant a stack of Explosion on self and have a 3% chance of stunning the target for 4 sec. Upon gaining 100 Explosion stacks, Gigantix explodes, increasing ATK Spd and All Dodge Chance by 120. This effect is irremovable.",
        "Increases ATK Spd by 140. Normal and Skill attacks grant a stack of Explosion on self and have a 3% chance of stunning the target for 4 sec. Upon gaining 100 Explosion stacks, Gigantix explodes, increasing ATK Spd and All Dodge Chance by 140. This effect is irremovable.",
        "Increases ATK Spd by 170. Normal and Skill attacks grant a stack of Explosion on self and have a 3% chance of stunning the target for 4 sec. Upon gaining 100 Explosion stacks, Gigantix explodes, increasing ATK Spd and All Dodge Chance by 170. This effect is irremovable.",
        "Increases ATK Spd by 210. Normal and Skill attacks grant a stack of Explosion on self and have a 3% chance of stunning the target for 4 sec. Upon gaining 100 Explosion stacks, Gigantix explodes, increasing ATK Spd and All Dodge Chance by 210. This effect is irremovable.",
        "Increases ATK Spd by 250. Normal and Skill attacks grant a stack of Explosion on self and have a 3% chance of stunning the target for 4 sec. Upon gaining 100 Explosion stacks, Gigantix explodes, increasing ATK Spd and All Dodge Chance by 250. This effect is irremovable."
      ]
    },
    "soulWeapon": {
      "advancement0": "Summons the soul of Supersonic Tempest, Gigantix for 12 sec. Normal and Skill attacks have a 10% chance to deal ??? P.DMG to the target and enemies within a small range of it, inflicting stun for 1 sec.",
      "advancement1": "Increases own ATK by 40% for the duration of Skill.",
      "advancement2": "Activation chance is increased to 20%.",
      "activation": "Charges up upon using Skills 7 times.",
      "cd": 22,
      "charges": 7
    }
  },
  "skills": [
    {
      "id": 1,
      "skillInfo": [
        {
          "skillNumber": "s1",
          "name": "Outta the way!",
          "description": "Marks the farthest enemy as the [Villain], reducing its ATK Spd by 200 for 15 sec. Then, moves to the target to deal ??? P.DMG. After using this Skill, [Crushing Kick!] becomes available.",
          "cooldown": 12,
          "cost": 3
        },
        {
          "skillNumber": "s1_2",
          "name": "Crushing Kick!",
          "description": "Attacks the target, dealing ??? P.DMG and knocking it away for 4 sec. Enemies marked as [Villain] are prioritized. After using this Skill, [Tempest Kick!] becomes available.",
          "cooldown": 0,
          "cost": 0,
          "linked": "s1_0"
        },
        {
          "skillNumber": "s1_3",
          "name": "Tempest Kick!",
          "description": "Moves to the farthest enemy, dealing ??? P.DMG and stunning it for 4 sec. Enemies marked as [Villain] are prioritized.",
          "cooldown": 0,
          "cost": 0,
          "linked": "s1_1"
        }
      ],
      "light": "Increases P.DMG the target takes by 25% for 10 sec.",
      "dark": "Dispels positive effects from the target.",
      "books": [
        "Increases DMG by 10%.",
        "Increases DMG by 15%.",
        "Increases DMG by 25%."
      ],
      "uniqueTreasure": {
        "name": "First Step of Hero",
        "effect": [
          "[Outta the Way!] Reduces Mana Cost by 1 and increases P.DMG the target takes by 10% for 10 sec.",
          "[Outta the Way!] Reduces Mana Cost by 1 and increases P.DMG the target takes by 12% for 10 sec.",
          "[Outta the Way!] Reduces Mana Cost by 1 and increases P.DMG the target takes by 14% for 10 sec.",
          "[Outta the Way!] Reduces Mana Cost by 1 and increases P.DMG the target takes by 17% for 10 sec.",
          "[Outta the Way!] Reduces Mana Cost by 1 and increases P.DMG the target takes by 21% for 10 sec.",
          "[Outta the Way!] Reduces Mana Cost by 1 and increases P.DMG the target takes by 25% for 10 sec."
        ]
      }
    },
    {
      "id": 2,
      "skillInfo": [
        {
          "skillNumber": "s2",
          "name": "Infinite Potential",
          "description": "Deals ??? P.DMG to nearby enemies in a circular range of self, knocking them down for 3 sec. Afterward, Cecilia gains [Infinite Potential], which increases own ATK Spd by 300 for 15 sec. While under [Infinite Potential], Normal and Skill attacks deal ??? P.DMG to Heroes and ??? P.DMG to Non-Hero enemies. This effect is irremovable.",
          "cooldown": 20,
          "cost": 3
        }
      ],
      "light": "Increases DMG to Non-Hero enemies by 20% for the duration of Skill.",
      "dark": "Takes 20% reduced DMG for the duration of Skill.",
      "books": [
        "Increases DMG by 10%.",
        "Increases DMG by 15%.",
        "Increases DMG by 25%."
      ],
      "uniqueTreasure": {
        "name": "Childhood Memory",
        "effect": [
          "[Infinite Potential] Dispels negative effects from self and increases DMG by 20%.",
          "[Infinite Potential] Dispels negative effects from self and increases DMG by 24%.",
          "[Infinite Potential] Dispels negative effects from self and increases DMG by 29%.",
          "[Infinite Potential] Dispels negative effects from self and increases DMG by 35%.",
          "[Infinite Potential] Dispels negative effects from self and increases DMG by 42%.",
          "[Infinite Potential] Dispels negative effects from self and increases DMG by 50%."
        ]
      }
    },
    {
      "id": 3,
      "skillInfo": [
        {
          "skillNumber": "s3",
          "name": "WA-TAAAAAH!!!",
          "description": "Deals ??? P.DMG over 6 attacks to nearby enemies in a circular range of self. Afterward, deals ??? P.DMG to the target and its nearby enemies, knocking them down for 4 sec. While under [Infinite Potential], [Special Move. Meteor Kick!!!] becomes available for 10 sec.",
          "cooldown": 21,
          "cost": 3
        },
        {
          "skillNumber": "s3_2",
          "name": "Special Move. Meteor Kick!!!",
          "description": "Launches a full force attack that deals ??? P.DMG to the target and enemies nearby, stunning them for 5 sec. This Skill will always be a Critical Hit.",
          "cooldown": 0,
          "cost": 1,
          "linked": "s3_0"
        }
      ],
      "light": "Increases DMG by 100% when there is only 1 enemy left.",
      "dark": "Gains immunity to CC for the duration of Skill.",
      "books": [
        "Increases DMG by 10%.",
        "Increases DMG by 15%.",
        "Increases DMG by 25%."
      ],
      "uniqueTreasure": {
        "name": "Moment of Respite",
        "effect": [
          "[WA-TAAAAAH!!!] Increases own DMG to Boss by 4% per every Skill use. This effect can be stacked up to max 10 times. Reduces Mana Cost of [Special Move. Meteor Kick!!!] by 1.",
          "[WA-TAAAAAH!!!] Increases own DMG to Boss by 4.8% per every Skill use. This effect can be stacked up to max 10 times. Reduces Mana Cost of [Special Move. Meteor Kick!!!] by 1.",
          "[WA-TAAAAAH!!!] Increases own DMG to Boss by 5.8% per every Skill use. This effect can be stacked up to max 10 times. Reduces Mana Cost of [Special Move. Meteor Kick!!!] by 1.",
          "[WA-TAAAAAH!!!] Increases own DMG to Boss by 7% per every Skill use. This effect can be stacked up to max 10 times. Reduces Mana Cost of [Special Move. Meteor Kick!!!] by 1.",
          "[WA-TAAAAAH!!!] Increases own DMG to Boss by 8.4% per every Skill use. This effect can be stacked up to max 10 times. Reduces Mana Cost of [Special Move. Meteor Kick!!!] by 1.",
          "[WA-TAAAAAH!!!] Increases own DMG to Boss by 10% per every Skill use. This effect can be stacked up to max 10 times. Reduces Mana Cost of [Special Move. Meteor Kick!!!] by 1."
        ]
      }
    },
    {
      "id": 4,
      "skillInfo": [
        {
          "skillNumber": "s4",
          "name": "Inborn Talent",
          "description": "Increases own DEF by ??? and Crit Chance by 200. Cecilia's Normal and Skill attacks will not miss."
        }
      ],
      "light": "Takes 15% reduced DMG.",
      "dark": "Increases DMG to Heroes by 15%.",
      "books": [
        "Increases DEF Boost by 10%.",
        "Increases DEF Boost by 15%.",
        "Increases DEF Boost by 25%."
      ],
      "uniqueTreasure": {
        "name": "Heart of Justice",
        "effect": [
          "[Inborn Talent] At the beginning of each battle, deals 10% increased DMG to Non-Hero enemies and takes 25% reduced DMG for 20 sec.",
          "[Inborn Talent] At the beginning of each battle, deals 12% increased DMG to Non-Hero enemies and takes 25% reduced DMG for 20 sec.",
          "[Inborn Talent] At the beginning of each battle, deals 14% increased DMG to Non-Hero enemies and takes 25% reduced DMG for 20 sec.",
          "[Inborn Talent] At the beginning of each battle, deals 17% increased DMG to Non-Hero enemies and takes 25% reduced DMG for 20 sec.",
          "[Inborn Talent] At the beginning of each battle, deals 21% increased DMG to Non-Hero enemies and takes 25% reduced DMG for 20 sec.",
          "[Inborn Talent] At the beginning of each battle, deals 25% increased DMG to Non-Hero enemies and takes 25% reduced DMG for 20 sec."
        ]
      }
    }
  ],
  "light": "ATK, DEF, HP+15% / Crit DMG +20%",
  "dark": "Attacking the enemy with the additional DMG gained from [Infinite Potential] will increase own ATK by 0.5%. This effect can be stacked up to max 200 times and is irremovable.",
  "background": {
    "profile": {
      "gender": "Female",
      "race": "Human",
      "age": "16 Years",
      "height": "169 cm",
      "birthday": "8(Month) 19(Day), Month of Vitality",
      "constellation": "Kandala the Conqueror",
      "likes": "Harmonica, spicy noodles, betting, a running race.",
      "dislikes": "Injustice, lame jokes, nagging, snakes"
    },
    "story": "A girl that dreams of a world without injustice. Cecilia, also known as the Crimson Wind of Justice, defeats enemies with her windily kicks, flying her red ribbon in the air. Her grandfather is Ricardo, the captain of Orvelia Holy Knights. She grew up watching her grandfather render justice with his heart of steel, and now dreams of realizing justice and eradicating the evil in the Empire as a member of the Resistance. Ricardo is worried for his little granddaughter since her pursuit of justice might lead her to danger. However, her shouts and kicks are always dynamic and heroic, and such worries don't bother her at all.",
    "itemIntroductions": {
      "weapon": "A pair of technomagical boots made mainly with the Magic Stone of Tempest excavated from the ancient technomagic ruins. Whenever their wearer attacks, the magic stone releases an energy wave that allows the wearer to achieve supersonic speed and a power destructive enough to bend metal pillars like taffy. In fact, it was Ricardo who gave Cecilia the Magic Stone of Tempest, the core material of these boots. According to her, Ricardo was keeping it safe, though he never told her where he got it. One day, Ricardo came to visit Cecilia in the Empire, and Cecilia told him that she would join the Resistance. He saw from her eyes that her mind was set. He then gave her the Magic Stone of Tempest, saying, 'Show the world what you believe in.' Later, Landet, the geek engineer of the Resistance recognized the value of the Magic Stone and created these powerful boots.",
      "soul": "Mad Engineer Landet is legendary figure who is considered as the top engineer in the fields of technomagic, mechanical engineering, and many more.\nHowever, he is also a man of extremely erratic personality, and so all workshops in the Empire refuse to accept him into their group.\n\nLandet called his creations his children, and treated them as if they were living beings with personalities\nIf one wanted to make Landet get furious, he/she would abuse his creations, and use them for a purpose agains Landet's will.\n\nBut there is a saying that an artiscan's creation harbor a soul within them.\nPerhaps Landet wishes more than any artists to imbue soul into all his creations.\nThat engineer with a spirit of an artisan, after hearing Cecilia's purpose and goals, offered his hands to Cecilia, and created the ultimate magnum opus with all his skills.\n\nSupersonic Tempest, Gigantix: It is Cecilia's soul mate, her partner which will boost Cecilia's justice like a wing.\n\nCecilia,carrying with her strength, dream, and hope, charges heads on for true justice once again.",
      "treasures": [
        "A pair of specially made boots that Cecilia used to wear before she got the boots she wears now. After years of training in different martial arts, she developed her own style of fighting that largely depended on her quick legs. To prove herself to her grandfather, she trained hard in these specially made boots. The scuffs and scratches on the boots are glorious scars from those days of intense work.",
        "Balls that Cecilia used to kick around. Especially, the soccer ball helped her improve her kicking skills. She was always the leader of the kids in the neighborhood, and she always kept the balls close to her as a memento of her carefree childhood. She takes them out whenever she feels a little depressed or frustrated.",
        "A harmonica that Cecilia likes to play in her free time. It was a gift that Ricardo gave her on her 15th birthday. He was worried that his granddaughter might forget to relax every once in a while on her journey to realize a just world. After a long consideration, he gave Cecilia this small harmonica with her name engraved on it. However, Cecilia never bothered to learn more than one song, not knowing about her grandfather's intentions.",
        "A gift that Cecilia received in return for her first-ever act of justice. In the past, a little girl that Cecilia rescued tied this red ribbon around the wound she got while saving the girl from danger. Thereafter, she always wore it on her wrist while on her missions, and people started to call her the Crimson Wind of Justice."
      ]
    }
  },
  "skins": ["Beachside", "Werewolf Girl", "Christmas of Justice"],
  "voice": {
    "actor": {
      "jp": "N/A",
      "kr": "N/A",
      "en": "N/A"
    },
    "lines": {
      "jp": [],
      "kr": [],
      "en": []
    }
  }
}