{
  "name": "Kirze",
  "title": "Crimson Crystal Cat",
  "class": "warrior",
  "damageType": "magical",
  "position": "Front",
  "weapon": {
    "uniqueWeapon": {
      "name": "Judgment Edge, Elicipira",
      "effect": [
        "Amplifies the power of Arcane Crystals and greatly increases the effect range of [Bloom, Crimson Flower!]. Normal and Skill attacks have a 4% chance to deal additional M.DMG equal to 500% of ATK. DMG is doubled against Bosses.",
        "Amplifies the power of Arcane Crystals and greatly increases the effect range of [Bloom, Crimson Flower!]. Normal and Skill attacks have a 4% chance to deal additional M.DMG equal to 600% of ATK. DMG is doubled against Bosses.",
        "Amplifies the power of Arcane Crystals and greatly increases the effect range of [Bloom, Crimson Flower!]. Normal and Skill attacks have a 4% chance to deal additional M.DMG equal to 720% of ATK. DMG is doubled against Bosses.",
        "Amplifies the power of Arcane Crystals and greatly increases the effect range of [Bloom, Crimson Flower!]. Normal and Skill attacks have a 4% chance to deal additional M.DMG equal to 860% of ATK. DMG is doubled against Bosses.",
        "Amplifies the power of Arcane Crystals and greatly increases the effect range of [Bloom, Crimson Flower!]. Normal and Skill attacks have a 4% chance to deal additional M.DMG equal to 1000% of ATK. DMG is doubled against Bosses.",
        "Amplifies the power of Arcane Crystals and greatly increases the effect range of [Bloom, Crimson Flower!]. Normal and Skill attacks have a 4% chance to deal additional M.DMG equal to 1250% of ATK. DMG is doubled against Bosses."
      ]
    },
    "soulWeapon": {
      "advancement0": "Summons the soul of Judgment Edge, Elicipira, changing the activation chance of the additional M.DMG effect of Judgment Edge, Elicipira to 10% and reducing All DMG taken by 40% for 10 sec.",
      "advancement1": "For the duration of Skill, increases ATK by 50.",
      "advancement2": "Increases the duration of the effect by 5 sec and changes the activation chance of Judgment Edge, Elicipira to 15%.",
      "activation": "Charges up upon dealing DMG 60 times.",
      "cd": 25,
      "charges": 7
    }
  },
  "skills": [
    {
      "id": 1,
      "skillInfo": [
        {
          "skillNumber": "s1",
          "name": "Slash, Blade of Judgment!",
          "description": "Deals a total of ??? M.DMG over 7 attacks to nearby enemies in a circular range of self. Then, attacks frontal enemies in range, dealing ??? M.DMG and knocking them down for 3 sec.",
          "cooldown": 9,
          "cost": 2
        }
      ],
      "light": "Reduces Cooldown by ???% per each enemy hit.",
      "dark": "If there is only 1 enemy, DMG is increased by 100%.",
      "books": [
        "Increases DMG by 10%.",
        "Increases DMG by 15%.",
        "Increases DMG by 25%."
      ],
      "uniqueTreasure": {
        "name": "Lotus of Crimson Crystal",
        "effect": [
          "[Slash, Blade of Judgment!] Increases DMG by 20% and reduces Mana Cost by 1.",
          "[Slash, Blade of Judgment!] Increases DMG by 24% and reduces Mana Cost by 1.",
          "[Slash, Blade of Judgment!] Increases DMG by 29% and reduces Mana Cost by 1.",
          "[Slash, Blade of Judgment!] Increases DMG by 35% and reduces Mana Cost by 1.",
          "[Slash, Blade of Judgment!] Increases DMG by 42% and reduces Mana Cost by 1.",
          "[Slash, Blade of Judgment!] Increases DMG by 50% and reduces Mana Cost by 1."
        ]
      }
    },
    {
      "id": 2,
      "skillInfo": [
        {
          "skillNumber": "s2",
          "name": "Disperse, Crystal Haze!",
          "description": "Unleashes the power of Arcane Crystals within to deal ??? M.DMG to all enemies and stun them for 1 sec. Upon casting, activates [Arcane Crystal Awakening] for 15 sec, which increases ATK Spd of all allies by 300 and releases a shockwave every 2 sec to enemies in range of self, dealing ??? M.DMG and stunning them for 0.5 sec.",
          "cooldown": 20,
          "cost": 3
        }
      ],
      "light": "The duration of stun from the shockwave increases by 0.5 sec against Non-Hero enemies.",
      "dark": "While under [Arcane Crystal Awakening], self deals 20% increased DMG to Non-Hero enemies.",
      "books": [
        "Increases DMG by 10%.",
        "Increases DMG by 15%.",
        "Increases DMG by 25%."
      ],
      "uniqueTreasure": {
        "name": "Remnant of Hobby",
        "effect": [
          "[Disperse, Crystal Haze!] Increases ATK Spd by an additional 100 and the duration of [Arcane Crystal Awakening] by 7 sec.",
          "[Disperse, Crystal Haze!] Increases ATK Spd by an additional 120 and the duration of [Arcane Crystal Awakening] by 7 sec.",
          "[Disperse, Crystal Haze!] Increases ATK Spd by an additional 140 and the duration of [Arcane Crystal Awakening] by 7 sec.",
          "[Disperse, Crystal Haze!] Increases ATK Spd by an additional 170 and the duration of [Arcane Crystal Awakening] by 7 sec.",
          "[Disperse, Crystal Haze!] Increases ATK Spd by an additional 210 and the duration of [Arcane Crystal Awakening] by 7 sec.",
          "[Disperse, Crystal Haze!] Increases ATK Spd by an additional 250 and the duration of [Arcane Crystal Awakening] by 7 sec."
        ]
      }
    },
    {
      "id": 3,
      "skillInfo": [
        {
          "skillNumber": "s3",
          "name": "Bloom, Crimson Flower!",
          "description": "Summons Arcane Crystals and deals ??? M.DMG to frontal enemies in a straight line. Shortly afterward, causes an explosion that deals ??? additional M.DMG and inflicts [Arcane Crystal Curse] upon enemies for 10 sec, reducing their ATK Spd by 200. Attacking enemies under [Arcane Crystal Curse] inflicts a stack of [Arcane Crystal Energy]. [Arcane Crystal Curse] explodes after 10 sec, dealing M.DMG equal to ??? + ??? per stack of Arcane Crystal Energy.",
          "cooldown": 20,
          "cost": 4
        }
      ],
      "light": "Increases ATK Spd reduction by 300.",
      "dark": "If there is only 1 enemy, inflicts 2 stacks of Arcane Crystal Energy.",
      "books": [
        "Increases DMG by 10%.",
        "Increases DMG by 15%.",
        "Increases DMG by 25%."
      ],
      "uniqueTreasure": {
        "name": "Reminiscence of Escape",
        "effect": [
          "[Bloom, Crimson Flower!] Decreases Cooldown by 30%, and gaining 1 stack of [Arcane Crystal Energy] has a 40% chance to add 3 additional stacks.",
          "[Bloom, Crimson Flower!] Decreases Cooldown by 30%, and gaining 1 stack of [Arcane Crystal Energy] has a 48% chance to add 3 additional stacks.",
          "[Bloom, Crimson Flower!] Decreases Cooldown by 30%, and gaining 1 stack of [Arcane Crystal Energy] has a 58% chance to add 3 additional stacks.",
          "[Bloom, Crimson Flower!] Decreases Cooldown by 30%, and gaining 1 stack of [Arcane Crystal Energy] has a 70% chance to add 3 additional stacks.",
          "[Bloom, Crimson Flower!] Decreases Cooldown by 30%, and gaining 1 stack of [Arcane Crystal Energy] has a 84% chance to add 3 additional stacks.",
          "[Bloom, Crimson Flower!] Decreases Cooldown by 30%, and gaining 1 stack of [Arcane Crystal Energy] has a 100% chance to add 3 additional stacks."
        ]
      }
    },
    {
      "id": 4,
      "skillInfo": [
        {
          "skillNumber": "s4",
          "name": "End to Evil Deeds!",
          "description": "Increases own ATK by ??? and Crit Chance by 200 , while increasing the duration of CCs that all allies inflict to Bosses by ???%."
        }
      ],
      "light": "At the beginning of each battle, self deals 25% increased DMG to Non-Hero enemies for 20 sec.",
      "dark": "Deals ???% increased DMG to Bosses.",
      "books": [
        "Increases ATK Boost by 10%.",
        "Increases ATK Boost by 15%.",
        "Increases ATK Boost by 25%."
      ],
      "uniqueTreasure": {
        "name": "Moment of Peace",
        "effect": [
          "[End to Evil Deeds!] Increases Crit Chance by an additional 250 and the effect of the duration of CC increase changes to 30%.",
          "[End to Evil Deeds!] Increases Crit Chance by an additional 250 and the effect of the duration of CC increase changes to 32%.",
          "[End to Evil Deeds!] Increases Crit Chance by an additional 250 and the effect of the duration of CC increase changes to 34%.",
          "[End to Evil Deeds!] Increases Crit Chance by an additional 250 and the effect of the duration of CC increase changes to 37%.",
          "[End to Evil Deeds!] Increases Crit Chance by an additional 250 and the effect of the duration of CC increase changes to 41%.",
          "[End to Evil Deeds!] Increases Crit Chance by an additional 250 and the effect of the duration of CC increase changes to 45%."
        ]
      }
    }
  ],
  "light": "ATK, DEF, HP+15% / ATK Spd +100",
  "dark": "Every normal and Skill attack increases ATK Spd by 5. This effect can be stacked up to max 100 times.",
  "background": {
    "profile": {
      "gender": "Female",
      "race": "Animal Hybrid (Cat)",
      "age": "16 Years",
      "height": "162 cm",
      "birthday": "4(Month) 29(Day), Month of Life",
      "constellation": "Armil the Saint",
      "likes": "Rag doll, cool riverbank, small animals, child's laughter",
      "dislikes": "Demons, nasty bugs, rude people"
    },
    "story": "Hero Concept Design Contest Winner Mochi00 (JPN)\n\nFew years ago, small towns all over Orbis were attacked by the undead army of Malduk. They were seeking out albino kids, ones who were born with unique and powerful magic. Malduk's subordinates captured these children, and injected them with crimson arcane crystals, a powerful energy source for Demons. The goal of this experiment was to transform them into crimson arcane crystal living mines - that would mass produce crimson arcane crystals until the moment they die. Pain from the inhumane experiment took its toll on the children and one by one, losing their lives. Children who weren't compatible with the crimson arcane crystal were petrified and crumbled into dust. The remaining children who witnessed this horror were shaking with fear, and hopelessly awaited their death. But the experiment finally came to a success. Crimson arcane crystals resonated with Kirze, and she absorbed all the crystals in the area. As a result, she gained vast amount of mana and gained ability to manipulate crimson arcane crystals at her will. With her new found power, Kirze defeated Malduk's subordinates and fled from the lab with the surviving children. In the hopes of preventing further casualties like herself, Kirze took off and began to hunt rouge demons that crossed her path...",
    "itemIntroductions": {
      "weapon": "Giant scissors created with crimson arcane crystals that form Kirze's body. They are based on antique scissors her mother used to have. It is a very versatile weapon that can be swung like a great sword or split into two like double swords. The weapon is built with prayers of a girl who wants no one to be tormented by the Demons anymore. These scissors resonate with her emotions to unleash greater power.",
      "soul": "The place where the Crimson Arcane Crystals first appeared is known as the dimensional border between the Pandemonium and the material world.\nNo one knows how and why the crystal was made, but it is told that the crystal was made by combining both power of the material world and the power of Pandemonium...\nAccording to rumors, there exists a gigantic Crimson Arcane Crystal on the dimensional border and that is the first Crimson Arcane Crystal.\nAccording to the records, there were many dark wizards who attempted to absorb the power of the first Arcane Crystal for themselves to no avail.\nKirze, after awakening the power of her soul, unleashed the power of the Crimson Arcane Crystal, her source of power, and infused it to her weapon.\nThe power that Elicipira harnessed through the very first Arcane Crystal was stronger than any power Kirze had harnessed. However, along with that great power, a great fear swept her.\n\nKirze felt that as she utilized that power, her mind was gradually turning into a Crimson Arcane Crystal.\nIt was as if she was losing her humanity more and more.",
      "treasures": [
        "Crystal fragments sometimes sprout from Kirze's body and fall off. Unable to toss away what used to be part of her body, she picks them up and collects them. While being unsure of what to do with her growing collection, she stopped by Orvel, and a glass decoration in May's General Shop caught her eyes. Kirze thought it was beautiful, and with high hopes, gave all the fragments she collected to May. In return, May gave her the first piece she made using those fragments - this crimson lotus trinket as a gift.",
        "Kirze adores dolls ever since she was a child, but all she had were rag dolls her mother made for her since her family did not have good living. While living with her mother, Kirze was able to learn some tips and tricks for sewing and doll making. After all this time, she still loves dolls, but now she makes them not only for herself but for others as well. Especially for children who lost their loved ones at the hands of rouge Demons.",
        "The first makeshift weapon Kirze made when she escaped from the Demon lab. They were made in haste- since this was her first time she resonated with the crimson arcane crystals- just so that she can escape. This pair of daggers are barely finished, crude and on the verge of breaking. These daggers are the very weapons that saved her and the other children. They hold important memory, so she carries them as keepsakes.",
        "Sewing tool that Kirze uses for her hobby. It is a must for her doll making pastime. Recently she was able to get her hands on special kinds of string and cotton. She can happily make better dolls with them. On the side note, the scissors are miniature version of her weapon."
      ]
    }
  },
  "skins": [],
  "voice": {
    "actor": {
      "jp": "Kanda Akemi",
      "kr": "Kim Hyun Ji",
      "en": "N/A"
    },
    "lines": {
      "jp": [],
      "kr": [],
      "en": []
    }
  }
}
