{
  "name": "Pansirone",
  "title": "Psychotic Flame",
  "class": "mechanic",
  "damageType": "physical",
  "position": "Middle",
  "weapon": {
    "uniqueWeapon": {
      "name": "Roar of Raging Heat, Tersia",
      "effect": [
        "Each attack on an enemy inflicted with Eternal Blaze increases own ATK and DEF by 1%, and DMG dealt from Eternal Blaze by 1%. This effect can be stacked up to max 20 times.",
        "Each attack on an enemy inflicted with Eternal Blaze increases own ATK and DEF by 1.2%, and DMG dealt from Eternal Blaze by 1.2%. This effect can be stacked up to max 20 times.",
        "Each attack on an enemy inflicted with Eternal Blaze increases own ATK and DEF by 1.4%, and DMG dealt from Eternal Blaze by 1.4%. This effect can be stacked up to max 20 times.",
        "Each attack on an enemy inflicted with Eternal Blaze increases own ATK and DEF by 1.7%, and DMG dealt from Eternal Blaze by 1.7%. This effect can be stacked up to max 20 times.",
        "Each attack on an enemy inflicted with Eternal Blaze increases own ATK and DEF by 2.1%, and DMG dealt from Eternal Blaze by 2.1%. This effect can be stacked up to max 20 times.",
        "Each attack on an enemy inflicted with Eternal Blaze increases own ATK and DEF by 2.5%, and DMG dealt from Eternal Blaze by 2.5%. This effect can be stacked up to max 20 times."
      ]
    },
    "soulWeapon": {
      "advancement0": "Summons the soul of Roar of Raging heat, Tersia, increasing Pansirone's ATK Spd by 500 for 8 sec. Afterward, attacks enemies in a wide frontal range 3 times, dealing total of ??? P.DMG. The last hit places 'Tersia's Prank' on a wide frontal range for 8 sec, dealing ??? P.DMG every 1 sec and increasin P.DMG the targets take by 25%. If the target is inflicted with 'Eternal Blaze', the increased P.DMG the target takes changes to 35%.",
      "advancement1": "Increases DMG by 100%.",
      "advancement2": "The duration of the ATK Spd Boost effect and 'Teria's Prank' increases by 4 sec.",
      "activation": "Charges up upon dealing DMG 85 times.",
      "cd": 18,
      "charges": 5
    }
  },
  "skills": [
    {
      "id": 1,
      "skillInfo": [
        {
          "skillNumber": "s1",
          "name": "A Present For You!",
          "description": "Attacks the enemy and enemies neraby within a wide range, dealing ??? P.DMG and inflicting them with 'Eternal Blaze'. Enemies inflicted with 'Eternal Blaze' take a total of ??? P.DMG over 10 sec and their Heal Rate reduced by 25%. after use of this skill, [Now D.I.E!] can be used within 10 sec.",
          "cooldown": 22,
          "cost": 2
        },
        {
          "skillNumber": "s1_2",
          "name": "Now D.I.E!",
          "description": "Attacks enemies in a wide frontal range 7 times, dealing ??? P.DMG each hit. If the target is not a Hero, deals ??? additional P.DMG. Enemies inflicted with 'Eternal Blaze' take ??? additional P.DMG each hit.",
          "cost": 2,
          "linked": "s1"
        }
      ],
      "light": "[A Present for You!] Hit enemy takes 25% increased P.DMG for 10 sec.",
      "dark": "[Now D.I.E!] Gains immunity to CC for the duration of the skill.",
      "books": [
        "Increases DMG by 10%",
        "Increases DMG by 15%",
        "Increases DMG by 25%"
      ],
      "uniqueTreasure": {
        "name": "Incomprehensible Framed Painting",
        "effect": [
          "[A Present For You!] Reduces Mana Cost by 1.\n[Now D.I.E!] Increases DMG by 20%.",
          "[A Present For You!] Reduces Mana Cost by 1.\n[Now D.I.E!] Increases DMG by 24%.",
          "[A Present For You!] Reduces Mana Cost by 1.\n[Now D.I.E!] Increases DMG by 29%.",
          "[A Present For You!] Reduces Mana Cost by 1.\n[Now D.I.E!] Increases DMG by 35%.",
          "[A Present For You!] Reduces Mana Cost by 1.\n[Now D.I.E!] Increases DMG by 42%.",
          "[A Present For You!] Reduces Mana Cost by 1.\n[Now D.I.E!] Increases DMG by 50%."
        ]
      }
    },
    {
      "id": 2,
      "skillInfo": [
        {
          "skillNumber": "s2",
          "name": "The Thrill! How Exciting!!",
          "description": "Hit enemies within range of self 12 times, dealing a total of ??? P.DMG, and increasing own ATK by ??? and DEF Penetration by 500 for 15 sec.",
          "cooldown": 20,
          "cost": 2
        }
      ],
      "light": "Reduces Mana Cost by 1.",
      "dark": "Upon activation, HP does not fall below 10% for 5 sec.",
      "books": [
        "Increases DMG by 10%",
        "Increases DMG by 15%",
        "Increases DMG by 25%"
      ],
      "uniqueTreasure": {
        "name": "Special Fuel Tank",
        "effect": [
          "[The Thrill! How Exciting!!] Upon using the Skill, dispels negative effects from self and gains immunity to CC for 4 sec up activation.",
          "[The Thrill! How Exciting!!] Upon using the Skill, dispels negative effects from self and gains immunity to CC for 4.8 sec up activation.",
          "[The Thrill! How Exciting!!] Upon using the Skill, dispels negative effects from self and gains immunity to CC for 5.8 sec up activation.",
          "[The Thrill! How Exciting!!] Upon using the Skill, dispels negative effects from self and gains immunity to CC for 7 sec up activation.",
          "[The Thrill! How Exciting!!] Upon using the Skill, dispels negative effects from self and gains immunity to CC for 8.4 sec up activation.",
          "[The Thrill! How Exciting!!] Upon using the Skill, dispels negative effects from self and gains immunity to CC for 10 sec up activation."
        ]
      }
    },
    {
      "id": 3,
      "skillInfo": [
        {
          "skillNumber": "s3",
          "name": "Don't You Dare Run!",
          "description": "Attacks a random enemy 10 times, dealing a total of ??? P.DMG. Attack the same target icnreases DMG by ??? each hit.",
          "cooldown": 21,
          "cost": 3
        } 
      ],
      "light": "Inflicts stun on the hit enemy for 2 sec.",
      "dark": "Increases Mana Cost by 2, and changes of targets to 3.",
      "books": [
        "Increases DMG by 10%",
        "Increases DMG by 15%",
        "Increases DMG by 25%"
      ],
      "uniqueTreasure": {
        "name": "Elemtal's Cottage",
        "effect": [
          "[Don't You Dare Run!] Increases DMG by 50%, and each hit increases Crit DMG by 2% for 10 sec. This effect can be stacked up to max 20 times.",
          "[Don't You Dare Run!] Increases DMG by 50%, and each hit increases Crit DMG by 2.4% for 10 sec. This effect can be stacked up to max 20 times.",
          "[Don't You Dare Run!] Increases DMG by 50%, and each hit increases Crit DMG by 2.9% for 10 sec. This effect can be stacked up to max 20 times.",
          "[Don't You Dare Run!] Increases DMG by 50%, and each hit increases Crit DMG by 3.5% for 10 sec. This effect can be stacked up to max 20 times.",
          "[Don't You Dare Run!] Increases DMG by 50%, and each hit increases Crit DMG by 4.2% for 10 sec. This effect can be stacked up to max 20 times.",
          "[Don't You Dare Run!] Increases DMG by 50%, and each hit increases Crit DMG by 5% for 10 sec. This effect can be stacked up to max 20 times"
        ]
      }
    },
    {
      "id": 4,
      "skillInfo": [
        {
          "skillNumber": "s4",
          "name": "Cruel Delight",
          "description": "Increawses ATK by ???, and DMG dealt to Non-Hero enemies by 30%. Attacking enemies inflicted with 'Eternal Blaze' reignites 'Eternal Blaze'."
        }
      ],
      "light": "Eternal Blaze becomes irremovable.",
      "dark": "Attacking the enemy inflicted with 'Eternal Blaze' 70 Mana each hit.",
      "books": [
        "Increases ATK Boost by 10%.",
        "Increases ATK Boost by 15%.",
        "Increases ATK Boost by 25%."
      ],
      "uniqueTreasure": {
        "name": "Letter of Appointment: Hound Unit Leader",
        "effect": [
          "[Cruel Delight] Increases Crit DMG by 50%, and reduces self's Cooldown of all Skills by 3 sec.",
          "[Cruel Delight] Increases Crit DMG by 50%, and reduces self's Cooldown of all Skills by 3.6 sec.",
          "[Cruel Delight] Increases Crit DMG by 50%, and reduces self's Cooldown of all Skills by 4.3 sec.",
          "[Cruel Delight] Increases Crit DMG by 50%, and reduces self's Cooldown of all Skills by 5.2 sec.",
          "[Cruel Delight] Increases Crit DMG by 50%, and reduces self's Cooldown of all Skills by 6.2 sec.",
          "[Cruel Delight] Increases Crit DMG by 50%, and reduces self's Cooldown of all Skills by 7.5 sec."
        ]
      }
    }
  ],
  "light": " ATK, DEF, HP+15% / Crit DMG +20%",
  "dark": "For 200 sec after the beginning of the battle, ATK increases by 5% for 15 sec every 10 sec. This effect can be stacked up to max 20 times.",
  "background": {
    "profile": {
      "gender": "Female",
      "race": "Human",
      "age": "19 Year",
      "height": "167 cm",
      "birthday": "8(Month) 1(Day), Month of Vitality",
      "constellation": "Kandala the Conquorer",
      "likes": "Tersia, Crispy Chips (chocolate-flavored), Deadly Sweet Laughing Strike Force (Next Level Humor Edition, Collector's Eddition)",
      "dislikes": "Tiresome things, powdered medicine"
    },
    "story": "A girl that used to be a member of the Hound Unit. She shows no mercy even to those who surrendered and abandoned their weapons. She displays madness and wishes to burn everything in sight. As of right now, only Crow can control her madness.\nAfter the disbandment of the Hound Unit, she was reinstated as an officer at the Machine Division of the Empire and had been wandering from ruin to ruin, completing her assignments.\nShe is infamous for not listening to her superiors or the system, making her known as a troublesome superior to other soldiers. The higher-ups regard her as a threat that may explode anytime.\nWhen it comes to her past endeavors, she becomes very protective. Thankfully, her colleagues from the Hound Unit do not try to pry into her past.",
    "itemIntroductions": {
      "weapon": "A new weapon provided by the army for Pansirone as she was assigned to the Hound Unit.\nNot satisfied with the standard flame-thrower, Pansirone upgraded her weapon on her with a fuel tank twice the size of a standard fuel tank and custome exhaust system that emits flames to no end.\nBlinded by the urge of wantign to burn everything in her sight, Pansirone ended up with a rather lousy upgrade. Looking at the finished so-called upgraded product, Valance clicked her tounge in disapproval.\nUnable to let it go, Valance then took Pansirone's upgraded weapon and came back with a weapon that can spout scorching flames that can burn enything it thouches through the amazing technology of Magos Le'Flamme. Dissatisfied with the appearance of her new weapon, Pansirone customized her weapon to her liking and decided to name it Tersia after her friend.",
      "treasures": [
        "A painting obtained by Pansirone half-threatening steet artists.\nAccourding to Pansirone, the flames of the picture are how her mysterious friend that always stays by her side looks like when is angry.\nBut all it seems like is something on fire to others.\nOne wonders what the other members of the Hound Unit were thinking when Pansirone happily introduced her friend with her finished painting...\nIt looks like they decided to believe her words for now, seeing that they ask about how her friend is doing from time to time.",
        "A special fuel tank made by Valance for more firepower.\nThe core of the fuel tank is the liquid inside, It carries a scent that Tersia likes, making her excited so that she can create stronger flames than usual.\nThe problem is, this liquid can be only obtain from a specific monster on the outskirts of the Empire, and it has a strong acidic property that corrodes metal. Therefore, requiring a special coating that can withstand the liquid's acidic property. Valance pitched in to help. However, as it is a highly flammable and easily spoiled, it was decided to store it in smaller doses. Thus, this special tank was designed more efficiently, reducing size by one-third.",
        "Where Tersia, the elemental of fire that protects Pansirone, rests. It is made of heat-blocking steel so that it does not become hot even if Tersia is inside.\nPansirone wanted to show her little friend resting in her birdcage, but unfortunately, since people from the Empire are unable to see elementals, all they see is an empty birdcage.",
        "A letter of appointment presented by and presented to herself, Pansirone, after she was deployed to the Hound Unit.\nShe stole one of the templates from the empire to create it.\n\n 'I hereby appoint myself as the Team Leader of the Hound Unit Team 2! I am the Team Leader! No Buts!\n- Pansirone'"
      ]
    }
  },
  "skins": [
    ""
  ],
  "voice": {
    "actor": {
      "jp": "N/A",
      "kr": "N/A",
      "en": "N/A"
    },
    "lines": {
      "jp": [],
      "kr": [],
      "en": []
    }
  }
}