{
    "name": "Roi",
    "title": "Swift Assassin",
    "class": "assassin",
    "damageType": "physical",
    "position": "Front",
    "weapon": {
        "uniqueWeapon": {
            "name": "Specter's Breath, Redeal",
            "effect": [
                "Each auto attack has a 25% chance of inflicting 1 stack of Bleed, and dealing 50% of ATK as extra DMG.",
                "Each auto attack has a 28% chance of inflicting 1 stack of Bleed, and dealing 60% of ATK as extra DMG.",
                "Each auto attack has a 31% chance of inflicting 1 stack of Bleed, and dealing 72% of ATK as extra DMG.",
                "Each auto attack has a 34% chance of inflicting 1 stack of Bleed, and dealing 86% of ATK as extra DMG.",
                "Each auto attack has a 37% chance of inflicting 1 stack of Bleed, and dealing 103% of ATK as extra DMG.",
                "Each auto attack has a 40% chance of inflicting 1 stack of Bleed, and dealing 125% of ATK as extra DMG."
            ]
        },
        "soulWeapon": {
            "advancement0": "Summons the soul of Specter's Breath, Redeal for 12 sec, increasing own Crit DMG by 80%. Each time Roi casts Blade Claw, the soul of Specter's Breath, Redeal deals ??? additional DMG.",
            "advancement1": "Reduces Cooldown by 7 sec.",
            "advancement2": "Inflicts 1 stack(s) of Bleed on the hit enemy.",
            "activation": "Charges up over 22 sec.",
            "cd": 25,
            "charges": 7
        }
    },
    "skills": [
        {
            "id": 1,
            "skillInfo": [
                {
                    "skillNumber": "s1",
                    "name": "Merciless",
                    "description": "Attacks a random enemy 3 times, dealing a total of ??? P.DMG and inflicting 1 stack of Bleed on them that deals ??? P.DMG over 16 sec. Bleed can be stacked up to max 3 times.",
                    "cooldown": 8,
                    "cost": 2
                }
            ],
            "light": "Mana cost is reduced by 1.",
            "dark": "Target takes 25% increased P.DMG for 10 sec.",
            "books": [
                "DMG is increased by 10%.",
                "DMG is increased by 15%.",
                "Crit DMG is increased by 50%."
            ],
            "uniqueTreasure": {
                "name": "Shadow Blade",
                "effect": [
                    "[Merciless] Dispels all negative effects from self, and recovers Mana by 200 upon Critical Hit.",
                    "[Merciless] Dispels all negative effects from self, and recovers Mana by 240 upon Critical Hit.",
                    "[Merciless] Dispels all negative effects from self, and recovers Mana by 290 upon Critical Hit.",
                    "[Merciless] Dispels all negative effects from self, and recovers Mana by 350 upon Critical Hit.",
                    "[Merciless] Dispels all negative effects from self, and recovers Mana by 420 upon Critical Hit.",
                    "[Merciless] Dispels all negative effects from self, and recovers Mana by 500 upon Critical Hit."
                ]
            }
        },
        {
            "id": 2,
            "skillInfo": [
                {
                    "skillNumber": "s2",
                    "name": "Curtain of Darkness",
                    "description": "For 10 sec, ATK is increased by ??? and Dodges all P.DMG attacks.",
                    "cooldown": 15,
                    "cost": 2
                }
            ],
            "light": "ATK boost is increased by 40%.",
            "dark": "Auto attack DMG is boosted by 100% for the duration.",
            "books": [
                "ATK boost is increased by 10%.",
                "ATK boost is increased by 15%.",
                "ATK Spd is increased by 250 for the duration of skill."
            ],
            "uniqueTreasure": {
                "name": "Soma's Hood",
                "effect": [
                    "[Curtain of Darkness] Increases ATK Boost by 20% and gains CC resist by 400 for the skill's duration.",
                    "[Curtain of Darkness] Increases ATK Boost by 24% and gains CC resist by 400 for the skill's duration.",
                    "[Curtain of Darkness] Increases ATK Boost by 29% and gains CC resist by 400 for the skill's duration.",
                    "[Curtain of Darkness] Increases ATK Boost by 35% and gains CC resist by 400 for the skill's duration.",
                    "[Curtain of Darkness] Increases ATK Boost by 42% and gains CC resist by 400 for the skill's duration.",
                    "[Curtain of Darkness] Increases ATK Boost by 50% and gains CC resist by 400 for the skill's duration."
                ]
            }
        },
        {
            "id": 3,
            "skillInfo": [
                {
                    "skillNumber": "s3",
                    "name": "Blade Claw",
                    "description": "Moves behind the enemy with the lowest HP and deals [FFC800] ??? P.DMG. Per every stacked Bleed, DMG is increased by 50% and all stacks of Bleed are removed after the attack. Upon Crit Hit, recovers 2 MP and skill cooldown is reset.",
                    "cooldown": 20,
                    "cost": 3
                }
            ],
            "light": "In exchange for 1 additional Mana Cost, DMG dealt is increased by 100%.",
            "dark": "Cooldown is removed.",
            "books": [
                "DMG is increased by 10%.",
                "DMG is increased by 15%.",
                "Crit DMG is increased by 50%."
            ],
            "uniqueTreasure": {
                "name": "Cracked Mask",
                "effect": [
                    "[Blade Claw] DMG is increased by 20%, and Upon Crit Hit, mana is recovered by 300.",
                    "[Blade Claw] DMG is increased by 24%, and Upon Crit Hit, mana is recovered by 300.",
                    "[Blade Claw] DMG is increased by 29%, and Upon Crit Hit, mana is recovered by 300.",
                    "[Blade Claw] DMG is increased by 35%, and Upon Crit Hit, mana is recovered by 300.",
                    "[Blade Claw] DMG is increased by 42%, and Upon Crit Hit, mana is recovered by 300.",
                    "[Blade Claw] DMG is increased by 50%, and Upon Crit Hit, mana is recovered by 300."
                ]
            }
        },
        {
            "id": 4,
            "skillInfo": [
                {
                    "skillNumber": "s4",
                    "name": "Hack",
                    "description": "If a normal attack is landed as a Critical Hit, attacks the target 6 times to deal a total of ??? additional P.DMG."
                }
            ],
            "light": "Each attack recovers 300 mana.",
            "dark": "Has a 50% chance to stack 1 stack of Bleed.",
            "books": [
                "DMG is increased by 10%.",
                "DMG is increased by 15%.",
                "Crit DMG is increased by 50%."
            ],
            "uniqueTreasure": {
                "name": "Specter's Ring",
                "effect": [
                    "[Hack] Increases DMG by 50%. Upon a Critical Hit, increases own ATK Spd by 200 for 5 sec.",
                    "[Hack] Increases DMG by 50%. Upon a Critical Hit, increases own ATK Spd by 240 for 5 sec.",
                    "[Hack] Increases DMG by 50%. Upon a Critical Hit, increases own ATK Spd by 290 for 5 sec.",
                    "[Hack] Increases DMG by 50%. Upon a Critical Hit, increases own ATK Spd by 350 for 5 sec.",
                    "[Hack] Increases DMG by 50%. Upon a Critical Hit, increases own ATK Spd by 420 for 5 sec.",
                    "[Hack] Increases DMG by 50%. Upon a Critical Hit, increases own ATK Spd by 500 for 5 sec."
                ]
            }
        }
    ],
    "light": "ATK, DEF, HP+15% / Crit DMG +20%",
    "dark": "Upon a Crit Hit, there is a 10% chance of ATK Spd increasing by 300 and Crit DMG increasing by 60% for 5 sec. Does not activate again during activation.",
    "background": {
        "profile": {
            "gender": "missing",
            "race": "missing",
            "age": "missing",
            "height": "missing",
            "birthday": "missing",
            "constellation": "missing",
            "likes": "Current self",
            "dislikes": "Past self"
        },
        "story": "He is Cleo's escort and is protecting her at Dominiks's request. A former member of a group of assassins, he risked his life and went rogue for some unknown reason. Having lived as an assassin, he rarely shows much respect toward others, but his hardships have made him an experienced and shrewd man who treats those who help him with fairness.",
        "itemIntroductions": {
            "weapon": "The group of assassins known as the Laughing Mask has been the master of the Orvel's underworld for a long time. Only the best assassin of the Laughing Mask is allowed to wield this dreadful pair of daggers. It is said that the wounds inflicted by these daggers never heal, and that their victims inevitably bleed to death. According to the legend, these daggers were made from the scythe of the Grim Reaper.",
            "soul": "Blades always carry with them a vile stench of blood and death, Sometimes, one might hear the scream of the victim s the blades fell. It is a symbol of Laughing Mask, and the proof of the cruelest killer.\nRoi, upon realizing that he will neither escape nor ignore this weapon, swore to remain as the last wielder of this weapon, no matter what it costs.\n'I will not deny any sins that have committed in the past. I will embrace them all, and walk as a shadow.'\nIt was that moment, a specter reaper made his appearance from the dark, as if he was rising up. The reaper's aura of death was so strong that it felt like it would consume Roi at any moment, but his eyes were also beaming with bizarre curiosity. That was when Roi realized that the reaper will be watching his every move, until the day he meets his end.",
            "treasures": [
                "A bagh nakh in the shape of a beast's claw. It's a concealed weapon made with a Damascus blade, used by the assassins from the east, to maximize the effect of Shadow Blade. Forged with heat and blood, Shadow Blade is known as a cursed weapon lusting for blood. Most people, with the exception of skilled assassins, keep away from it.",
                "A dangerous hood made with the secret method of the Laughing Mask. It was made with the legendary soma that is said to provide endless vitality and the secret of the Laughing Mask. Soma's hood increases the morale of an assassin inside the dark curtain, increasing their ATK, and granting dexterity, maximizing P. Dodge.",
                "The mask that Roi destroyed when he left the Laughing Mask assassins. Assassins mercilessly aim for their enemy's vital points, and they wear masks to suppress their emotions when they eliminate their targets. Roi faces the split mask, and goes behind his enemies to kill them with his Blade Claws to protect his friends.",
                "A ring to commemorate Roy's completion of mastering a new skill. Roy crafted this ring to celebrate for mastering his new Hacking techniques without relying on the techniques of the Laughing Masks. Engraved on the ring is an image of Specter Redeal, which serves as a purpose to overcome the past and remind him of his mistakes."
            ]
        }
    },
    "skins": [],
    "voice": {
        "actor": {
            "jp": "N/A",
            "kr": "N/A",
            "en": "N/A"
        },
        "lines": {
            "jp": [],
            "kr": [],
            "en": []
        }
    }
}