{
  "name": "Aselica",
  "title": "Guardian of the Sun",
  "class": "Knight",
  "damageType": "Magic",
  "position": "Front",
  "uw": {
    "name": "Solar Halo, Ignisius",
    "effect": "When a normal attack hits the enemy 5 times, the target takes 20|24|29|35|42|50% more M.DMG for 10 seconds and is stunned for 0.5 seconds."
  },
  "skills": [
    {
      "id": 1,
      "skillInfo": [{
        "skillNumber": "s1",
        "name": "Sword of the Sun",
        "effect": "Deals M.DMG to enemy and surrounding enemies within range, and inflicts Stun for 3 sec.",
        "cooldown": 9,
        "cost": 2
      }],
      "light": "After activation, increases ATK spd by 350 for 5 sec.",
      "dark": "Reduces cooldown by 2 sec.",
      "books": [
        "Dmg is increased by 10%",
        "Dmg is increased by 15%",
        "Stun duration is increased by 2 sec."
      ],
      "ut": {
        "name": "Light of the Dawn",
        "effect": "Dispels all positive effects from enemies within range, and recovers own Mana by 200 upon hit. "
      }
    },
    {
      "id": 2,
      "skillInfo": [
        {
          "skillNumber": "s2",
          "name": "Blessing of the Sun",
          "effect": "Imbues the Blessing of the Sun to the ally with the highest ATK, reducing cooldown of all skills by 20% and increasing ATK for 15 sec.",
          "cooldown": 20,
          "cost": 2
        }],
      "light": "Increases Mana Cost by 1, and grants the effect to the 2 allies with the highest ATK.",
      "dark": "Used while ignoring negative effects on self and removes negative effects on the target ally.",
      "books": [
        "ATK boost is increased by 10%.",
        "ATK boost is increased by 15%.",
        "ATK boost is increased by 25%."
      ],
      "ut": {
        "name": "Bracelet of the Sun",
        "effect": "Dispels all positive effects from enemies within range, and recovers own Mana by 200 upon hit. "
      }
    },
    {
      "id": 3,
      "skillInfo": [
        {
          "skillNumber": "s3",
          "name": "Judgment of the Sun",
          "effect": "Takes position, focuses to heal HP of nearby allies, excluding self, 8 times and increases their P.DEF for 5 sec. Deals M.DMG on enemies within range over 8 times, and decreases their M.DEF for 5 sec. After the end of the casting, heals HP of allies within range, excluding self, and deals M.DMG on enemies, and knocks them down for 3 sec.",
          "cooldown": 20,
          "cost": 4
        }],
      "light": "Reduces Mana Cost by 1.",
      "dark": "Increases the duration of M.DEF reduction effect by 5 sec.",
      "books": [
        "DMG and Heal rate are increased by 10%.",
        "DMG and Heal rate are increased by 15%.",
        "DMG and Heal rate are increased by 25%."
      ],
      "ut": {
        "name": "Guardian's Trumpet",
        "effect": "Gains Immunity to CC while in use, and increases P.DEF Boost and M.DEF Reduction by 20%."
      }
    },
    {
      "id": 4,
      "skillInfo": [
        {
          "skillNumber": "s4",
          "name": "Curse of the Sun",
          "effect": "Upon attack, inflicts Curse of the Sun on the target for 10 sec. Enemies with 10 stacks of Curses of the Sun will consume the stack to receive ??? M.DMG, and become inflicted with Blind for 2 sec, having their ATK reduced by 20% for 10 sec.",
          "cooldown": 0,
          "cost": 0
        }],
      "light": "Changes ATK Reduction to 30%.",
      "dark": "Activates the effect upon reaching the 7th stack of Curse of the Sun.",
      "books": [
        "DMG is increased by 10%.",
        "DMG is increased by 15%.",
        "DMG is increased by 25%."
      ],
      "ut": {
        "name": "Will of Light",
        "effect": " Increases the duration of Blind by 1 sec. Upon activation, targets take 10% increased M.DMG for 10 sec."
      }
    }
  ],
  "light": "ATK, DEF, HP+15% / P. Block +200.",
  "dark": "At the beginning of the first battle, increases P.DEF of the ally with the highest ATK by 20% of P.DEF. This effect cannot be dispelled.",
  "skins": ["Base", "The Holy Vow", "Beachside", "Fallen Angel", "Loading Screen"],
  "background": {
    "story": "A powerful angel who defends the haven of angels. Even among the Angels who wield the power of light, she has a special connection to the sun, whose devine light she uses to fight against darkness. She is tasked with the protection of the soul of the other angels awaiting resurrection. When the Holy Sword reappeared in the world, she heeded the divine call to join to join the new protector of the world. She will see to it that no chosen warrior would ever succumb to the darkness again.",
    "profile": [
      "She is 170cm (about 5'6' feet).",
      "Her birthday is September 22nd.",
      "Her constellation is Judgment Layan.",
      "She likes her fellow kinsmen, and enforcing order.",
      "She dislikes demons.",
      "She is a knight of the righteous heavens and she punishes evil with her sword and protects the weak with her shield.",
      "She descended in order to defeat the Demons who are ruining the earthly realm.",
      "She is the second angel to be released, after Arch.",
      "Likely the chosen warrior in her story is Kyle, who seems to have fallen into path of darkness."
    ]
  }
}
